import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class ancientHistory_1_te extends StatefulWidget {
  final String? userIdentifier;

  ancientHistory_1_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<ancientHistory_1_te> createState() => _ancientHistory_1_teState();
}

class _ancientHistory_1_teState extends State<ancientHistory_1_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(100, null); // Initialize with the number of questions

  List<Question> _questions = [

    Question(
      questionText: "హరప్పా లిపికి సంబంధించి కింది వాటిలో ఏది ఎక్కువ సంభావ్యమైనది?",
      options: ["పిక్టోగ్రాఫిక్", "సుమేరియన్", "ప్రోటో ద్రావిడియన్", "సంస్కృతి"],
      correctAnswerIndex: 0,
      explanation:"ఇది Boustrophedon శైలిలో వ్రాయబడింది. ఇది మొదటి పంక్తిలో కుడి నుండి ఎడమకు మరియు రెండవ పంక్తిలో ఎడమ నుండి కుడికి వ్రాయబడింది. ఇది ప్రకృతిలో చిత్రలేఖనంగా ఉంది. ఈ స్క్రిప్ట్‌లో 400 నుండి 500 గుర్తు లేదా చిహ్నం సింబాలిక్ ఉపయోగించబడింది. ఇది ఇప్పటికీ అర్థం చేసుకోలేని స్క్రిప్ట్.",
    ),

    Question(
      questionText: "గ్రేట్ బాత్ కనుగొనబడింది",
      options: ["మొహెంజో-దారో", "కలిబంగన్", "లోథాల్", "హరప్పా"],
      correctAnswerIndex: 0,
      explanation:"ది గ్రేట్ బాత్ మొహెంజో-దారోలో కనుగొనబడింది. ఒక కాంస్య నృత్యం చేసే అమ్మాయి మొహెంజొదారోలో కనుగొనబడింది. ధాన్యాగారం మొహెంజో దారోలో అతిపెద్ద భవనం.",
    ),

    Question(
      questionText: "నెపోలియన్ ఆఫ్ ఇండియా అని ఏ చక్రవర్తి పిలుస్తారు?",
      options: ["సముద్రగుప్త", "చంద్రగుప్త II విక్రమాదిత్య", "అశోక", "కనిష్క"],
      correctAnswerIndex: 0,
      explanation:"సముద్రగుప్తుడు గుప్త రాజవంశానికి చెందిన గొప్ప పాలకుడు. అతన్ని V. A. స్మిత్ భారతదేశానికి నెపోలియన్ అని పిలిచాడు. అతను వైష్ణవ మతాన్ని అనుసరించేవాడు కానీ ఇతర మతాలను సహించేవాడు.",
    ),

    Question(
      questionText: "మనిషి కనుగొన్న మొదటి లోహం",
      options: ["జింక్", "కాపర్", "ఐరన్", "అల్యూమినియం"],
      correctAnswerIndex: 1,
      explanation:"రాగి మానవులు కనుగొన్న మొదటి లోహం. మొదటి పెంపుడు జంతువు కుక్క. సింధు నాగరికత కలిగిన ప్రజలకు ఇనుము వాడకం తెలియదు. ఇది చాల్‌కోలిథిక్ యుగానికి సమకాలీనమైనది.",
    ),

    Question(
      questionText: "అలహాబాద్ ప్రశస్తి ఎవరు రచించారు?",
      options: ["హరిసేన", "వసుమిత్ర", "అశ్వఘోష", "నాగార్జున"],
      correctAnswerIndex: 0,
      explanation:"హరిసేన సముద్ర గుప్తుని ఆస్థాన కవి.",
    ),

    Question(
      questionText: "సింధు లోయ యొక్క ప్రధాన నౌకాశ్రయం ఏది?",
      options: ["చాన్హుదారో", "మెహర్‌ఘర్", "లోథాల్", "కాలిబంగన్"],
      correctAnswerIndex: 2,
      explanation:"లోథాల్ ప్రస్తుత గుజరాత్ రాష్ట్రంలో భాగంగా ఉండేది. ఇది భోగాబర్ నది ఒడ్డున ఉన్న ఓడరేవు. 1954లో S.R. రావు దీనిని కనుగొన్నారు.",
    ),

    Question(
      questionText: "దక్షిణాదిలో సముద్రగుప్తుని విధానం ఏమిటి?",
      options: ["దిగ్విజయ్", "ధర్మవిజయ", "విజయం", "పైన ఏదీ కాదు"],
      correctAnswerIndex: 0,
      explanation:"సముద్రగుప్తుని యొక్క ఈ విధానాన్ని దిగ్విజయ లేదా దక్షిణాది శత్రు రాజులను ఓడించడం, గ్రహణం లేదా రాజ్యాలపై అధికారాన్ని పొందడం, ఆపై అనుగ్రహుడు వారి రాజ్యాలను తన ఆధిపత్యంలో పాలించడాన్ని అనుమతించడం. అతని దక్షిణాది ప్రచారంలో అతను వినయం చేశాడు. పన్నెండు మంది రాకుమారులు.",
    ),

    Question(
      questionText: "బెంగాల్ మొదటి స్వతంత్ర రాజు ఎవరు?",
      options: ["గోపాలా", "మహాసేన్‌గుప్తా", "శశాంక", "కింగ్ గణేష్"],
      correctAnswerIndex: 2,
      explanation:"శశాంక గౌడ రాజ్యానికి రాజు మరియు రాజధాని పశ్చిమ బెంగాల్‌లోని ప్రస్తుత ముర్షిదాబాద్‌లోని కర్ణసుబర్ణ.",
    ),

    Question(
      questionText: "సింధు లోయ నాగరికత వారికి చెందినది",
      options: ["మెసోలిథిక్ కాలం", "చల్‌కోలిథిక్ పీరియడ్", "నియోలిథిక్ పీరియడ్", "పాలియోలిథిక్ పీరియడ్"],
      correctAnswerIndex: 1,
      explanation:"సింధు నాగరికతను హరప్పా నాగరికత అని కూడా పిలుస్తారు. ఇది చాల్కోలిథిక్ కాలం మరియు కాంస్య యుగానికి చెందినది. వారికి ఇనుప లోహం గురించి తెలియదు. సింధు లోయ నాగరికతకు స్పష్టమైన కాలక్రమం లేదు. వారు చురుకుగా ఉన్నారని భావిస్తారు. 2900 BC నుండి 1700 BC వరకు.",
    ),

    Question(
      questionText: "రామచరిత ఎవరు రాశారు?",
      options: ["సంధ్యాకర నంది", "తులసీ దాస్", "బాణభట్ట", "కాళిదాసు"],
      correctAnswerIndex: 0,
      explanation:"రామచరిత్ సంస్కృతంలో సంధ్యాకర్ నందిచే వ్రాయబడింది. అతను బెంగాల్ పాల రాజ్యానికి సమకాలీన కవి. హరిప్రసాద్ శాస్త్రి అనే బెంగాలీ పండితుడు కనుగొన్న రామచరితం యొక్క తాళపత్ర వ్రాతప్రతి కలకత్తా ఆసియాటిక్ సొసైటీ మ్యూజియంలో భద్రపరచబడింది. . రామచరితమానస్‌ను గోస్వామి తులసీదాస్ అవధి భాషలో రాశారు.",
    ),

    Question(
      questionText: "పురాణాల మొత్తం సంఖ్య",
      options: ["43", "10", "11", "18"],
      correctAnswerIndex: 3,
      explanation:"మొత్తం 18 పురాణాలు ఉన్నాయి. ఇందులో పురాణాలు, విశ్వోద్భవం, వివిధ ఇతిహాసాలు, జానపద విశ్వాసాలు, చట్ట నియమాలు, ఇతర అంశాలు వంటి అనేక విషయాలు ఉన్నాయి. ఇది యుద్ధనౌకను త్యాగం నుండి విగ్రహానికి మార్చాలని సూచించింది. ఆరాధన. ఇది మూఢనమ్మకాలతో ఎక్కువగా రంగులు వేయబడిన పురాతన పురాణం యొక్క వివరణను కలిగి ఉంది. పురాణాలు బ్రహ్మ పురాణం, విష్ణు పురాణం, శివ పురాణం, పద్మ పురాణం మొదలైనవి. పురాతన పురాణం మత్స్య పురాణం.",
    ),

    Question(
      questionText: "సులపాణి ప్రసిద్ధ కళాకారిణి",
      options: ["పాల కాలం", "సేన కాలం", "కుషాణ కాలం", "గుప్త కాలం"],
      correctAnswerIndex: 1,
      explanation:"సేన యుగంలోని అత్యుత్తమ కళాకారులలో సులపాణి ఒకరు. ఇతర ముఖ్యమైన వ్యక్తులు సంధ్యాకర్ నంది, మాధవకర్, జయదేవ్, ఉమాపతి, ధోయి మొదలైనవి.",
    ),

    Question(
      questionText: "దివ్య నాయకురాలు",
      options: ["ముండా తిరుగుబాటు", "సంతల్ తిరుగుబాటు", "కైవర్త తిరుగుబాటు", "కోల్ తిరుగుబాటు"],
      correctAnswerIndex: 2,
      explanation:"వఇ వరేంద్ర తిరుగుబాటు (దీనిని కైవర్త తిరుగుబాటు అని కూడా అంటారు), ఇది కింగ్ మహిపాల IIకి వ్యతిరేకంగా జరిగిన తిరుగుబాటు. దివ్య నేతృత్వంలో తిరుగుబాటు జరిగింది. ఈ తిరుగుబాటు ద్వారా కైవర్త (సంఘం) వరేంద్రను పట్టుకోగలిగారు. తరువాత, 1082 CEలో, కింగ్ రాంపాల పొరుగు సామంతుల సహాయంతో విమ్‌ను ఓడించి తన మాతృభూమి అయిన వరేంద్రను తిరిగి స్వాధీనం చేసుకున్నాడు. రాంపాల మూడవ పాల సామ్రాజ్య స్థాపకుడిగా చెబుతారు. రాంచరిత్ రచయిత సంధ్యాకర్ నంది అతని ఆస్థాన కవి.",
    ),

    Question(
      questionText: "హరప్పా ప్రజలు ఏ దేశ ప్రజలతో వ్యాపారం సాగించారు?",
      options: ["రష్యా", "సుమెర్", "చైనా", "ఇరాన్"],
      correctAnswerIndex: 1,
      explanation:"సింధు ప్రజలు సుమేరియన్లు, మెసొపొటేమియన్లు (ఇప్పుడు దక్షిణ ఇరాక్)తో జలమార్గాలు మరియు భూ మార్గాల్లో వ్యాపారం చేసేవారు. హరప్పా ప్రాంతాన్ని సుమర్‌లో మెలూహా అని పిలిచేవారు. ఈ రెండు నాగరికతల మధ్య వాణిజ్యానికి స్పష్టమైన ఆధారాలు ఉన్నాయి. అదే ముద్రలు కనుగొనబడ్డాయి. రెండు ప్రాంతాలలో.",
    ),

    Question(
      questionText: "సముద్ర గుప్తుని ఆస్థాన కవి ఎవరు?",
      options: ["ఆర్యభట్ట", "హరిసేన", "అశ్వఘోష", "నాగార్జున"],
      correctAnswerIndex: 1,
      explanation:"హరిసేన 4వ శతాబ్దపు సంస్కృత కవి, గుప్త చక్రవర్తి, సముద్రగుప్తుని ఆస్థానంలో ముఖ్యమైన వ్యక్తి. 345 C.E.లో వ్రాయబడిన అతని అత్యంత ప్రసిద్ధ పద్యం, సముద్రగుప్తుని ధైర్యాన్ని వివరిస్తుంది మరియు అలహాబాద్ స్తంభంపై చెక్కబడింది.",
    ),

    Question(
      questionText: "క్రిందివాటిలో రాజస్థాన్‌లో ఉన్న హరప్పా ప్రాంతం ఏది?",
      options: ["కాలీబంగన్", "లోథాల్", "మొహెంజొదారో", "సుక్తగెండోర్"],
      correctAnswerIndex: 0,
      explanation:"కాలీబంగన్ బి. కె. థాపర్‌ని కనుగొన్నాడు. ఇది ఘఘరా నది ఒడ్డున ఉంది.",
    ),

    Question(
      questionText: "చివరి తీర్థంకరుని పేరు",
      options: ["సిద్ధార్థ", "శిలభద్ర", "పార్శ్వనాథ్", "మహావీర"],
      correctAnswerIndex: 3,
      explanation:"జైనుల ప్రకారం, తీర్థంకరుడు మరణం మరియు పునర్జన్మ యొక్క చక్రాన్ని స్వయంగా జయించి, ఇతరులు అనుసరించడానికి మార్గం సుగమం చేసిన వ్యక్తి. 24 మంది తీర్థంకరులు ఉన్నారు. మొదటి తీర్థంకరుడు రిషభనాథుడు. అతనికి ఉపయోగించే చిహ్నం ఎద్దు. 23వ తీర్థంకరుడు పార్శ్వనాథ్ మరియు అతనికి ఉపయోగించిన చిహ్నం పాము. ఇరవై నాలుగవ తీర్థంకరుడు మహావీరుడు మరియు అతనికి ఉపయోగించిన చిహ్నం సింహం. అతను జైనమతానికి అసలు స్థాపకుడు.",
    ),

    Question(
      questionText: "వరి సాగు హరప్పా ప్రాంతంతో ముడిపడి ఉంది",
      options: ["కోట్ డిజి", "రోపర్", "కాలిబంగన్", "లోథాల్"],
      correctAnswerIndex: 3,
      explanation:"లోథాల్ ప్రపంచంలోనే మొట్టమొదటి డాక్‌యార్డ్. దీనిని హరప్పా నాగరికత ప్రవేశ ద్వారం అని పిలుస్తారు, ఇది ప్రస్తుత గుజరాత్‌లో ఉంది. లోథాల్‌ను 1954లో ఎస్.ఆర్. రావు కనుగొన్నారు. లోథాల్ మరియు రంగ్‌పూర్‌లలో లభించిన బియ్యం ఆధారాలు గుజరాత్‌లో ఉన్నాయి. ",
    ),

    Question(
      questionText: "టాక్సిలా ప్రసిద్ధ సైట్",
      options: ["గుప్త కళ", "మౌర్య కళ", "ప్రారంభ వేద యుగం", "గాంధార కళ"],
      correctAnswerIndex: 3,
      explanation:"తక్షసిలా సింధూ నది తూర్పు ఒడ్డున ఉన్న ప్రాచీన భారతదేశంలోని ఒక ముఖ్యమైన నగరం. దీని మూలాలు c. 1000 BCE నాటివి. Taxila అంటే కట్ స్టోన్ నగరం లేదా సంస్కృతంలో తక్ష రాక్ అనేది పంజాబ్‌లో ఉన్న ఒక ముఖ్యమైన పురావస్తు ప్రదేశం. పాకిస్తాన్.",
    ),

    Question(
        questionText: "సభ మరియు సమితి రెండు ప్రజాస్వామ్య సంస్థలు",
        options: ["భారతదేశంలోని కొండ తెగలు", "సింధు లోయ ప్రజలు", "ఋగ్వేద ఆర్యులు", "ద్రావిడియన్లు"],
        correctAnswerIndex: 2,
        explanation:"వేద యుగంలో, ఋగ్వేదంలో పేర్కొన్న విధంగా సభ, సమితి, విధాత మరియు గణ వంటి అనేక సభలు ఉన్నాయి. వీటిలో సభ మరియు సమితి రెండు ముఖ్యమైన సమావేశాలు. స్త్రీల స్థితి ప్రశంసనీయం. సభ మరియు సమితిలో పాల్గొనేందుకు అనుమతించారు.రాజు మరియు చీఫ్ కూడా సభ మరియు సమితి మద్దతును గెలుచుకోవడానికి ఉత్సాహం చూపారు.వేద యుగంలో ముఖ్యమైన పరిపాలనా విభాగం: జన: ఆర్య తెగలను జానా అని పిలిచేవారు, కానీ ప్రస్తావన లేదు జానపద. విస్: జనాన్ని విస్ అని పిలిచే గ్రామాల సమూహంగా విభజించారు మరియు వ్రజపతి నాయకత్వం వహించారు.",
    ),

    Question(
      questionText: "'ఐ-హోల్' ప్రశస్తి ఎవరు కంపోజ్ చేసారు?",
      options: ["హరిసేన", "నాయనికర్", "కౌటిల్య", "రబీకీర్తి"],
      correctAnswerIndex: 3,
      explanation:"ఐహోళే కర్ణాటక రాష్ట్రంలో ఉంది మరియు చాళుక్యుల మొదటి రాజధాని. ఇక్కడ చాలా శాసనాలు కనుగొనబడ్డాయి, అయితే మేగుటి ఆలయంలోని శాసనం ఐహోళే శాసనంగా ప్రసిద్ధి చెందింది. ఇందులో చాళుక్యుల అనేక చారిత్రక సంఘటనలు ఉన్నాయి. ఇది సంస్కృతంలో వ్రాయబడింది మరియు ఇది పాత కన్నడ లిపిని ఉపయోగిస్తుంది.పులకేసిన్ II చేత హర్షవర్ధనను ఓడించడం మరియు పల్లవులపై చాళుక్యుల విజయం గురించి కూడా ప్రస్తావనలు ఉన్నాయి.ఐహోల్ నుండి బాదామికి రాజధానిని పులకేసిన్ I బదిలీ చేసిన ప్రస్తావన ఉంది. ఐహోల్ శాసనం రవికీర్తి, చాళుక్య రాజు పులకేశిని II ఆస్థాన కవి రచించాడు. పులకేసిన్ II 610 నుండి 642 CE వరకు పాలించాడు.",
    ),

    Question(
      questionText: "సింధు లోయ నాగరికత అంటారు",
      options: ["రాతి యుగం", "ఐరోn వయస్సు", "పట్టణ", "గ్రామీణ"],
      correctAnswerIndex: 2,
      explanation:"సింధూ లోయ నాగరికత యొక్క అత్యంత అద్భుతమైన లక్షణం దాని పట్టణ ప్రణాళిక. ఇది పట్టణ నాగరికత, అయితే వేద కాలం గ్రామీణ స్వభావం. హోరోప్పా మరియు మొహెంజో-దారో రెండింటిలోనూ గ్రేట్ బాత్ కనుగొనబడింది. ధాన్యాగారం పెద్ద భవనం. మొహెంజో-దారోలో కనుగొనబడిన సింధు నాగరికత.",
    ),

    Question(
      questionText: "శశాంక రాజధాని ఎక్కడ ఉంది?",
      options: ["కర్ణసువర్ణ", "లఖ్నావతి", "సమతాత", "తామ్రలిప్త"],
      correctAnswerIndex: 0,
      explanation:"శశాంక బెంగాల్ ప్రాంతంలో గౌడ రాజ్యం అని పిలువబడే ఏకీకృత పాలిటీకి మొదటి స్వతంత్ర రాజు. అతను 600 CE మరియు 636/7 CE మధ్య ఉన్నాడు, అయితే ఇతర ఆధారాలు 590 మరియు 625 CE మధ్య అతని పాలనను కలిగి ఉన్నాయి. అతను సమకాలీనుడు హర్ష మరియు కామరూపానికి చెందిన భాస్కరవర్మన్. అతని రాజధాని పశ్చిమ బెంగాల్‌లోని ప్రస్తుత ముర్షిదాబాద్‌లోని కర్ణసుబర్ణలో ఉంది. బెంగాలీ క్యాలెండర్ అభివృద్ధి తరచుగా శశాంకకు ఆపాదించబడింది ఎందుకంటే ప్రారంభ తేదీ అతని పాలనలో ఉంది.",
    ),

    Question(
      questionText: "ఉపనిషత్తులు చుట్టూ సంకలనం చేయబడ్డాయి",
      options: ["1000 BC", "1600-600 BC", "600 BC", "800 BC"],
      correctAnswerIndex: 2,
      explanation:"ఉపనిషత్తులు మతపరమైన మరియు తాత్విక గ్రంథాల సమాహారాన్ని కలిగి ఉంటాయి. ఇది బహుశా 800 BCE మరియు 500 BC మధ్య వ్రాయబడింది. సాంప్రదాయ వైదిక మతాన్ని భారతీయ సమాజం Questionించే సమయం ఇది.",
    ),
    Question(
      questionText: "హరప్పా లిపికి సంబంధించి కింది వాటిలో ఏది ఎక్కువ సంభావ్యమైనది?",
      options: ["పిక్టోగ్రాఫిక్", "సమ్మేరియన్", "ప్రోటో ద్రావిడియన్", "సంస్కృతి"],
      correctAnswerIndex: 0,
      explanation:"ఇది Boustrophedon శైలిలో వ్రాయబడింది. ఇది మొదటి పంక్తిలో కుడి నుండి ఎడమకు మరియు రెండవ పంక్తిలో ఎడమ నుండి కుడికి వ్రాయబడింది. ఇది ప్రకృతిలో చిత్రలేఖనంగా ఉంది. ఈ స్క్రిప్ట్‌లో 400 నుండి 500 గుర్తు లేదా చిహ్నం సింబాలిక్ ఉపయోగించబడింది. ఇది ఇప్పటికీ అర్థం చేసుకోలేని స్క్రిప్ట్.",
    ),

    Question(
      questionText: "గ్రేట్ బాత్ కనుగొనబడింది",
      options: ["మొహెంజో-దారో", "కలిబంగన్", "లోథాల్", "హరప్పా"],
      correctAnswerIndex: 0,
      explanation:"ది గ్రేట్ బాత్ మొహెంజో-దారోలో కనుగొనబడింది. ఒక కాంస్య నృత్యం చేసే అమ్మాయి మొహెంజొదారోలో కనుగొనబడింది. ధాన్యాగారం మొహెంజో దారోలో అతిపెద్ద భవనం.",
    ),

    Question(
      questionText: "నెపోలియన్ ఆఫ్ ఇండియా అని ఏ చక్రవర్తి పిలుస్తారు?",
      options: ["సముద్రగుప్త", "చంద్రగుప్త II విక్రమాదిత్య", "అశోక", "కనిష్క"],
      correctAnswerIndex: 0,
      explanation:"సముద్రగుప్తుడు గుప్త రాజవంశానికి చెందిన గొప్ప పాలకుడు. అతన్ని V. A. స్మిత్ భారతదేశానికి నెపోలియన్ అని పిలిచాడు. అతను వైష్ణవ మతాన్ని అనుసరించేవాడు కానీ ఇతర మతాలను సహించేవాడు.",
    ),

    Question(
      questionText: "మనిషి కనుగొన్న మొదటి లోహం",
      options: ["జింక్", "కాపర్", "ఐరన్", "అల్యూమినియం"],
      correctAnswerIndex: 1,
      explanation:"రాగి మానవులు కనుగొన్న మొదటి లోహం. మొదటి పెంపుడు జంతువు కుక్క. సింధు నాగరికత కలిగిన ప్రజలకు ఇనుము వాడకం తెలియదు. ఇది చాల్‌కోలిథిక్ యుగానికి సమకాలీనమైనది.",
    ),

    Question(
      questionText: "అలహాబాద్ ప్రశస్తి ఎవరు రచించారు?",
      options: ["హరిసేన", "వసుమిత్ర", "అశ్వఘోష", "నాగార్జున"],
      correctAnswerIndex: 0,
      explanation:"హరిసేన సముద్ర గుప్తుని ఆస్థాన కవి.",
    ),

    Question(
      questionText: "సింధు లోయ యొక్క ప్రధాన నౌకాశ్రయం ఏది?",
      options: ["చాన్హుదారో", "మెహర్‌ఘర్", "లోథాల్", "కాలిబంగన్"],
      correctAnswerIndex: 2,
      explanation:"లోథాల్ ప్రస్తుత గుజరాత్ రాష్ట్రంలో భాగంగా ఉండేది. ఇది భోగాబర్ నది ఒడ్డున ఉన్న ఓడరేవు. 1954లో S.R. రావు దీనిని కనుగొన్నారు.",
    ),

    Question(
      questionText: "దక్షిణాదిలో సముద్రగుప్తుని విధానం ఏమిటి?",
      options: ["దిగ్విజయ్", "ధర్మవిజయ", "విజయం", "పైన ఏదీ కాదు"],
      correctAnswerIndex: 0,
      explanation:"సముద్రగుప్తుని యొక్క ఈ విధానాన్ని దిగ్విజయ లేదా దక్షిణాది శత్రు రాజులను ఓడించడం, గ్రహణం లేదా రాజ్యాలపై అధికారాన్ని పొందడం, ఆపై అనుగ్రహుడు వారి రాజ్యాలను తన ఆధిపత్యంలో పాలించడాన్ని అనుమతించడం. అతని దక్షిణాది ప్రచారంలో అతను వినయం చేశాడు. పన్నెండు మంది రాకుమారులు.",
    ),

    Question(
      questionText: "బెంగాల్ మొదటి స్వతంత్ర రాజు ఎవరు?",
      options: ["గోపాలా", "మహాసేన్‌గుప్తా", "శశాంక", "కింగ్ గణేష్"],
      correctAnswerIndex: 2,
      explanation:"శశాంక గౌడ రాజ్యానికి రాజు మరియు రాజధాని పశ్చిమ బెంగాల్‌లోని ప్రస్తుత ముర్షిదాబాద్‌లోని కర్ణసుబర్ణ.",
    ),

    Question(
      questionText: "సింధు లోయ నాగరికత వారికి చెందినది",
      options: ["మెసోలిథిక్ కాలం", "చల్‌కోలిథిక్ పీరియడ్", "నియోలిథిక్ పీరియడ్", "పాలియోలిథిక్ పీరియడ్"],
      correctAnswerIndex: 1,
      explanation:"సింధు నాగరికతను హరప్పా నాగరికత అని కూడా పిలుస్తారు. ఇది చాల్కోలిథిక్ కాలం మరియు కాంస్య యుగానికి చెందినది. వారికి ఇనుప లోహం గురించి తెలియదు. సింధు లోయ నాగరికతకు స్పష్టమైన కాలక్రమం లేదు. వారు చురుకుగా ఉన్నారని భావిస్తారు. 2900 BC నుండి 1700 BC వరకు.",
    ),

    Question(
      questionText: "రామచరిత ఎవరు రాశారు?",
      options: ["సంధ్యాకర నంది", "తులసీ దాస్", "బాణభట్ట", "కాళిదాసు"],
      correctAnswerIndex: 0,
      explanation:"రామచరిత్ సంస్కృతంలో శాన్ రచించాడుధ్యాకర్ నంది. అతను బెంగాల్ పాల రాజ్యానికి సమకాలీన కవి. హరిప్రసాద్ శాస్త్రి అనే బెంగాలీ పండితుడు కనుగొన్న రామచరితం యొక్క తాళపత్ర వ్రాతప్రతి కలకత్తా ఆసియాటిక్ సొసైటీ మ్యూజియంలో భద్రపరచబడింది. రామచరితమానస్‌ను గోస్వామి తులసీదాస్ అవధి భాషలో రాశారు.",
    ),

    Question(
      questionText: "పురాణాల మొత్తం సంఖ్య",
      options: ["43", "10", "11", "18"],
      correctAnswerIndex: 3,
      explanation:"మొత్తం 18 పురాణాలు ఉన్నాయి. ఇందులో పురాణాలు, విశ్వోద్భవం, వివిధ ఇతిహాసాలు, జానపద విశ్వాసాలు, చట్ట నియమాలు, ఇతర అంశాలు వంటి అనేక విషయాలు ఉన్నాయి. ఇది యుద్ధనౌకను త్యాగం నుండి విగ్రహానికి మార్చాలని సూచించింది. ఆరాధన. ఇది మూఢనమ్మకాలతో ఎక్కువగా రంగులు వేయబడిన పురాతన పురాణం యొక్క వివరణను కలిగి ఉంది. పురాణాలు బ్రహ్మ పురాణం, విష్ణు పురాణం, శివ పురాణం, పద్మ పురాణం మొదలైనవి. పురాతన పురాణం మత్స్య పురాణం.",
    ),

    Question(
      questionText: "సులపాణి ప్రసిద్ధ కళాకారిణి",
      options: ["పాల కాలం", "సేన కాలం", "కుషాణ కాలం", "గుప్త కాలం"],
      correctAnswerIndex: 1,
      explanation:"సేన యుగంలోని అత్యుత్తమ కళాకారులలో సులపాణి ఒకరు. ఇతర ముఖ్యమైన వ్యక్తులు సంధ్యాకర్ నంది, మాధవకర్, జయదేవ్, ఉమాపతి, ధోయి మొదలైనవి.",
    ),

    Question(
      questionText: "దివ్య నాయకురాలు",
      options: ["ముండా తిరుగుబాటు", "సంతల్ తిరుగుబాటు", "కైవర్త తిరుగుబాటు", "కోల్ తిరుగుబాటు"],
      correctAnswerIndex: 2,
      explanation:"వరేంద్ర తిరుగుబాటు (కైవర్త తిరుగుబాటు లేదా కోల్ తిరుగుబాటు అని కూడా పిలుస్తారు) బెంగాల్‌లోని వరేంద్ర ప్రాంతంలో బ్రిటిష్ ఈస్ట్ ఇండియా కంపెనీ పాలనకు వ్యతిరేకంగా జరిగిన ప్రజా తిరుగుబాటు. ఈ తిరుగుబాటుకు కైవర్త రైతు దివ్య నాయకత్వం వహించాడు.",
    ),

    Question(
      questionText: "బుద్ధుని కాలంలో ప్రసిద్ధ వైద్యుడు",
      options: ["చరక", "జీవక", "కౌటిల్య", "నచికేత"],
      correctAnswerIndex: 1,
      explanation:"సుశ్రుతుడు 'ఫాదర్ ఆఫ్ ఇండియన్ మెడిసిన్' మరియు 'ఫాదర్ ఆఫ్ ప్లాస్టిక్ సర్జరీ' అని పిలువబడ్డాడు. జీవిక హర్యాంక రాజు బింబిసార మరియు బుద్ధుని వ్యక్తిగత వైద్యురాలు.",
    ),

    Question(
      questionText: "ఏ పురాతన గ్రంథంలో మీరు వర్ణ వ్యవస్థకు సంబంధించిన తొలి సూచనను కనుగొన్నారు?",
      options: ["అథర్వ వేదం", "శతపథ బ్రాహ్మణం", "మను సంహిత", "ఋగ్వేదం"],
      correctAnswerIndex: 3,
      explanation:"పురుష సూక్త, వేదాలలోని 10వ మండలం నాలుగు వర్ణాలను పేరుతో పేర్కొన్నాయి - అయినప్పటికీ 'వర్ణం' అనే పదం ప్రస్తావించబడలేదు. 1వ మరియు 10వ మండలాలు తరువాతి వేద కాలంలో సంకలనం చేయబడ్డాయి.",
    ),

    Question(
      questionText: "ప్రాచీన భారతదేశంలో ఎంతమంది తీర్థంకరులు ఉన్నారు?",
      options: ["23", "24", "16", "22"],
      correctAnswerIndex: 1,
      explanation:"జైనుల ప్రకారం, తీర్థంకరుడు మరణం మరియు పునర్జన్మ యొక్క చక్రాన్ని స్వయంగా జయించి, ఇతరులు అనుసరించడానికి మార్గం సుగమం చేసిన వ్యక్తి. 24 మంది తీర్థంకరులు ఉన్నారు. మొదటి తీర్థంకరుడు రిషభనాథుడు. అతనికి ఉపయోగించే చిహ్నం ఎద్దు. 23వ తీర్థంకరుడు పార్శ్వనాథ్ మరియు అతనికి ఉపయోగించిన చిహ్నం పాము. ఇరవై నాలుగవ తీర్థంకరుడు మహావీరుడు మరియు అతనికి ఉపయోగించిన చిహ్నం సింహం. అతను జైనమతానికి అసలు స్థాపకుడు.",
    ),

    Question(
      questionText: "సింధు ప్రజలకు తెలియని లోహం ఏది?",
      options: ["కాంస్య", "బంగారం", "రాగి", "ఇనుము"],
      correctAnswerIndex: 3,
      explanation:"సింధు నాగరికతను హరప్పా నాగరికత అని కూడా పిలుస్తారు. ఇది చాల్కోలిథిక్ కాలం మరియు కాంస్య యుగానికి చెందినది. వారికి ఇనుప లోహం గురించి తెలియదు. సింధు లోయ నాగరికతకు స్పష్టమైన కాలక్రమం లేదు. వారు చురుకుగా ఉన్నారని భావిస్తారు. 2900 BC నుండి 1700 BC వరకు.",
    ),

    Question(
      questionText: "బౌద్ధమతం ప్రకారం, అన్ని దుఃఖాలకు కారణం",
      options: ["తాణా", "క్రోధ్", "మాయ", "కామ"],
      correctAnswerIndex: 0,
      explanation:"బుద్ధుడు (ఆర్య సత్యాలు) ద్వారా నాలుగు గొప్ప సత్యాలు: దుఃఖం (బాధ, తృప్తి చెందలేనిది, బాధాకరమైనది) అనేది సంసార రంగంలో ఉనికి యొక్క సహజ లక్షణం. ఈ దుఃఖం యొక్క సముదాయ (మూలం, ఉద్భవించడం), ఇది ఉద్భవిస్తుంది లేదా ' తాణా ('తృష్ణ, కోరిక లేదా అనుబంధం')తో కలిసి వస్తుంది. ఈ దుఖా యొక్క నిరోధ (నిలిపివేయడం, ముగింపు) ఈ తన్హాను త్యజించడం లేదా వదిలివేయడం ద్వారా సాధించవచ్చు. తన్హాను త్యజించడం మరియు దుక్కాను నిలిపివేయడం. అవి సాంప్రదాయకంగా బుద్ధుడు అందించిన మొదటి బోధనగా గుర్తించబడ్డాయి మరియు బౌద్ధమతంలో అత్యంత ముఖ్యమైన బోధనలలో ఒకటిగా పరిగణించబడతాయి.",
    ),

    Question(
      questionText: "క్రింది దేవుళ్ళలో ఏది ఋగ్వేద కాలానికి చెందినది కాదు?",
      options: ["శివ", "అదితి", "ఇంద్ర", "మారుత్"],
      correctAnswerIndex: 0,
      explanation:"ఋగ్వేదాలలో చెప్పబడిన దేవుళ్ళు ఇంద్రుడు, అగ్ని, వరుణుడు, సోమము, సావిత్రి, విష్ణువు, అదితి, అప్సరసలు, రుద్ర, ఉష, మరియు పృథ్వీ మరియు ఇంకా చాలా మంది ఉన్నారు. కానీ అక్కడ శివుని ప్రస్తావన లేదు. ఇంద్రుడు పురంధరగా పిలువబడ్డాడు ( అంటే కోటను విచ్ఛిన్నం చేసేవాడు).250 ఋగ్వేద శ్లోకాలు ఇంద్రుడికి అంకితం చేయబడ్డాయి. అతను అత్యంత ముఖ్యమైన దైవత్వం మరియు అగ్ని జాబితాలో 2వ స్థానంలో ఉన్నాడు.",
    ),

    Question(
      questionText: "అతి పురాతన వేదం",
      options: ["యజుర్వేదం", "సంవేదం", "అథర్వవేదం", "ఋగ్వేదం"],
      correctAnswerIndex: 3,
      explanation:"ఋగ్వేదాలు పురాతన మతంప్రపంచంలోని ఔస్ టెక్స్ట్. ఇందులో 1,208 శ్లోకాలు మరియు 10,600 శ్లోకాలు ఉన్నాయి. 10 మండలాలను కలిగి ఉంటుంది.",
    ),

    Question(
      questionText: "భారతీయ తత్వశాస్త్రం యొక్క పురాతన పాఠశాల",
      options: ["వైశేషిక", "కర్మ మీమాంస", "యోగ", "సాంఖ్య"],
      correctAnswerIndex: 3,
      explanation:"భారతీయ తత్వశాస్త్రం అనేది భారత ఉపఖండంలో అభివృద్ధి చెందిన తాత్విక సంప్రదాయాలను సూచిస్తుంది. సాంప్రదాయిక వర్గీకరణ మూడు ప్రత్యామ్నాయ ప్రమాణాలలో ఒకదానిపై ఆధారపడి సనాతన (ఆస్తిక) మరియు హెటెరోడాక్స్ (నాస్తిక) తత్వశాస్త్ర పాఠశాలలను విభజిస్తుంది: అది వేదాలను సరైన మూలంగా విశ్వసిస్తుందా. జ్ఞానం; పాఠశాల బ్రాహ్మణ మరియు ఆత్మ యొక్క ప్రాంగణాన్ని విశ్వసిస్తుందా; మరియు పాఠశాల మరణానంతర జీవితాన్ని మరియు దేవతలను విశ్వసిస్తుందా. ఈ హిందూ దృక్కోణం నుండి, సనాతన (ఆస్తిక) భారతీయ హిందూ తత్వశాస్త్రంలో ఆరు ప్రధాన పాఠశాలలు ఉన్నాయి-న్యాయ, వైశేషిక , సాంఖ్య, యోగ, మీమాంస, మరియు వేదాంత, మరియు ఐదు ప్రధాన హెటెరోడాక్స్ (నాస్తిక) పాఠశాలలు-జైన్, బౌద్ధ, అజీవిక, అజ్ఞాన మరియు చార్వాక. అయితే, వర్గీకరణకు ఇతర పద్ధతులు ఉన్నాయి; ఉదాహరణకు, విద్యారణ్య భారతీయ తత్వశాస్త్రంలోని పదహారు పాఠశాలలను గుర్తిస్తుంది. శైవ మరియు రాసేశ్వర సంప్రదాయాలకు చెందిన వాటిని చేర్చడం ద్వారా.",
    ),

    Question(
      questionText: "ఋగ్వేదంలో గాయత్రీ మంత్రం ఎవరిని సంబోధిస్తుంది?",
      options: ["సావిత్రి", "ఉషస్", "ఇంద్ర", "అగ్ని"],
      correctAnswerIndex: 0,
      explanation:"ప్రసిద్ధ గాయత్రీ మంత్రం సావిత్రికి సంబోధించబడింది. గాయత్రీ మంత్రం ఋగ్వేదంలోని మూడవ మండలంలో ప్రస్తావించబడింది. ఇది సౌర దేవత సావిత్రికి ప్రార్థన చేయడానికి విశ్వామిత్ర ఋషిచే స్వరపరచబడింది. సావిత్రుడు, వేద సూర్య దేవత. గరిష్ట సంఖ్య శ్లోకాలు ఇంద్రునికి అంకితం చేయబడ్డాయి.",
    ),

    Question(
      questionText: ". బుద్ధుడు పుట్టాడు",
      options: ["623 B.C", "602 B.C", "523 B.C", "563 B.C"],
      correctAnswerIndex: 3,
      explanation:"బౌద్ధ సంప్రదాయం ప్రకారం, గౌతమ బుద్ధుడు 563 BCE నుండి 483 BCE మధ్య జీవించాడు. అతను శాక్య వంశంలో ఒక కులీన కుటుంబంలో జన్మించాడు. నేపాల్‌లోని కపిలవస్తు సమీపంలోని లుంబినిలో జన్మించాడు.\nఅదనపు సమాచారం: తల్లిదండ్రులు: శుద్ధోదన (తండ్రి) మాయా దేవి (తల్లి) జీవిత భాగస్వామి: యశోధరా పిల్లలు: రాహుళ ఇతర పేర్లు: శాక్యముని ('శాక్యుల ఋషి') మాస్టర్స్(గురువులు): అలర కలమ మరియు ఉద్దక రామపుట్ట మరణించారు(మహాపరినిర్వాణ): c. 483 BCE (వయస్సు 80) ఖుషినగర్, మల్లా రిపబ్లిక్ (ప్రకారం బౌద్ధ సంప్రదాయానికి)",
    ),
    Question(
      questionText: "వేద సాహిత్యం ఏ కాలంలో కూర్చబడింది?",
      options: ["1500 B.C-1000 B.C.", "1200 B.C-1000 B.C.", "1000 B.C.", "3000 B.C -2500 B.C."],
      correctAnswerIndex: 0,
      explanation:"తరువాతి వేద యుగం: 1000—600 B.C\nనాలుగు వేదాలు ఉన్నాయి: ఋగ్వేదం, యజుర్వేదం, సామవేదం మరియు అథర్వవేదం. ప్రతి వేదానికి నాలుగు ఉపవిభాగాలు ఉన్నాయి - సంహితలు (మంత్రాలు మరియు దీవెనలు), ఆరణ్యకాలు (ఆచారాలపై వచనం, వేడుకలు, త్యాగాలు మరియు ప్రతీకాత్మక త్యాగాలు), బ్రాహ్మణాలు (ఆచారాలు, వేడుకలు మరియు త్యాగాలపై వ్యాఖ్యానాలు), మరియు ఉపనిషత్తులు (ధ్యానం, తత్వశాస్త్రం మరియు ఆధ్యాత్మిక జ్ఞానం గురించి చర్చించే గ్రంథాలు). ఉపనిషత్తులు భిన్నమైన శ్రమనా సంప్రదాయాలకు సమానమైన ఆలోచనలను చర్చిస్తాయి.",
    ),
    Question(
      questionText: " సింధు లోయ నాగరికతను ఎవరు కనుగొన్నారు?",
      options: ["రఖల్‌దాస్ బెనర్జీ", "ఎ. ఎల్. బాషమ్", "సర్ లియోనార్డ్ వూలీ", "వి. ఎస్. అగర్వాల్"],
      correctAnswerIndex: 0,
      explanation:"సర్ జాన్ హుబర్ట్ మార్షల్ (సర్ జాన్ మార్షల్) ఆధ్వర్యంలో ఒక పురావస్తు ప్రచారం ప్రారంభించబడింది. ఇతర సభ్యులు రాయ్ బహదూర్ దయా రామ్ సాహ్ని మరియు మధో సరూప్ వాట్స్. వారు 1921లో హరప్పా త్రవ్వకాలు ప్రారంభించారు, పురాతన నాగరికతకు సంబంధించిన భవనాలు మరియు కళాఖండాలను కనుగొన్నారు. 1922లో రాఖల్ దాస్ బెనర్జీ, ఎర్నెస్ట్ J. H. మాకే మరియు మార్షల్‌లచే మొహెంజో-దారోలో కనుగొనబడిన వాటి ద్వారా ఇవి త్వరలో పూర్తి చేయబడ్డాయి. 1931 నాటికి, మొహెంజో-దారోలో చాలా వరకు త్రవ్వకాలు జరిగాయి.",
    ),
    Question(
      questionText: " బౌద్ధ మత గ్రంథం త్రిపిటకం వ్రాయబడింది",
      options: ["బెంగాలీ", "పాలీ", "సంస్కృతం", "హిందీ"],
      correctAnswerIndex: 1,
      explanation:"త్రిపిటక పాళీ భాషలో వ్రాయబడింది. పిటక అంటే బుట్ట. సన్యాసుల నుండి ఆశించిన క్రమశిక్షణ (వినయ పీఠక), ఉపన్యాసపు బుట్ట (సూత్ర పితక, నికాయలు) మరియు ప్రత్యేక సిద్ధాంతాల బుట్ట (అభిధర్మ పిఠక). • వినయ: సంఘానికి సంబంధించిన నియంత్రణా చట్రం.\n• సూత్రం: 10,000 కంటే ఎక్కువ సూత్రాలు/బోధనలను కలిగి ఉంది.\n• అభిధమ్మం: బౌద్ధ సిద్ధాంతం యొక్క తాత్విక మరియు మానసిక విశ్లేషణ మరియు వివరణ.",
    ),
    Question(
      questionText: "భారతదేశంలో ఆర్యుల మొదటి శాశ్వత నివాసం",
      options: ["సింధ్", "గుజరాత్", "పంజాబ్", "రాజస్థాన్"],
      correctAnswerIndex: 2,
      explanation:"పంజాబ్",
    ),
    Question(
      questionText: "ఆర్యన్ అనే పదం సూచిస్తుంది",
      options: ["పాస్టోరల్ సొసైటీ", "బ్రహ్మచారి", "సాగు", "ఒక జాతి"],
      correctAnswerIndex: 3,
      explanation:"ఆర్యులకు సంబంధించి అనేక అభిప్రాయాలు ఉన్నాయి. కానీ ఆర్యన్ అనేది ఒక భాషా సమూహం, జాతి కాదు. గ్రీక్, లాటిన్, జర్మనీ, పర్షియా మొదలైన ఇండో-యూరోపియన్ భాష మాట్లాడే ప్రజలు భారతదేశానికి వచ్చారు. ఆర్యన్లు అని పిలుస్తారు, వారు తమను తాము నోబెల్ తరగతిగా భావించారు, వారు మొదట ఇండో-గంగేటి సమీపంలో స్థిరపడ్డారుc(ప్రస్తుతం పంజాబ్‌లో) విమానం భారతదేశంలో.",
    ),
    Question(
      questionText: " బౌద్ధ సిద్ధాంతాలు ఇందులో ఉన్నాయి",
      options: ["ఉపనిషత్తులు", "ధమ్మపదం", "జాతకాలు", "శతపథాలు"],
      correctAnswerIndex: 1,
      explanation:"ధమ్మపద అనేది పద్య రూపంలో బుద్ధుని సూక్తుల సమాహారం మరియు అత్యంత విస్తృతంగా చదివిన మరియు బాగా తెలిసిన బౌద్ధ గ్రంథాలలో ఒకటి. ధమ్మపదం యొక్క అసలు వెర్షన్ ఖుద్దాక నికాయలో ఉంది, ఇది థెరవాడ పాలి కానన్ యొక్క విభాగం. బౌద్ధమతం.",
    ),
    Question(
      questionText: "బుద్ధుడు తన మొదటి ఉపన్యాసాలను ఎక్కడ బోధించాడు?",
      options: ["కాశి", "సారనాథ్", "కుషీనగర్", "బోధ్ గయా"],
      correctAnswerIndex: 1,
      explanation:"సారనాథ్",
    ),
    Question(
      questionText: "బుద్ధుడు మరియు మహావీరుడు ఇద్దరికీ ఏ పాలకుడు సమకాలీనుడు?",
      options: ["ప్రద్యోత్", "అజాతశత్రు", "బింబిసార", "చంద్రగుప్త"],
      correctAnswerIndex: 1,
      explanation:"అజాతశత్రు, అజాతశత్తు లేదా అజాతశత్రు (సంస్కృతం: Ajātaśatru, Pāli: Ajātasattu; 492 నుండి 460 BCE లేదా 5వ శతాబ్దం BCE) తూర్పు భారతదేశంలోని మగధ యొక్క హర్యాంక రాజవంశానికి చెందిన రాజు. అతను బింబిసార రాజు కుమారుడు. మహావీరుడు మరియు గౌతమ బుద్ధుడు ఇద్దరికీ సమకాలీనుడు.",
    ),
    Question(
      questionText: " ప్రారంభ బౌద్ధ సాహిత్యంలో ప్రస్తావించబడిన జిబాకా ఒక",
      options: ["వ్యాపారి", "వైద్యుడు", "బోధిసత్వ", "రాజు"],
      correctAnswerIndex: 1,
      explanation:"వైద్యుడు",
    ),
    Question(
      questionText: " కింది వాటిలో ఏది త్రిపిటకం యొక్క మూడు బుట్టలలో భాగం కాదు?",
      options: ["సుత్త", "అభిధమ్మ", "జాతకాలు", "వినయ"],
      correctAnswerIndex: 2,
      explanation:"పాళీలో టిపిటక అంటే మూడు బుట్టలు (తి = మూడు, పిటక = బుట్ట).\nమూడు బుట్టలు (గ్రంధాల)\n1. వినయ-పిటక: శంఖం యొక్క మూలం; సన్యాసులు మరియు సన్యాసినులకు నియమాలు.\n2. సూత్రం- పిటక: బుద్ధుని ఉపన్యాసాలు.\n3. అభిధర్మ-పిటక: బౌద్ధ మనస్తత్వశాస్త్రం మరియు తత్వశాస్త్రంపై రచనలు మరియు ఉపన్యాసాలు.",
    ),
    Question(
      questionText: " తరువాత కాలంలో జైన అని పిలువబడిన శాఖ యొక్క అసలు పేరు",
      options: ["నిగ్రంథాస్", "అర్హంత్", "తీర్థంకరులు", "జినా"],
      correctAnswerIndex: 0,
      explanation:"నిగ్రంథాస్",
    ),
    Question(
      questionText: "సిలోనీస్ సంప్రదాయం ప్రకారం బుద్ధుని పరినిర్బాణం జరిగింది",
      options: ["543 B.C.", "546 B.C.", "483 B.C.", "486 B.C."],
      correctAnswerIndex: 2,
      explanation:"483 B.C.",
    ),
    Question(
      questionText: " కింది వాటిలో బౌద్ధ వంశపారంపర్య గ్రంథం ఏది?",
      options: ["అభిధమ్మపిటక", "దీపవంశ", "సుత్తపిటక", "వినయపిటక"],
      correctAnswerIndex: 1,
      explanation:"ముద్రరాక్షస అనేది మౌర్య చక్రవర్తి చంద్రగుప్త మౌర్య (పాలన: 324 BCE–297BCE) భారతదేశంలో అధికారంలోకి వచ్చిన విషయాన్ని వివరించే విశాఖదత్త యొక్క సంస్కృత భాషా నాటకం. విశాఖదత్త గుప్త చక్రవర్తి II చంద్రగుప్తుని సమకాలీనుడు మరియు నివసించాడు. 4వ శతాబ్దం చివరి నుండి 5వ శతాబ్దం ప్రారంభం వరకు.",
    ),
    Question(
      questionText: "కౌటిల్య మరియు చంద్రగుప్త మౌర్యుల చేతిలో నందాల క్షీణత సంస్కృత నాటకంలో స్పష్టంగా చిత్రీకరించబడింది",
      options: ["మత్తవిలాస", "ముద్రరాక్షస", "మృచ్ఛకటిక", "దేవి చంద్రగుప్తా"],
      correctAnswerIndex: 1,
      explanation:"ముద్రరాక్షస అనేది మౌర్య చక్రవర్తి చంద్రగుప్త మౌర్య (పాలన: 324 BCE–297BCE) భారతదేశంలో అధికారంలోకి వచ్చిన విషయాన్ని వివరించే విశాఖదత్త యొక్క సంస్కృత భాషా నాటకం. విశాఖదత్త గుప్త చక్రవర్తి II చంద్రగుప్తుని సమకాలీనుడు మరియు నివసించాడు. 4వ శతాబ్దం చివరి నుండి 5వ శతాబ్దం ప్రారంభం వరకు.",
    ),
    Question(
      questionText: " అలహాబాద్ స్తంభ శాసనం చెక్కబడింది",
      options: ["రుద్రదమన్", "బాణభట్ట", "హరిసేన", "రవికిర్తి"],
      correctAnswerIndex: 2,
      explanation:"హరిసేన",
    ),




  ];
  int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

  late Timer _examTimer;

  @override
  void initState() {
    super.initState();
    _loadLikedData();
    //_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
    _startriversTimer();
  }
  void _startriversTimer() {
    _examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
      setState(() {
        _elapsedTimeInSeconds++;
      });
    });
  }

  Future<void> _loadLikedData() async {
    // Load liked questions data here
    // ...
  }

  void _nextQuestion() {
    setState(() {
      if (_currentQuestionIndex < _questions.length - 1) {
        _currentQuestionIndex++;
        _selectedAnswerIndex = null;
      } else {
        // All questions have been answered, navigate to results screen
        _navigateToResults();
      }
    });
  }

  void _previousQuestion() {
    setState(() {
      if (_currentQuestionIndex > 0) {
        _currentQuestionIndex--;
        _selectedAnswerIndex = null;
      }
    });
  }

  void _navigateToResults() {
    // Navigate to results screen
    _examTimer.cancel(); // Cancel the exam timer before navigating
    Navigator.of(context).pushReplacement(
      MaterialPageRoute(
        builder: (context) => ResultsScreen(
          userAnswers: _userAnswers,
          questions: _questions,
          elapsedTimeInSeconds: _elapsedTimeInSeconds,
        ),
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
        backgroundColor: Colors.blueAccent,
      ),
      body: GestureDetector(
        onVerticalDragEnd: (details) {
          if (details.velocity.pixelsPerSecond.dy < 0) {
            // Swipe up detected, move to the next question
            _nextQuestion();
          } else if (details.velocity.pixelsPerSecond.dy > 0) {
            // Swipe down detected, move to the previous question
            _previousQuestion();
          }
        },
        onHorizontalDragEnd: (details) {
          if (details.primaryVelocity! > 0) {
            _previousQuestion();
          } else if (details.primaryVelocity! < 0) {
            _nextQuestion();
          }
        },
        child: ListView(
          padding: EdgeInsets.all(16.0),
          children: [
            MyBannerAdWidget(), // Add the banner ad here
            Text(
              "Question ${_currentQuestionIndex + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              _questions[_currentQuestionIndex].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),
            ..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
              final optionIndex = entry.key;
              final optionText = entry.value;
              return InkWell( // Added this InkWell
                onTap: () {
                  setState(() {
                    _selectedAnswerIndex = optionIndex;
                    _userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
                  });
                },
                child: ListTile(
                  title: Text(optionText),
                  leading: Radio<int>(
                    value: optionIndex,
                    groupValue: _selectedAnswerIndex,
                    onChanged: (int? value) {
                      setState(() {
                        _selectedAnswerIndex = value;
                        _userAnswers[_currentQuestionIndex] = value; // Store user's answer
                      });
                    },
                  ),
                ),
              );
            }).toList(),
            // Show correct answer if an option is selected
            if (_selectedAnswerIndex != null)
              Text(
                "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.green, // Set your desired color here
                ),
              ),

            MyBannerAdWidget(), // Add the banner ad here

          ],
        ),
      ),
      bottomNavigationBar: Container(
        color: Colors.red[400],
        child: Theme(
          data: Theme.of(context).copyWith(
            canvasColor: Colors.blueAccent[200],
          ),
          child: BottomNavigationBar(
            type: BottomNavigationBarType.fixed,
            items: const [
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
                label: '',
              ),
            ],
            onTap: (index) {
              if (index == 0) {
                _previousQuestion();
              } else if (index == 1) {
                _nextQuestion();
              }
            },
          ),
        ),
      ),
      // Overall exam timer display

      // Overall exam timer display
      // Overall exam timer display
      persistentFooterButtons: [
        Text(
          'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
      ],

    );
  }
  @override
  void dispose() {
    // Dispose of the exam timer when the widget is disposed
    _examTimer.cancel();
    super.dispose();
  }
}

class ResultsScreen extends StatelessWidget {
  final int elapsedTimeInSeconds;
  final List<int?> userAnswers;
  final List<Question> questions;

  ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


  int calculateScore() {
    int score = 0;
    for (int i = 0; i < questions.length; i++) {
      if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
        score++;
      }
    }
    return score;
  }
  String formatElapsedTime(int seconds) {
    int minutes = seconds ~/ 60;
    int remainingSeconds = seconds % 60;
    return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
  }
  @override
  Widget build(BuildContext context) {
    final int score = calculateScore();
    final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
    return Scaffold(
      appBar: AppBar(
        title: Text("Results"),
        actions: [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text("Completed Time: $completedTime" ),
          ),
        ],
      ),
      body: ListView(
        padding: EdgeInsets.all(16.0),
        children: [
          Text(
            "Your Score: $score/${questions.length}",
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16.0),
          for (int i = 0; i < questions.length; i++) ...[
            Text(
              "Question ${i + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              questions[i].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 8.0),
            Text(
              "Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              "Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 16.0),
            Text(
              "Explanation: ${questions[i].explanation}",
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),

          ],
        ],
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: ancientHistory_1_te(),
  ));
}
