import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class ljti_te extends StatefulWidget {
  final String? userIdentifier;

  ljti_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<ljti_te> createState() => _ljti_teState();
}

class _ljti_teState extends State<ljti_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(100, null); // Initialize with the number of questions

  List<Question> _questions = [

//90. LANDMARK తీర్పు మరియు వాటి ప్రభావాలు

    Question(
      questionText: "రొమేష్ థాపర్ కేసు (1950), సుప్రీం కోర్ట్ ప్రస్తావించిన ప్రాథమిక సమస్య ఏమిటి?",
      options:["ప్రివెంటివ్ డిటెన్షన్", "ఫ్రీడం ఆఫ్ ది ప్రెస్", "ల్యాండ్‌మార్క్ జడ్జిమెంట్స్", "కాన్స్టిట్యూషనల్ ఇంటర్‌ప్రెటేషన్"],
      correctAnswerIndex: 1,
      explanation:"రొమేష్ థాపర్ కేసులో ప్రస్తావించబడిన ప్రాథమిక సమస్య పత్రికా స్వేచ్ఛ. ఆర్టికల్ 19(1)(ఎ) ప్రకారం వాక్ స్వాతంత్య్రం మరియు భావప్రకటన స్వేచ్ఛలో ఆలోచనలను ప్రచారం చేసే స్వేచ్ఛ కూడా ఉందని సుప్రీంకోర్టు తీర్పు చెప్పింది.",
    ),

    Question(
      questionText: "క్రాస్ రోడ్స్ అనే వారపత్రిక ఆంగ్ల పత్రికపై మద్రాసు ప్రభుత్వం నిషేధం విధించడంపై సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:[
        "ఇది రాజ్యాంగబద్ధంగా సమర్థించబడింది.",
        "ఇది రాజ్యాంగ విరుద్ధమైనది మరియు శూన్యమైనదిగా ప్రకటించబడింది.",
        "దీనికి మరింత సమీక్ష అవసరం.",
        "ఇది ఆర్టికల్ 19(2) ప్రకారం చెల్లుబాటు అయ్యేదిగా పరిగణించబడింది."
      ],
      correctAnswerIndex: 1,
      explanation:"రోమేష్ థాపర్ కేసు (1950)లో క్రాస్ రోడ్స్ అనే వారపత్రిక ఆంగ్ల పత్రికపై మద్రాసు ప్రభుత్వం నిషేధం విధించడం రాజ్యాంగ విరుద్ధమని మరియు చెల్లదని సుప్రీం కోర్టు ప్రకటించింది.",
    ),

    Question(
      questionText: "రొమేష్ థాపర్ కేసు తదుపరి చట్టంపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "రాజ్యాంగంలో ఆర్టికల్ 21 పరిచయం.",
        "ఆర్టికల్ 19(2) ప్రకారం 'పబ్లిక్ ఆర్డర్'ని సహేతుకమైన పరిమితిగా చేర్చడం.",
        "వాక్ స్వాతంత్ర్యంపై పరిమితుల తొలగింపు.",
        "నివారణ నిర్బంధానికి సంబంధించిన ఆర్టికల్ 22 సవరణ."
      ],
      correctAnswerIndex: 1,
      explanation:"రొమేష్ థాపర్ కేసుకు కొనసాగింపుగా, 1వ సవరణ చట్టం (1951) వాక్ మరియు భావప్రకటనా స్వేచ్ఛపై ఆర్టికల్ 19(2) ప్రకారం సహేతుకమైన పరిమితిగా 'పబ్లిక్ ఆర్డర్'ని జోడించింది.",
    ),

    Question(
      questionText: "ఎకె గోపాలన్ కేసు (1950)లో ఏ ప్రాథమిక హక్కు ప్రస్తావించబడింది?",
      options:["సమానత్వం హక్కు", "మత హక్కు", "వాక్ స్వాతంత్య్ర హక్కు", "వ్యక్తిగత స్వేచ్ఛ హక్కు"],
      correctAnswerIndex: 3,
      explanation:"ఎకె గోపాలన్ కేసు (1950) ప్రాథమికంగా వ్యక్తిగత స్వేచ్ఛ ప్రాథమిక హక్కును ప్రస్తావించింది, ముఖ్యంగా రాజ్యాంగంలోని ఆర్టికల్ 21 ప్రకారం.",
    ),

    Question(
      questionText: "ఎకె గోపాలన్ కేసులో ప్రివెంటివ్ డిటెన్షన్ యాక్ట్ (1950)లోని సెక్షన్ 14కి సంబంధించి సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:[
        "ఇది చెల్లుబాటు అయ్యేది మరియు ప్రభావవంతమైనదిగా ప్రకటించబడింది.",
        "ఇది రాజ్యాంగ విరుద్ధమైనది మరియు శూన్యమైనదిగా పరిగణించబడింది.",
        "దీనికి తదుపరి శాసన సమీక్ష అవసరం.",
        "ఇది సహేతుకమైన పరిమితిగా పరిగణించబడింది."
      ],
      correctAnswerIndex: 1,
      explanation:"ఎకె గోపాలన్ కేసులో, ఆర్టికల్ 22 కింద హామీ ఇవ్వబడిన ప్రాథమిక హక్కును ఉల్లంఘించిన కారణంగా ప్రివెంటివ్ డిటెన్షన్ యాక్ట్ (1950)లోని సెక్షన్ 14ను సుప్రీం కోర్టు చెల్లుబాటు కాకుండా చేసింది.",
    ),

    Question(
      questionText: "ఆర్టికల్ 21కి సంబంధించి ఎకె గోపాలన్ కేసులో సుప్రీంకోర్టు ఎలాంటి వివరణను స్వీకరించింది?",
      options:[
        "విస్తృత (విస్తృత) వివరణ.",
        "టెక్స్ట్యులిస్ట్ (నియంత్రణ) వివరణ.",
        "ఉదారవాద వివరణ.",
        "సాహిత్య వివరణ."
      ],
      correctAnswerIndex: 1,
      explanation:"ఎకె గోపాలన్ కేసులో, ఆర్టికల్ 21లోని 'చట్టం' అనే పదం రాష్ట్ర-నిర్మిత చట్టాన్ని సూచిస్తుందని మరియు సహజ న్యాయ సూత్రాలను సూచించదని పేర్కొంటూ, ఆర్టికల్ 21 యొక్క పాఠ్యవాద (నియంత్రణ) వివరణను సుప్రీంకోర్టు స్వీకరించింది.",
    ),

    Question(
      questionText: "ఎకె గోపాలన్ కేసులో ఆర్టికల్ 21లోని 'చట్టం ద్వారా ఏర్పాటు చేయబడిన విధానం' అనే వ్యక్తీకరణను సుప్రీంకోర్టు ఎలా అర్థం చేసుకుంది?",
      options:[
        "అమెరికన్ న్యాయ వ్యవస్థలో లాగా 'డ్యూ ప్రాసెస్ ఆఫ్ లా'కి సమానం.",
        "ఏకపక్ష శాసన చర్యల నుండి రక్షణగా.",
        "కార్యనిర్వాహక చర్యల నుండి మాత్రమే రక్షణగా.",
        "వ్యక్తిగత స్వేచ్ఛ రక్షణకు అసంబద్ధం."
      ],
      correctAnswerIndex: 0,
      explanation:"AK గోపాలన్ కేసులో, ఆర్టికల్ 21లోని 'చట్టం ద్వారా ఏర్పాటు చేయబడిన విధానం' అనే వ్యక్తీకరణను అమెరికన్ వ్యక్తీకరణ 'డ్యూ ప్రాసెస్ ఆఫ్ లా' వలె అర్థం చేసుకోలేమని సుప్రీం కోర్ట్ ప్రకటించింది.",
    ),

    Question(
      questionText: "చంపకం దొరైరాజన్ కేసు (1951)లో ప్రస్తావించబడిన కీలక సమస్య ఏమిటి?",
      options:[
        "రాజ్యాంగాన్ని సవరించడానికి పార్లమెంటుకు అధికారం",
        "విద్యా సంస్థలలో ప్రవేశాలలో మతపరమైన రిజర్వేషన్లు",
        "రాష్ట్ర విస్తీర్ణాన్ని తగ్గించడానికి పార్లమెంటు అధికారం",
        "1వ సవరణ చట్టం (1951) చెల్లుబాటు"
      ],
      correctAnswerIndex: 1,
      explanation:"చంపకం దొరైరాజన్ కేసులో ప్రస్తావించిన కీలకమైన అంశం విద్యాసంస్థల్లో అడ్మిషన్లలో మతపరమైన రిజర్వేషన్. వివిధ వర్గాలకు ప్రభుత్వ మెడికల్ మరియు ఇంజినీరింగ్ కాలేజీలలో సీట్లు దామాషా ప్రకారం రిజర్వేషన్లు కల్పించాలనే కమ్యూనల్ ప్రభుత్వ ఉత్తర్వును సుప్రీంకోర్టు కొట్టివేసింది.",
    ),

    Question(
      questionText: "చంపకం దొరైరాజన్ కేసులో ఆదేశిక సూత్రాలకు సంబంధించి సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:[
        "వారు ప్రాథమిక హక్కులను అధిగమించగలరు.",
        "అవి ప్రాథమిక హక్కులకు అనుబంధంగా ఉన్నాయి.",
        "వారికి ప్రాథమిక హక్కులతో సమానమైన ప్రాముఖ్యత ఉంది.",
        "వారు ప్రాథమిక హక్కుల నుండి స్వతంత్రులు."
      ],
      correctAnswerIndex: 1,
      explanation:"చంపకం దొరైరాజన్ కేసులో, ఆదేశిక సూత్రాలు ప్రాథమిక హక్కులను అతిక్రమించలేవు లేదా కుదించలేవని సుప్రీం కోర్టు ప్రకటించింది. ఆదేశిక సూత్రాలు ప్రాథమిక హక్కులకు అనుగుణంగా ఉండాలి మరియు వాటికి అనుబంధంగా నడుస్తాయని పేర్కొంది.",
    ),

    Question(
      questionText: "చంపకం దొరైరాజన్ కేసు రాజ్యాంగంపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "రాజ్యాంగంలో ఆర్టికల్ 21 పరిచయం.",
        "ఆర్టికల్ 15లో క్లాజ్ (4) చొప్పించడం.",
        "ఆర్టికల్ 368 సవరణ.",
        "ఆస్తి హక్కు రద్దు."
      ],
      correctAnswerIndex: 1,
      explanation:"చంపకం దొరైరాజన్ కేసు ప్రభావం 1వ సవరణ చట్టం (1951) ద్వారా ఆర్టికల్ 15లో కొత్త క్లాజ్ (4)ని చేర్చడానికి దారితీసింది, ఇది సామాజికంగా మరియు విద్యాపరంగా వెనుకబడిన తరగతుల అభ్యున్నతి కోసం ప్రత్యేక నిబంధనలను రాష్ట్రాన్ని అనుమతించింది. పౌరులు లేదా SCలు మరియు STల కొరకు.",
    ),

    Question(
      questionText: "రాజ్యాంగ సవరణలకు సంబంధించి శంకరి ప్రసాద్ కేసు (1951)లో సుప్రీంకోర్టు ఏ అధికారాన్ని గుర్తించింది?",
      options:[
        "ఏదైనా రాజ్యాంగ సవరణను రద్దు చేసే అధికారం.",
        "ఆర్టికల్ 368 ప్రకారం రాజ్యాంగ సవరణలను సమీక్షించే అధికారం.",
        "ఆర్టికల్ 13(2) ప్రకారం ప్రాథమిక హక్కులను సవరించే అధికారం.",
        "ఆర్టికల్ 368 ప్రకారం ప్రాథమిక హక్కులను సవరించే అధికారం పార్లమెంటుకు ఉంది."
      ],
      correctAnswerIndex: 3,
      explanation:"శాంకరి ప్రసాద్ కేసు (1951)లో, రాజ్యాంగంలోని పార్ట్ IIIలో హామీ ఇవ్వబడిన ప్రాథమిక హక్కులను సవరించే అధికారాన్ని ఆర్టికల్ 368 ప్రకారం పార్లమెంటు సవరణ అధికారం కలిగి ఉందని సుప్రీంకోర్టు గుర్తించింది.",
    ),

    Question(
      questionText: "శాసనసభ చట్టం మరియు రాజ్యాంగ చట్టానికి సంబంధించి శంకరి ప్రసాద్ కేసులో సుప్రీంకోర్టు ఎలాంటి తేడా చేసింది?",
      options:[
        "రెండూ ఉల్లంఘించలేనివి.",
        "రాజ్యాంగ చట్టం ఉల్లంఘించలేనిది, కానీ శాసన చట్టం కాదు.",
        "రెండూ న్యాయ సమీక్షకు లోబడి ఉంటాయి.",
        "శాసన చట్టం నుండి రాజ్యాంగ చట్టం వేరు."
      ],
      correctAnswerIndex: 3,
      explanation:"శాంకరి ప్రసాద్ కేసులో, సుప్రీం కోర్ట్ శాసన చట్టం (సాధారణ చట్టం) మరియు రాజ్యాంగ చట్టం (రాజ్యాంగ సవరణ చట్టం) మధ్య వ్యత్యాసాన్ని చూపింది, ఆర్టికల్ 368 ప్రకారం రాజ్యాంగంలోని ఏదైనా నిబంధనను పార్లమెంటు సవరించవచ్చని పేర్కొంది.",
    ),

    Question(
      questionText: "ఆర్టికల్ 3 ప్రకారం పార్లమెంటు అధికారానికి సంబంధించి బెరుబారి యూనియన్ కేసు (1960)లో సుప్రీంకోర్టు ఏమి తీర్పునిచ్చింది?",
      options:[
        "పార్లమెంట్ భారత భూభాగాన్ని విదేశీ దేశానికి అప్పగించగలదు.",
        "రాష్ట్ర విస్తీర్ణాన్ని తగ్గించే అధికారం పార్లమెంటుకు ఉంది.",
        "ఆర్టికల్ 368 ప్రకారం రాజ్యాంగ సవరణ ద్వారా మాత్రమే భారత భూభాగాన్ని విడిచిపెట్టవచ్చు.",
        "ఆర్టికల్ 3 ప్రకారం పార్లమెంటు అధికారం రాష్ట్రాల మధ్య అంతర్గత సర్దుబాట్లకు పరిమితం చేయబడింది."
      ],
      correctAnswerIndex: 2,
      explanation:"బెరుబారి యూనియన్ కేసులో (1960), ఒక రాష్ట్ర విస్తీర్ణాన్ని తగ్గించడానికి ఆర్టికల్ 3 ప్రకారం పార్లమెంటుకు ఉన్న అధికారం విదేశీ దేశానికి భారత భూభాగాన్ని విడిచిపెట్టడాన్ని కవర్ చేయదని సుప్రీంకోర్టు తీర్పు చెప్పింది. భారత భూభాగాన్ని ఒక దేశానికి అప్పగించవచ్చు ఆర్టికల్ 368 ప్రకారం రాజ్యాంగ సవరణ ద్వారా మాత్రమే విదేశీ రాష్ట్రం.",
    ),

    Question(
      questionText: "బెరుబారి యూనియన్ కేసు (1960) రాజ్యాంగంపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "8వ సవరణ చట్టం (1960) అమలులోకి వచ్చింది.",
        "రాజ్యాంగంలో భాగంగా పీఠిక పరిచయం.",
        "ఆర్టికల్ 3 ప్రకారం పార్లమెంటు అధికారాన్ని రద్దు చేయడం.",
        "9వ సవరణ చట్టం (1960) అమలులోకి వచ్చింది."
      ],
      correctAnswerIndex: 3,
      explanation:"బెరుబరీ యూనియన్ కేసు (1960) 9వ సవరణ చట్టం (1960) అమలుకు దారితీసింది, ఇండో-పాక్ నిబంధనల ప్రకారం బెరుబరీ యూనియన్ (పశ్చిమ బెంగాల్) అని పిలువబడే నిర్దిష్ట భూభాగాన్ని పాకిస్తాన్‌కు బదిలీ చేయడం అమలులోకి వచ్చింది. 1958 ఒప్పందం.",
    ),

    Question(
      questionText: "నిందితురాలు నానావతికి సంబంధించి KM నానావతి కేసు (1961) ఫలితం ఏమిటి?",
      options:[
        "నానావతి నిర్దోషి",
        "సెక్షన్ 302 కింద నానావతిని దోషిగా నిర్ధారించడం",
        "నానావతికి జరిమానా విధించడం",
        "ఛార్జీలు లేకుండా నానావతి విడుదల"
      ],
      correctAnswerIndex: 1,
      explanation:"కెఎమ్ నానావతి కేసులో (1961), భారతీయ శిక్షాస్మృతిలోని సెక్షన్ 302 ప్రకారం నిందితుడు నానావతిని దోషిగా నిర్ధారించి, అతనికి జీవిత ఖైదు విధించినట్లు బాంబే హైకోర్టు ఇచ్చిన తీర్పును సుప్రీంకోర్టు ధృవీకరించింది. అతని భార్య పారామౌర్ హత్య సరైనదే.",
    ),

    Question(
      questionText: "కెఎమ్ నానావతి కేసు భారతదేశంలోని జ్యూరీ వ్యవస్థపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "జ్యూరీ వ్యవస్థను బలోపేతం చేసింది",
        "జ్యూరీ వ్యవస్థపై ప్రభావం లేదు",
        "దాని అభివృద్ధికి దారితీసింది",
        "దాని రద్దుకు దారితీసింది"
      ],
      correctAnswerIndex: 3,
      explanation:"KM నానావతి కేసు (1961) జ్యూరీ వ్యవస్థ పనితీరులో లోపాలను బయటపెట్టింది మరియు భారతదేశంలో దాని రద్దుకు దారితీసింది. కొత్త క్రిమినల్ ప్రొసీజర్ కోడ్, 1973, జ్యూరీ ద్వారా విచారణ విధానాన్ని పూర్తిగా తొలగించింది.",
    ),

    Question(
      questionText: "KM నానావతి కేసు తర్వాత భారతదేశంలో జ్యూరీ వ్యవస్థ రద్దు వెనుక కారణం ఏమిటి?",
      options:[
        "జ్యూరీ ట్రయల్స్‌తో అనుబంధించబడిన అధిక ఖర్చులు",
        "జ్యూరీ వ్యవస్థ యొక్క అసమర్థత",
        "జ్యూరీ వ్యవస్థకు ప్రజల మద్దతు లేకపోవడం",
        "వ్యవస్థను రద్దు చేయాలని ప్రభుత్వ ఆదేశం"
      ],
      correctAnswerIndex: 1,
      explanation:"KM నానావతి కేసు జ్యూరీ వ్యవస్థ పనితీరులో లోపాలను ఎత్తిచూపింది, ఇది భారతదేశంలో దాని రద్దుకు దారితీసింది. జ్యూరీ వ్యవస్థ యొక్క అసమర్థత ఈ నిర్ణయంలో ముఖ్యమైన అంశం.",
    ),

    Question(
      questionText: "IC గోలక్ నాథ్ కేసులో (1967), రాజ్యాంగాన్ని సవరించే పార్లమెంటు అధికారం గురించి సుప్రీం కోర్ట్ ఏ తీర్పునిచ్చింది?",
      options:[
        "ప్రాథమిక హక్కులతో సహా రాజ్యాంగంలోని ఏదైనా భాగాన్ని పార్లమెంటు సవరించవచ్చు.",
        "రాజ్యాంగంలోని పార్ట్ IIIలో హామీ ఇవ్వబడిన ప్రాథమిక హక్కులను పార్లమెంటు సవరించదు.",
        "రాజ్యాంగంలోని ప్రాథమికేతర అంశాలకు సవరించడానికి పార్లమెంటు అధికారం పరిమితం.",
        "సవరించడానికి పార్లమెంటు అధికారం న్యాయపరమైన ఆమోదానికి లోబడి ఉంటుంది."
      ],
      correctAnswerIndex: 1,
      explanation:"IC గోలక్ నాథ్ కేసు (1967)లో, రాజ్యాంగంలోని పార్ట్ IIIలో హామీ ఇవ్వబడిన ప్రాథమిక హక్కులను సంక్షిప్తం చేయడానికి లేదా తీసివేయడానికి ఆర్టికల్ 368 ప్రకారం సవరించడానికి పార్లమెంటు అధికారాన్ని ఉపయోగించరాదని సుప్రీంకోర్టు తీర్పు చెప్పింది.",
    ),

    Question(
      questionText: "ఐసి గోలక్ నాథ్ కేసులో సుప్రీం కోర్టు తన తీర్పు యొక్క భావి కార్యాచరణకు సంబంధించి ఏ సిద్ధాంతాన్ని వర్తింపజేసింది?",
      options:[
        "అధికార విభజన సిద్ధాంతం",
        "సమాఖ్య సిద్ధాంతం",
        "సమానత్వం యొక్క సిద్ధాంతం",
        "కాబోయే ఓవర్రూలింగ్ సిద్ధాంతం"
      ],
      correctAnswerIndex: 3,
      explanation:"IC గోలక్ నాథ్ కేసు (1967)లో, సుప్రీం కోర్ట్ భావి ఓవర్రూలింగ్ సిద్ధాంతాన్ని వర్తింపజేసింది. తీర్పుకు కేవలం భావి ఆపరేషన్ మాత్రమే ఉంటుందని మరియు రెట్రోస్పెక్టివ్ ఆపరేషన్ కాదని ప్రకటించింది.",
    ),

    Question(
      questionText: "IC గోలక్ నాథ్ కేసులో సుప్రీంకోర్టు తీర్పును 24వ సవరణ చట్టం (1971) ఎలా ప్రభావితం చేసింది?",
      options:[
        "ఇది సుప్రీంకోర్టు తీర్పును సమర్థించింది.",
        "ఇది సుప్రీంకోర్టు తీర్పును రద్దు చేసింది.",
        "ఇది తీర్పుపై ఎలాంటి ప్రభావం చూపలేదు.",
        "ఇది కాబోయే ఓవర్‌రూలింగ్ సిద్ధాంతాన్ని ధృవీకరించింది."
      ],
      correctAnswerIndex: 1,
      explanation:"24వ సవరణ చట్టం (1971) IC గోలక్ నాథ్ కేసులో సుప్రీంకోర్టు తీర్పును అధిగమించడానికి రూపొందించబడింది. రాజ్యాంగంలోని ఏదైనా భాగాన్ని, ప్రాథమిక హక్కులతో సహా, నిర్దేశించిన విధానానికి అనుగుణంగా సవరించే అధికారం పార్లమెంటుకు ఉందని అందించింది. ఆర్టికల్ 368లో డౌన్.",
    ),

    Question(
      questionText: "ఇందిరా నెహ్రూ గాంధీ కేసు (1975)లో ప్రస్తావించబడిన ప్రధాన సమస్య ఏమిటి?",
      options:[
        "ఎన్నికల ప్రక్రియ యొక్క చెల్లుబాటు",
        "రాజ్యాంగం యొక్క ప్రాథమిక నిర్మాణం",
        "అత్యవసర పరిస్థితి అమలు",
        "ఆర్టికల్ 359 సవరణ"
      ],
      correctAnswerIndex: 1,
      explanation:"ఇందిరా నెహ్రూ గాంధీ కేసు (1975)లో ప్రస్తావించబడిన ప్రధాన సమస్య రాజ్యాంగం యొక్క ప్రాథమిక నిర్మాణం. రాజ్యాంగం యొక్క ప్రాథమిక నిర్మాణం యొక్క సిద్ధాంతం యొక్క వర్తింపును సుప్రీంకోర్టు పునరుద్ఘాటించింది మరియు ఎన్నికల వివాదాలకు సంబంధించిన ఒక నిబంధనను కొట్టివేసింది. ప్రధానమంత్రి మరియు లోక్‌సభ స్పీకర్‌లు అన్ని కోర్టుల అధికార పరిధికి వెలుపల ఉన్నారు.",
    ),

    Question(
      questionText: "ఇందిరా నెహ్రూ గాంధీ కేసులో తీర్పు రాజ్యాంగంపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "ఆర్టికల్ 368లో కొత్త క్లాజుల చొప్పించడం",
        "42వ సవరణ చట్టం (1976) అమలు",
        "ప్రాథమిక నిర్మాణం యొక్క సిద్ధాంతం యొక్క రద్దు",
        "ఆర్టికల్ 359A రద్దు"
      ],
      correctAnswerIndex: 2,
      explanation:"ఇందిరా నెహ్రూ గాంధీ కేసులో తీర్పు ప్రభావం 42వ సవరణ చట్టం (1976) అమలుకు దారితీసింది, ఇది ఆర్టికల్ 368లో కొత్త క్లాజులను చొప్పించింది. ఈ నిబంధనలు ప్రాథమిక నిర్మాణ సిద్ధాంతాన్ని పలుచన చేయడానికి ఉద్దేశించబడ్డాయి. పార్లమెంటు సవరణ అధికారంపై పరిమితిగా పరిగణించబడింది.",
    ),

    Question(
      questionText: "ADM జబల్‌పూర్ కేసులో (1976), ఎమర్జెన్సీ సమయంలో జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛకు సంబంధించి సుప్రీం కోర్ట్ ఏ తీర్పునిచ్చింది?",
      options:[
        "జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ పరిరక్షణ",
        "జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛను నిలిపివేయడం",
        "జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ యొక్క విస్తరణ",
        "జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ కోసం రాష్ట్రంపై ఆధారపడటం"
      ],
      correctAnswerIndex: 1,
      explanation:"ADM జబల్‌పూర్ కేసు (1976)లో, ఆర్టికల్ 359 ప్రకారం రాష్ట్రపతి ఉత్తర్వుల ద్వారా జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ అమలును తాత్కాలికంగా నిలిపివేస్తే, రిట్ పిటిషన్‌పై డిటెన్యూకు ఎటువంటి లోకస్ స్టాండి ఉండదని సుప్రీంకోర్టు తీర్పు చెప్పింది. అతని నిర్బంధ చట్టబద్ధతను సవాలు చేసినందుకు. ఇది అంతర్గత భద్రతా నిర్వహణ చట్టం (MISA), 1971 యొక్క సెక్షన్ 16A(9) యొక్క రాజ్యాంగ చెల్లుబాటును సమర్థించింది.",
    ),

    Question(
      questionText: "ఆర్టికల్ 21 ప్రకారం జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛపై ADM జబల్‌పూర్ కేసు ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ యొక్క విస్తరణ",
        "అత్యవసర పరిస్థితుల్లో హెబియస్ కార్పస్ హక్కు యొక్క నిర్ధారణ",
        "జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ యొక్క లోపభూయిష్ట మరియు నిర్బంధ అర్ధం",
        "ప్రాథమిక హక్కుల కోసం న్యాయ రక్షణ పెంపుదల"
      ],
      correctAnswerIndex: 2,
      explanation:"ADM జబల్‌పూర్ కేసు (1976) ఆర్టికల్ 21 ప్రకారం జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ యొక్క లోపభూయిష్ట మరియు నిర్బంధ వివరణను కలిగి ఉంది. హేబియస్ కార్పస్ యొక్క ఏదైనా దావా జీవించే హక్కును అమలు చేయడానికి సమానమని సుప్రీం కోర్టు వాదించింది. మరియు ప్రెసిడెన్షియల్ ఆర్డర్ ద్వారా సస్పెండ్ చేయబడిన వ్యక్తిగత స్వేచ్ఛ.",
    ),

    Question(
      questionText: "44వ సవరణ చట్టం (1978) ADM జబల్‌పూర్ కేసులో తీర్పును ఎలా ప్రభావితం చేసింది?",
      options:[
        "ఇది సుప్రీంకోర్టు తీర్పును ధృవీకరించింది.",
        "ఇది తీర్పుపై ఎలాంటి ప్రభావం చూపలేదు.",
        "ఇది తీర్పును రద్దు చేసింది.",
        "ఇది జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ కోసం రాష్ట్రంపై ఆధారపడటాన్ని ధృవీకరించింది."
      ],
      correctAnswerIndex: 2,
      explanation:"44వ సవరణ చట్టం (1978) ఆర్టికల్ 21 ప్రకారం జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ యొక్క అమలును రాష్ట్రపతి ఉత్తర్వు ద్వారా సస్పెండ్ చేయడం సాధ్యం కాదని ఆర్టికల్ 359ని సవరించింది. ఈ సవరణను దృష్టిలో ఉంచుకుని, తీర్పు వెలువడింది ADM జబల్‌పూర్ కేసు ఇకపై మంచి చట్టం కాదు మరియు విద్యాపరమైన ప్రాముఖ్యత మాత్రమే మిగిలి ఉంది.",
    ),

    Question(
      questionText: "మేనకా గాంధీ కేసు (1978) ఆర్టికల్ 21 యొక్క వివరణపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "ఇది ఆర్టికల్ 21 యొక్క సంకుచిత వివరణను బలపరిచింది.",
        "ఇది భారతీయ న్యాయపరమైన వివరణలో 'డ్యూ ప్రాసెస్ ఆఫ్ లా' అనే అమెరికన్ భావనను ప్రవేశపెట్టింది.",
        "ఇది ఆర్టికల్ 21లో 'చట్టం ద్వారా ఏర్పాటు చేయబడిన విధానం' అనే భావనను రద్దు చేసింది.",
        "ఇది ఆర్టికల్ 21 యొక్క వివరణపై ఎటువంటి ప్రభావం చూపలేదు."
      ],
      correctAnswerIndex: 1,
      explanation:"మేనకా గాంధీ కేసు (1978) భారతీయ న్యాయపరమైన వివరణలో 'డ్యూ ప్రాసెస్ ఆఫ్ లా' అనే అమెరికన్ భావనను ప్రవేశపెట్టడం ద్వారా గణనీయమైన ప్రభావాన్ని చూపింది. ఇది ఆర్టికల్ 21 యొక్క విస్తృత వివరణను తీసుకుంది మరియు వ్యాసాలను పరస్పరం అనుసంధానించే 'బంగారు త్రిభుజం' నియమాన్ని స్థాపించింది. 14, 19 మరియు 21, తద్వారా ఆర్టికల్ 21 పరిధిని విస్తరించడం మరియు తదుపరి కేసులను ప్రభావితం చేయడం.",
    ),

    Question(
      questionText: "బచన్ సింగ్ కేసు (1980)లో మరణశిక్షను విధించే విషయంలో సుప్రీం కోర్ట్ ఏ తీర్పునిచ్చింది?",
      options:[
        "మరణశిక్ష అసమంజసమైనది మరియు ఆర్టికల్ 19ని ఉల్లంఘిస్తుంది.",
        "హత్య చేసే హక్కును ఆర్టికల్ 19 హామీ ఇస్తుంది.",
        "మరణశిక్ష ఆర్టికల్ 21ని ఉల్లంఘించదు.",
        "మరణశిక్ష మినహాయింపు కంటే నియమంగా ఉండాలి."
      ],
      correctAnswerIndex: 2,
      explanation:"బచన్ సింగ్ కేసు (1980)లో, భారత శిక్షాస్మృతిలోని సెక్షన్ 302లోని మరణశిక్ష నిబంధన ఆర్టికల్ 21ని ఉల్లంఘించదని సుప్రీం కోర్టు తీర్పునిచ్చింది. ఇది ఒక వ్యక్తి జీవితాన్ని హరించే హక్కు లేదా చెల్లుబాటు అయ్యే చట్టం ద్వారా ఏర్పాటు చేయబడిన న్యాయమైన, న్యాయమైన మరియు సహేతుకమైన ప్రక్రియకు అనుగుణంగా వ్యక్తిగత స్వేచ్ఛ.",
    ),

    Question(
      questionText: "బచన్ సింగ్ కేసు (1980) మరణశిక్షకు సంబంధించి ఏ సూత్రాన్ని స్థాపించింది?",
      options:[
        "హత్యకు మరణశిక్ష ఎల్లప్పుడూ సమర్థించబడుతుంది.",
        "మరణశిక్ష రాజ్యాంగ విరుద్ధం.",
        "మరణశిక్ష అనేది 'అరుదైన కేసుల్లో అరుదైనదిగా' ఉండాలి.",
        "అన్ని హత్య కేసులకు మరణశిక్ష తప్పనిసరి."
      ],
      correctAnswerIndex: 2,
      explanation:"బచన్ సింగ్ కేసు (1980) మరణశిక్ష 'అరుదైన కేసుల్లో అరుదైనదిగా' ఉండాలనే సూత్రాన్ని స్థాపించింది. మరణశిక్షను అసాధారణమైన మరియు గంభీరమైన పరిస్థితులకు మాత్రమే పరిమితం చేయాలని మరియు మరణశిక్షను నిర్ణయించేటప్పుడు నేరం మరియు నేరస్థుడు రెండింటి యొక్క అసాధారణ స్వభావాన్ని పరిగణనలోకి తీసుకోవాలని ఇది నొక్కి చెప్పింది.",
    ),
    Question(
      questionText: "42వ సవరణ చట్టం (1976) చేసిన సవరణలపై మినర్వా మిల్స్ కేసు (1980) ప్రభావం ఏమిటి?",
      options:[
        "ఇది రాజ్యాంగబద్ధంగా సవరణలను సమర్థించింది.",
        "అది ఆర్టికల్ 368 మరియు ఆర్టికల్ 31Gకి సవరణలు రాజ్యాంగ విరుద్ధమని ప్రకటించింది.",
        "ఇది పార్లమెంటు యొక్క అపరిమిత సవరణ శక్తిని నిర్ధారించింది.",
        "ఇది ప్రాథమిక హక్కులపై ఆదేశిక సూత్రాల ప్రాధాన్యతను నొక్కి చెప్పింది."
      ],
      correctAnswerIndex: 1,
      explanation:"మినర్వా మిల్స్ కేసు (1980) ఆర్టికల్ 368లోని క్లాజులు (4) మరియు (5) మరియు 42వ సవరణ చట్టం (1976) ద్వారా ఆర్టికల్ 31Gకి సవరణను రాజ్యాంగ విరుద్ధమని ప్రకటించింది. ఈ మార్పులు ప్రాథమిక నిర్మాణాన్ని నాశనం చేశాయని కోర్టు పేర్కొంది. రాజ్యాంగం, రాజ్యాంగం యొక్క ఆవశ్యక లక్షణాలుగా ప్రాథమిక హక్కులు మరియు ఆదేశిక సూత్రాల మధ్య సంతులనం, సవరణలు, న్యాయ సమీక్ష మరియు సంతులనం కోసం పార్లమెంటుకు ఉన్న పరిమిత అధికారాన్ని నొక్కి చెబుతుంది.",
    ),

    Question(
      questionText: "వామన్ రావు కేసులో (1980), 24 ఏప్రిల్ 1973 తర్వాత చేసిన తొమ్మిదవ షెడ్యూల్‌కు సవరణలకు సంబంధించి సుప్రీంకోర్టు ఏమి తీర్పు ఇచ్చింది?",
      options:[
        "అవన్నీ చెల్లుబాటు అయ్యేవి.",
        "రాజ్యాంగం యొక్క ప్రాథమిక నిర్మాణాన్ని దెబ్బతీస్తే వారు సవాలు చేయడానికి సిద్ధంగా ఉన్నారు.",
        "వారు పార్లమెంటు రాజ్యాంగ అధికారానికి మించినవారు.",
        "అవి రాజ్యాంగ విరుద్ధమైనవి."
      ],
      correctAnswerIndex: 1,
      explanation:"వామన్ రావు కేసులో (1980), 24 ఏప్రిల్ 1973 తర్వాత చేసిన తొమ్మిదవ షెడ్యూల్‌కు సవరణలు రాజ్యాంగం యొక్క ప్రాథమిక నిర్మాణాన్ని దెబ్బతీస్తే వాటిని సవాలు చేయవచ్చని సుప్రీంకోర్టు తీర్పు చెప్పింది. ఈ తేదీకి ముందు చేసిన సవరణలు చెల్లుబాటు అయ్యేవిగా పరిగణించబడ్డాయి, రాజ్యాంగం యొక్క ప్రాథమిక నిర్మాణాన్ని దెబ్బతీసే ప్రాతిపదికన తరువాత చేసిన వాటిని పోటీ చేయవచ్చు.",
    ),

    Question(
      questionText: "విడాకులు తీసుకున్న ముస్లిం భార్య నిర్వహణకు సంబంధించి చట్టపరమైన దృశ్యంపై షా బానో కేసు (1985) ప్రభావం ఏమిటి?",
      options:[
        "ఇది ముస్లిం వ్యక్తిగత చట్టం యొక్క సాంప్రదాయిక వివరణను బలపరిచింది.",
        "ఇది ముస్లిం మహిళల (విడాకుల హక్కుల రక్షణ) చట్టం, 1986ని సమర్థించింది.",
        "క్రిమినల్ ప్రొసీజర్ కోడ్, 1973లోని సెక్షన్ 125 రాజ్యాంగ విరుద్ధమైనదిగా ప్రకటించింది.",
        "ఇది ముస్లిం మహిళల (విడాకుల హక్కుల రక్షణ) చట్టం, 1986 అమలుకు దారితీసింది."
      ],
      correctAnswerIndex: 3,
      explanation:"విడాకులు తీసుకున్న భార్యకు ఇద్దత్ కాలానికి మించి భరణం చెల్లించడానికి ముస్లిం భర్త బాధ్యత వహిస్తాడనే తీర్పును షా బానో కేసు (1985) సమర్థించింది. ఇది క్రిమినల్ ప్రొసీజర్ కోడ్, 1973లోని సెక్షన్ 125 యొక్క లౌకిక స్వభావాన్ని నొక్కి చెప్పింది. అన్ని మతాలకు వర్తిస్తుంది. ఈ తీర్పు ప్రభావం ముస్లిం మహిళల (విడాకుల హక్కుల పరిరక్షణ) చట్టం, 1986 అమలుకు దారితీసింది, ఇది ఇద్దత్ కాలంలో మాత్రమే భరణాన్ని అనుమతించడం ద్వారా తీర్పును సవరించింది.",
    ),

    Question(
      questionText: "DC వాధ్వా కేసు (1986)లో, బీహార్ గవర్నర్ ఆర్డినెన్స్ రూపొందించే అధికారానికి సంబంధించి సుప్రీం కోర్ట్ ఏ తీర్పునిచ్చింది?",
      options:[
        "గవర్నర్ ఆర్డినెన్స్‌ల పునఃప్రకటనను ఇది సమర్థించింది.",
        "ఇది బీహార్ ఇంటర్మీడియట్ ఎడ్యుకేషన్ కౌన్సిల్ ఆర్డినెన్స్, 1985, రాజ్యాంగబద్ధమైనది మరియు చెల్లుబాటు అయ్యేదిగా ప్రకటించింది.",
        "అది ఆర్డినెన్స్‌లను తిరిగి ప్రకటించడం యొక్క రాజకీయ అవసరాన్ని నొక్కి చెప్పింది.",
        "ఇది తిరిగి ప్రకటించబడిన బీహార్ ఇంటర్మీడియట్ ఎడ్యుకేషన్ కౌన్సిల్ ఆర్డినెన్స్, 1985, రాజ్యాంగ విరుద్ధమైనది మరియు చెల్లదు."
      ],
      correctAnswerIndex: 3,
      explanation:"DC వాధ్వా కేసు (1986)లో, బీహార్ ఇంటర్మీడియట్ ఎడ్యుకేషన్ కౌన్సిల్ ఆర్డినెన్స్, 1985, రాజ్యాంగ విరుద్ధం మరియు చెల్లుబాటు కాదని సుప్రీం కోర్ట్ తీర్పు చెప్పింది. ఆర్డినెన్స్ రూపొందించే అధికారం అసాధారణ పరిస్థితుల కోసం ఉద్దేశించబడింది మరియు ఇది సాధ్యం కాదని నొక్కి చెప్పింది. రాష్ట్ర శాసనసభ యొక్క సాధారణ చట్టాన్ని రూపొందించే శక్తికి ప్రత్యామ్నాయంగా ఉపయోగించబడుతుంది.",
    ),

    Question(
      questionText: "MC మెహతా కేసు (1986)లో, ఆర్టికల్ 32 ప్రకారం దాని అధికారం మరియు నష్టపరిహారం ప్రదానం గురించి సుప్రీం కోర్ట్ యొక్క తీర్పు ఏమిటి?",
      options:[
        "పరిహారాన్ని ప్రదానం చేసే అధికారం ఆర్టికల్ 32 అందించదని తీర్పు చెప్పింది.",
        "ఆర్టికల్ 32 ప్రకారం దాని అధికారం ప్రత్యేకంగా నివారణకు మరియు నివారణకు కాదు అని పేర్కొంది.",
        "ఆర్టికల్ 32 ప్రకారం దాని అధికారంలో తగిన సందర్భాలలో నష్టపరిహారాన్ని అందించే అధికారం కూడా ఉందని స్పష్టం చేసింది.",
        "పరిహారం ఇవ్వడానికి ఆర్టికల్ 32 రాజ్యాంగ విరుద్ధమని ప్రకటించింది."
      ],
      correctAnswerIndex: 2,
      explanation:"MC మెహతా కేసు (1986)లో, సుప్రీం కోర్ట్ ఆర్టికల్ 32 ప్రకారం దాని అధికారం నివారణ మాత్రమే కాదు, నివారణ కూడా అని స్పష్టం చేసింది. ఈ నివారణ ఉపశమనం సముచితమైన సందర్భాలలో, ప్రత్యేకించి అక్కడ ఉన్నప్పుడు నష్టపరిహారాన్ని అందించే అధికారాన్ని కలిగి ఉండవచ్చని పేర్కొంది. ప్రాథమిక హక్కుల యొక్క స్థూల మరియు పేటెంట్ ఉల్లంఘన.",
    ),

    Question(
      questionText: "పదో షెడ్యూల్‌లోని 7వ పేరాకు సంబంధించి కిహోటో హోలోహన్ కేసు (1992)లో సుప్రీంకోర్టు ఏమి తీర్పునిచ్చింది?",
      options:[
        "ఇది పేరా 7 యొక్క రాజ్యాంగబద్ధతను సమర్థించింది.",
        "అది ఆర్టికల్ 368(2)ని ఉల్లంఘించినందుకు 7వ పేరా రాజ్యాంగ విరుద్ధమని ప్రకటించింది.",
        "అది ఆర్డినెన్స్‌లను తిరిగి ప్రకటించాల్సిన అవసరాన్ని నొక్కి చెప్పింది.",
        "పేరా 7కి రాష్ట్రపతి ఆమోదం అవసరమని ఇది పేర్కొంది."
      ],
      correctAnswerIndex: 1,
      explanation:"కిహోటో హోలోహన్ కేసు (1992)లో, ఆర్టికల్ 368(2)ని ఉల్లంఘించినందుకు పదో షెడ్యూల్‌లోని 7వ పేరా రాజ్యాంగ విరుద్ధమని సుప్రీం కోర్టు ప్రకటించింది. అధికార పరిధిని మినహాయించాలంటే కనీసం సగం రాష్ట్ర శాసనసభల ఆమోదం అవసరం అని పేరా 7ని నిర్ధారించింది. సుప్రీం కోర్ట్ మరియు హైకోర్టుల.",
    ),

    Question(
      questionText: "ప్రభుత్వ ఉద్యోగాలలో OBCలకు రిజర్వేషన్‌కు సంబంధించి ఇంద్ర సాహ్నీ కేసు (1992) ప్రభావం ఏమిటి?",
      options:[
        "ఇది OBCలకు రిజర్వేషన్లు రాజ్యాంగ విరుద్ధమని ప్రకటించింది.",
        "ఇది ఆర్థికంగా వెనుకబడిన వర్గాలకు 10% అదనపు రిజర్వేషన్లను సమర్థించింది.",
        "ఇది OBCలకు అన్ని రిజర్వేషన్‌లను చెల్లుబాటు కాకుండా చేసింది.",
        "ఇది కొన్ని షరతులతో OBCలకు రిజర్వేషన్ యొక్క చెల్లుబాటును సమర్థించింది."
      ],
      correctAnswerIndex: 3,
      explanation:"ఇంద్ర సాహ్నీ కేసులో (1992), ఆర్టికల్ 16(4) ప్రకారం ప్రభుత్వ ఉద్యోగాలలో OBCలకు రిజర్వేషన్ చెల్లుబాటును సుప్రీంకోర్టు సమర్థించింది. అయితే, ఆర్థికంగా వెనుకబడిన ఇతర వర్గాలకు 10% అదనపు రిజర్వేషన్‌ను చెల్లుబాటు చేయదు. తీర్పు దారితీసింది. రామ్ నందన్ కమిటీ నియామకం మరియు అనేక సవరణల చట్టాలతో పాటు బీసీల కోసం జాతీయ కమిషన్ ఏర్పాటు.",
    ),
    Question(
      questionText: "మోహిని జైన్ కేసు (1992), విద్యాహక్కు గురించి సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:[
        "విద్యా హక్కు ప్రాథమిక హక్కు కాదని తీర్పు చెప్పింది.",
        "అది ఆర్టికల్ 21 ప్రకారం విద్యా హక్కును ప్రాథమిక హక్కుగా ప్రకటించింది.",
        "విద్యా హక్కు ప్రాథమిక విద్యకు మాత్రమే వర్తిస్తుందని పేర్కొంది.",
        "కేపిటేషన్ రుసుము వసూలు చేయడం రాజ్యాంగబద్ధమని ఇది పేర్కొంది."
      ],
      correctAnswerIndex: 1,
      explanation:"మోహినీ జైన్ కేసులో (1992), ఆర్టికల్ 21 ప్రకారం విద్యాహక్కు ప్రాథమిక హక్కు అని సుప్రీం కోర్టు ప్రకటించింది. ఈ హక్కు వృత్తిపరమైన విద్యతో సహా ఏ స్థాయికైనా విస్తరించి ఉంటుందని మరియు ప్రవేశానికి క్యాపిటేషన్ ఫీజును ఉల్లంఘిస్తుందని నొక్కి చెప్పింది. ఆర్టికల్ 14.",
    ),

    Question(
      questionText: "మోహిని జైన్ కేసు (1992) తదుపరి తీర్పులు మరియు చట్టంపై ఎలాంటి ప్రభావం చూపింది?",
      options:[
        "ఇది విద్యా హక్కు చట్టం రద్దుకు దారితీసింది.",
        "ఇది 86వ సవరణ చట్టం (2002) ఆమోదాన్ని ప్రభావితం చేసింది.",
        "ఇది క్యాపిటేషన్ ఫీజును రాజ్యాంగబద్ధంగా ప్రకటించింది.",
        "తదుపరి చట్టపరమైన పరిణామాలపై ఇది ఎలాంటి ప్రభావం చూపలేదు."
      ],
      correctAnswerIndex: 1,
      explanation:"మోహినీ జైన్ కేసు (1992) తరువాత ఉన్ని కృష్ణన్ కేసును ప్రభావితం చేసింది మరియు 86వ సవరణ చట్టం (2002) ఆమోదించడానికి దారితీసింది. తదుపరి కేసు మోహినీ జైన్ తీర్పును పాక్షికంగా సమర్థించింది మరియు పాక్షికంగా తిరస్కరించింది మరియు సవరణ ఆర్టికల్ 21A, జోడించబడింది. విద్యా హక్కును స్వతంత్ర ప్రాథమిక హక్కుగా మార్చడం.",
    ),

    Question(
      questionText: "విద్యా హక్కుకు సంబంధించి ఉన్ని కృష్ణన్ కేసు (1993) ఏమి స్థాపించింది?",
      options:[
        "ఇది విద్యాహక్కు రాజ్యాంగ విరుద్ధమని ప్రకటించింది.",
        "ఇది 18 సంవత్సరాల వయస్సు వరకు పిల్లలందరికీ ఉచిత విద్యను పొందే హక్కును నిర్ధారించింది.",
        "ప్రైవేట్ అన్‌ఎయిడెడ్ విద్యా సంస్థలు ఎలాంటి రుసుము వసూలు చేయరాదని పేర్కొంది.",
        "14 సంవత్సరాల వయస్సు వరకు పిల్లలకు మాత్రమే ఉచిత విద్య హక్కు ఉందని ఇది నిర్ధారించింది."
      ],
      correctAnswerIndex: 3,
      explanation:"ఉన్ని కృష్ణన్ కేసులో (1993), ఆర్టికల్ 21 ప్రకారం విద్యాహక్కు ప్రాథమిక హక్కు అని సుప్రీంకోర్టు పేర్కొంది, అయితే 14 ఏళ్లు పూర్తయ్యే వరకు పిల్లలకు మాత్రమే ఉచిత విద్యనందించే హక్కు ఉంది. ఆ వయస్సు తర్వాత, విద్యను అందించడానికి రాష్ట్రం యొక్క బాధ్యత దాని ఆర్థిక సామర్థ్యం మరియు అభివృద్ధిపై ఆధారపడి ఉంటుంది.",
    ),

    Question(
      questionText: "సుప్రీం కోర్ట్ అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ కేసు (1993), ఏ సమస్య పరిష్కరించబడింది?",
      options:[
        "సుప్రీంకోర్టు న్యాయమూర్తుల నియామకం చెల్లుబాటు",
        "రాష్ట్రపతి పాలనను విధించే అధికారం రాష్ట్రపతికి ఉంది",
        "ప్రభుత్వ ఉద్యోగాలలో OBCలకు రిజర్వేషన్",
        "విద్యా హక్కు చట్టం యొక్క రాజ్యాంగ చెల్లుబాటు"
      ],
      correctAnswerIndex: 0,
      explanation:"సుప్రీం కోర్ట్ అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ కేసు (1993)లో, సుప్రీంకోర్టు మరియు హైకోర్టు న్యాయమూర్తుల నియామకం గురించి ప్రస్తావించబడిన అంశం. ఈ కేసును రెండవ న్యాయమూర్తుల కేసు అని కూడా అంటారు.",
    ),

    Question(
      questionText: "రాష్ట్రపతి పాలన విధింపుకు సంబంధించి SR బొమ్మై కేసు (1994)లో సుప్రీంకోర్టు ఏమి నిర్ణయం తీసుకుంది?",
      options:[
        "అన్ని సందర్భాలలో రాష్ట్రపతి పాలన విధించడాన్ని రాజ్యాంగబద్ధమైనది మరియు చెల్లుబాటు అయ్యేదిగా ప్రకటించింది.",
        "పేర్కొన్న అన్ని రాష్ట్రాల్లో రాష్ట్రపతి పాలన విధించడాన్ని సమర్థించండి.",
        "నాగాలాండ్, కర్ణాటక మరియు మేఘాలయలలో రాష్ట్రపతి పాలన విధించడాన్ని రాజ్యాంగ విరుద్ధమని ప్రకటించింది.",
        "ఆర్టికల్ 356 ప్రకారం ప్రకటనకు న్యాయ సమీక్ష వర్తించదని తీర్పు చెప్పింది."
      ],
      correctAnswerIndex: 2,
      explanation:"SR బొమ్మై కేసులో (1994), 1988, 1989, మరియు 1991లో నాగాలాండ్, కర్ణాటక మరియు మేఘాలయలలో రాష్ట్రపతి పాలన విధించడం రాజ్యాంగ విరుద్ధమని మరియు చెల్లదని సుప్రీంకోర్టు ప్రకటించింది. ఈ తీర్పు న్యాయ సమీక్షకు సూత్రాలను ఏర్పాటు చేసింది ఆర్టికల్ 356 ప్రకటనలు.",
    ),

    Question(
      questionText: "పని స్థలంలో లైంగిక వేధింపులకు సంబంధించి విశాఖ కేసు (1997) కీలక నిర్ణయం ఏమిటి?",
      options:[
        "ఆర్టికల్ 21 రాజ్యాంగ విరుద్ధమని ప్రకటించబడింది",
        "కార్యాలయ లైంగిక వేధింపులకు వ్యతిరేకంగా ఏర్పాటు చేసిన మార్గదర్శకాలు",
        "గోప్యత హక్కును ధృవీకరించారు",
        "పని స్థలంలో మహిళల హక్కులకు వ్యతిరేకంగా పాలించారు"
      ],
      correctAnswerIndex: 1,
      explanation:"విశాఖ కేసు (1997)లో, సుప్రీం కోర్ట్ కార్యాలయంలో లైంగిక వేధింపులకు వ్యతిరేకంగా మార్గదర్శకాలను ఏర్పాటు చేసింది, ఇది ఆర్టికల్స్ 15 మరియు 21 ఉల్లంఘన అని పేర్కొంది. 'విశాఖ మార్గదర్శకాలు' అని పిలవబడే మార్గదర్శకాలు, ఇది వరకు అనుసరించడానికి ఉద్దేశించబడింది. 2013లో పని ప్రదేశంలో మహిళలపై లైంగిక వేధింపుల చట్టానికి దారితీసిన తగిన చట్టం రూపొందించబడింది.",
    ),

    Question(
        questionText: "వినీత్ నారాయణ్ కేసు (1997) సెంట్రల్ బ్యూరో ఆఫ్ ఇన్వెస్టిగేషన్ (CBI)కి సంబంధించి ఏమి నిర్దేశించింది?",
        options:[
    "సీబీఐని రద్దు చేయండి",
    "CVCకి చట్టబద్ధమైన హోదాను మంజూరు చేయండి",
        "సింగిల్ డైరెక్టివ్‌లో ఏకపక్ష నిబంధనలను ఆథరైజ్ చేయండి",
        "సీబీఐ అధికారాన్ని పరిమితం చేయండి"
    ],
        correctAnswerIndex: 1,
        explanation:"వినీత్ నారాయణ్ కేసు (1997)లో, సుప్రీమ్ కోర్ట్ సెంట్రల్ విజిలెన్స్ కమిషన్ (CVC)కి చట్టబద్ధమైన హోదాను మరియు సెంట్రల్ బ్యూరో ఆఫ్ ఇన్వెస్టిగేషన్ (CBI)కి స్వయంప్రతిపత్తిని మంజూరు చేయాలని ఆదేశించింది. ఈ కేసు ఎన్‌ఫోర్స్‌మెంట్ డైరెక్టరేట్‌కు సంబంధించిన సమస్యలను కూడా ప్రస్తావించింది మరియు సింగిల్ డైరెక్టివ్‌లోని కొన్ని నిబంధనల చెల్లుబాటును కొట్టివేసింది.",
    ),

    Question(
      questionText: "పోల్ సంస్కరణలు మరియు రాజకీయాల నేరీకరణకు సంబంధించిన కేసు పేరు ఏమిటి?",
      options:["TMA పై ఫౌండేషన్ కేసు", "యూనియన్ ఆఫ్ ఇండియా vs. అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్", "ల్యాండ్‌మార్క్ జడ్జిమెంట్స్ కేసు", "మైనారిటీ విద్యా సంస్థల హక్కుల కేసు"],
      correctAnswerIndex: 1,
      explanation:"పోల్ సంస్కరణలు మరియు రాజకీయాలను నేరపూరితం చేయడానికి సంబంధించిన కేసు యూనియన్ ఆఫ్ ఇండియా వర్సెస్ అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్ (2002). అభ్యర్థుల నేర గతం గురించి తెలుసుకునే ఓటర్ల హక్కును ఈ తీర్పు నొక్కి చెప్పింది.",
    ),

    Question(
      questionText: "అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్ (2002)లో అభ్యర్థుల గురించి ఓటర్లకు సమాచార హక్కుకు సంబంధించి సుప్రీంకోర్టు ఏ రాజ్యాంగ హక్కును ప్రస్తావించింది?",
      options:["సమానత్వం హక్కు", "జీవించే హక్కు", "వాక్కు మరియు భావ వ్యక్తీకరణ హక్కు", "విద్యా హక్కు"],
      correctAnswerIndex: 2,
      explanation:"అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్ (2002)లో, సుప్రీం కోర్ట్ ఆర్టికల్ 19(1)(ఎ), అంటే, వాక్ స్వాతంత్ర్యం మరియు భావవ్యక్తీకరణ హక్కు, ఓటర్లకు తెలుసుకునే హక్కు ఉందని పేర్కొంది అభ్యర్థుల పూర్వాపరాల గురించి, వారి నేర గతంతో సహా.",
    ),

    Question(
      questionText: "అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్ (2002)లో అభ్యర్థులకు తప్పనిసరి చేయాలని ఎన్నికల కమిషన్‌ను సుప్రీంకోర్టు ఏ సమాచారాన్ని ఆదేశించింది?",
      options:["కేవలం విద్యార్హతలు", "ఆస్తులు మరియు బాధ్యతలు", "నేర రికార్డులు మాత్రమే", "పైవన్నీ"],
      correctAnswerIndex: 3,
      explanation:"అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్ (2002)లో, అభ్యర్థులు క్రిమినల్ రికార్డులు, ఆస్తులు మరియు అప్పులు, విద్యార్హతలు మరియు మరిన్నింటికి సంబంధించిన సమాచారాన్ని తప్పనిసరిగా అందించాలని ఎన్నికల కమిషన్‌ను సుప్రీంకోర్టు ఆదేశించింది.",
    ),

    Question(
      questionText: "మైనారిటీ విద్యాసంస్థల హక్కులపై ప్రతిపాదనలు వేయడంతో సంబంధం ఉన్న కేసు ఏది?",
      options:["ల్యాండ్‌మార్క్ జడ్జిమెంట్స్ కేసు", "TMA పై ఫౌండేషన్ కేసు", "మైనారిటీ విద్యా సంస్థల హక్కుల కేసు", "అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ కేస్"],
      correctAnswerIndex: 1,
      explanation:"మైనారిటీ విద్యా సంస్థల హక్కులపై ప్రతిపాదనలు వేయడానికి సంబంధించిన కేసు TMA పై ఫౌండేషన్ వర్సెస్ కర్ణాటక రాష్ట్రం (2002). ఈ తీర్పు భాషా మరియు మతపరమైన మైనారిటీల విద్యా సంస్థలను స్థాపించడానికి మరియు నిర్వహించే హక్కులను చర్చించింది.",
    ),

    Question(
      questionText: "TMA పై ఫౌండేషన్ కేసు (2002)కి ప్రతిస్పందనగా 93వ సవరణ చట్టం (2005) ఎలాంటి మార్పును తీసుకొచ్చింది?",
      options:["మైనారిటీ విద్యా సంస్థల సాధికారత", "తీర్పు ప్రభావాన్ని అధిగమించడం", "అడ్మిషన్ కోసం సాధారణ ప్రవేశ పరీక్షలను నిర్దేశించడం", "ఆర్టికల్ 30(1)లో కొత్త నిబంధనను చొప్పించడం"],
      correctAnswerIndex: 2,
      explanation:"TMA పై ఫౌండేషన్ కేసు (2002)కి ప్రతిస్పందనగా, దాని ప్రభావాన్ని అధిగమించడానికి 93వ సవరణ చట్టం (2005) రూపొందించబడింది. ఈ సవరణ అడ్మిషన్ కోసం సాధారణ ప్రవేశ పరీక్షలను, ప్రత్యేకించి ఎయిడెడ్ ప్రొఫెషనల్ సంస్థల విషయంలో నిర్దేశించడాన్ని అనుమతించింది.",
    ),

    Question(
      questionText: "జాతీయ జెండాను ఎగురవేసే హక్కుకు సంబంధించి 2004లో నిర్ణయించబడిన కేసు యొక్క ప్రసిద్ధ పేరు ఏమిటి?",
      options:["ప్రకాష్ సింగ్ కేసు", "యూనియన్ ఆఫ్ ఇండియా వర్సెస్ నవీన్ జిందాల్ కేస్", "నవీన్ జిందాల్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా కేస్", "రైట్ టు ఎగురవేసే జాతీయ జెండా కేసు"],
      correctAnswerIndex: 1,
      explanation:"2004లో నిర్ణయించబడిన జాతీయ జెండాను ఎగురవేసే హక్కుకు సంబంధించిన కేసును యూనియన్ ఆఫ్ ఇండియా వర్సెస్ నవీన్ జిందాల్ కేసుగా పిలుస్తారు. జాతీయ జెండాను ఎగురవేసే హక్కు స్వేచ్ఛలో ప్రాథమిక హక్కు అని తీర్పు ధృవీకరించింది. ప్రసంగం మరియు వ్యక్తీకరణ.",
    ),

    Question(
      questionText: "నవీన్ జిందాల్ కేసు (2004)లో సుప్రీంకోర్టు ప్రకారం, జాతీయ జెండాను ఎగురవేసే హక్కు ఏమిటి?",
      options:["వాణిజ్య హక్కు", "ప్రాథమిక హక్కు", "రాజకీయ హక్కు", "సామాజిక హక్కు"],
      correctAnswerIndex: 1,
      explanation:"నవీన్ జిందాల్ కేసు (2004), ఆర్టికల్ 19(1)(ఎ) ద్వారా హామీ ఇవ్వబడిన వాక్ మరియు భావప్రకటనా స్వేచ్ఛ యొక్క అర్థంలో జాతీయ జెండాను ఎగురవేసే హక్కు ప్రాథమిక హక్కు అని సుప్రీంకోర్టు పేర్కొంది." ,
    ),

    Question(
      questionText: "పోలీసు సంస్కరణలను నిర్ధారించడానికి మరియు రాజకీయ జోక్యాన్ని నిరోధించడానికి ప్రకాష్ సింగ్ కేసు (2006)లో సుప్రీంకోర్టు ఏమి ఆదేశించింది?",
      options:["పోలీస్ ఎస్టాబ్లిష్‌మెంట్ బోర్డ్‌ను ఏర్పాటు చేయడం", "రాష్ట్ర భద్రతా కమిషన్ రాజ్యాంగం", "లా అండ్ ఆర్డర్ పోలీసుల నుండి విచారణ పోలీసులను వేరు చేయడం", "పైవన్నీ"],
      correctAnswerIndex: 3,
      explanation:"ప్రకాష్ సింగ్ కేసు (2006)లో, పోలీసుల పనితీరులో రాజకీయ జోక్యాన్ని నిరోధించడానికి, లా అండ్ ఆర్డర్ పోలీసుల నుండి దర్యాప్తు పోలీసులను వేరు చేయడం, రాష్ట్ర భద్రతా కమిషన్ రాజ్యాంగం మరియు మరిన్నింటితో సహా పోలీసు సంస్కరణల కోసం సుప్రీంకోర్టు ఆదేశాలు జారీ చేసింది. ",
    ),

    Question(
      questionText: "ప్రకాష్ సింగ్ కేసు (2006) దేశంలోని పోలీసు సంస్కరణలపై ఎలాంటి ప్రభావం చూపింది?",
      options:["సంస్కరణల పూర్తి అమలు", "సంస్కరణల పాక్షిక అమలు", "సంస్కరణలపై ప్రభావం లేదు", "రాజకీయ జోక్యాన్ని తొలగించడం"],
      correctAnswerIndex: 1,
      explanation:"ప్రకాష్ సింగ్ కేసు (2006) దేశంలో పోలీసు సంస్కరణలను ప్రవేశపెట్టడానికి దారితీసింది, కానీ పాక్షికంగా మాత్రమే. ఇది పోలీసు వ్యవస్థ పనితీరులో రాజకీయ జోక్యాన్ని పూర్తిగా తొలగించలేకపోయింది.",
    ),

    Question(
      questionText: "పోలీసు సంస్కరణల కోసం ప్రకాష్ సింగ్ కేసు (2006)లో సుప్రీంకోర్టు ఏ ఆదేశాలను జారీ చేయలేదు?",
      options:["DGPకి కనీసం రెండేళ్ల పదవీకాలం", "జాతీయ భద్రతా కమిషన్‌ను ఏర్పాటు చేయడం", "లా అండ్ ఆర్డర్ పోలీసుల నుండి విచారణ పోలీసులను వేరు చేయడం", "పోలీసు అధికారులకు సాధారణ ప్రవేశ పరీక్షలను నిర్వహించడం"],
      correctAnswerIndex: 3,
      explanation:"ప్రకాష్ సింగ్ కేసు (2006)లో, పోలీసు సంస్కరణల్లో భాగంగా పోలీసు అధికారులకు ఉమ్మడి ప్రవేశ పరీక్షలను నిర్వహించాలని సుప్రీంకోర్టు ఆదేశాలు జారీ చేయలేదు.",
    ),

    Question(
      questionText: "2006లో నిర్ణయించబడిన SC మరియు STలకు ప్రమోషన్లలో రిజర్వేషన్లకు సంబంధించిన కేసు యొక్క ప్రసిద్ధ పేరు ఏమిటి?",
      options:["IR కోయెల్హో కేసు", "M. నాగరాజ్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా కేసు", "తొమ్మిదవ షెడ్యూల్ కేసు", "ప్రమోషన్ల కేసులో రిజర్వేషన్లు"],
      correctAnswerIndex: 1,
      explanation:"2006లో నిర్ణయించబడిన ఎస్సీ మరియు ఎస్టీలకు ప్రమోషన్లలో రిజర్వేషన్‌కు సంబంధించిన కేసును ఎం. నాగరాజ్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా కేసుగా పిలుస్తారు. ఈ తీర్పు రిజర్వేషన్‌లకు సంబంధించిన కొన్ని సవరణల రాజ్యాంగ చెల్లుబాటును సమర్థించింది.",
    ),

    Question(
      questionText: "ఎం. నాగరాజ్ కేసు (2006)లో సుప్రీంకోర్టు ఏ రాజ్యాంగ సవరణలను సమర్థించింది?",
      options:["77వ సవరణ చట్టం (1995)", "81వ సవరణ చట్టం (2000)", "82వ సవరణ చట్టం (2000)", "పైన ఉన్నవన్నీ"],
      correctAnswerIndex: 3,
      explanation:"ఎం. నాగరాజ్ కేసు (2006), సుప్రీంకోర్టు 77వ సవరణ చట్టం (1995), 81వ సవరణ చట్టం (2000), 82వ సవరణ చట్టం (2000), మరియు 85వ సవరణ చట్టం యొక్క రాజ్యాంగ చెల్లుబాటును సమర్థించింది. (2001)",
    ),

    Question(
      questionText: "ఎం. నాగరాజ్ కేసు (2006) ప్రకారం, రాష్ట్రానికి ప్రమోషన్లలో రిజర్వేషన్లు కల్పించడానికి ఏ అంశాలు అనుమతిస్తాయి?",
      options:["పరిమాణాత్మక పరిమితులు", "గుణాత్మక మినహాయింపులు", "ప్రాతినిధ్యంలో వెనుకబాటుతనం మరియు అసమర్థత", "సీలింగ్ పరిమితి 50%"],
      correctAnswerIndex: 2,
      explanation:"ఎం. నాగరాజ్ కేసు (2006)లో, ఆర్టికల్ 335 ప్రకారం రాష్ట్ర పరిపాలన యొక్క మొత్తం సామర్థ్యాన్ని పరిగణనలోకి తీసుకుని, వెనుకబాటుతనం మరియు ప్రాతినిధ్యంలో అసమర్థత వంటి అంశాలు రాష్ట్రానికి పదోన్నతులలో రిజర్వేషన్ కల్పించడానికి వీలు కల్పిస్తున్నాయని సుప్రీంకోర్టు పేర్కొంది.",
    ),

    Question(
      questionText: "24 ఏప్రిల్ 1973 తర్వాత ప్రాథమిక నిర్మాణాన్ని దెబ్బతీసే విధంగా రాజ్యాంగానికి చేసిన సవరణలు సవాలుకు సిద్ధంగా ఉన్నాయా అనే ప్రాథమిక ప్రశ్నను ఏ సందర్భంలో పునరుద్ఘాటించింది?",
      options:["వామన్ రావ్ కేసు (1980)", "కేశవానంద భారతి కేసు (1973)", "IR కోయెల్హో కేసు (2007)", "తొమ్మిదవ షెడ్యూల్ కేసు"],
      correctAnswerIndex: 2,
      explanation:"ఐఆర్ కోయెల్హో కేసు (2007) 24 ఏప్రిల్ 1973 తర్వాత చేసిన సవరణలు, ప్రాథమిక నిర్మాణాన్ని దెబ్బతీస్తూ, సవాలుకు సిద్ధంగా ఉన్నాయా అనే ప్రాథమిక ప్రశ్నను పునరుద్ఘాటించింది. అటువంటి సవరణల చెల్లుబాటును నిర్ణయించడానికి ఇది పరీక్షలను కూడా నిర్దేశించింది.",
    ),

    Question(
      questionText: "తొమ్మిదవ షెడ్యూల్‌కు సంబంధించి IR కోయెల్హో కేసు (2007) యొక్క అంశం ఏమిటి?",
      options:["తొమ్మిదవ షెడ్యూల్ యొక్క న్యాయ సమీక్ష", "24 ఏప్రిల్ 1973 తర్వాత రాజ్యాంగ సవరణలు", "SCలు మరియు STలకు ప్రమోషన్లలో రిజర్వేషన్లు", "మైనారిటీ విద్యా సంస్థల హక్కులు"],
      correctAnswerIndex: 0,
      explanation:"IR కోయెల్హో కేసు (2007) యొక్క అంశం తొమ్మిదవ షెడ్యూల్ యొక్క న్యాయపరమైన సమీక్ష. ఈ తీర్పు 24 ఏప్రిల్ 1973 తర్వాత చేసిన రాజ్యాంగ సవరణలకు సవాలుపై కోర్టు యొక్క వైఖరిని పునరుద్ఘాటించింది, ఇందులో తొమ్మిదవ షెడ్యూల్‌లో చొప్పించిన చట్టాలు ఉన్నాయి." ,
    ),

    Question(
      questionText: "2011లో నిర్ణయించబడిన అనాయాస కేసు యొక్క ప్రసిద్ధ పేరు ఏమిటి?",
      options:["అరుణ రామచంద్ర షాన్‌బాగ్ కేస్", "పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేస్", "ఎం. నాగరాజ్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా కేస్", "ఎవరీ కేసు కాదు"],
      correctAnswerIndex: 0,
      explanation:"2011లో నిర్ణయించబడిన అనాయాసానికి సంబంధించిన కేసును అరుణా రామచంద్ర షాన్‌బాగ్ కేసు అని పిలుస్తారు. ఈ తీర్పు క్రియాశీల అనాయాస మరియు సహాయక మరణానికి సంబంధించిన అనుమతిని ప్రస్తావించింది, కొన్ని షరతులు మరియు రక్షణలతో నిష్క్రియాత్మక అనాయాసను అనుమతిస్తుంది.",
    ),

    Question(
      questionText: "అరుణ రామచంద్ర షాన్‌బాగ్ కేసు (2011)లో సుప్రీం కోర్టు ప్రకారం, సంబంధిత హైకోర్టు నుండి ఏ నిర్ణయానికి ఆమోదం అవసరం?",
      options:["వైద్యుల ద్వారా లైఫ్ సపోర్ట్ ఉపసంహరణ", "సమీప బంధువుల ద్వారా లైఫ్ సపోర్ట్ ఉపసంహరణ", "పాసివ్ యుథనేషియాకు ఆమోదం", "పైవన్నీ"],
      correctAnswerIndex: 2,
      explanation:"అరుణా రామచంద్ర షాన్‌బాగ్ కేసు (2011)లో, జీవిత సహాయాన్ని ఉపసంహరించుకునే నిర్ణయాన్ని సమీప బంధువులు లేదా వైద్యులు తీసుకున్నప్పటికీ, నిష్క్రియాత్మక అనాయాస కేసుల్లో సంబంధిత హైకోర్టు ఆమోదం అవసరమని సుప్రీంకోర్టు పేర్కొంది.",
    ),

    Question(
      questionText: "పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేసు (2013), బ్యాలెట్ పత్రాలు/ఈవీఎంలలో ఏమి అందించాలని సుప్రీంకోర్టు ఎన్నికల సంఘాన్ని ఆదేశించింది?",
      options:["బహుళ ఓటింగ్ ఎంపికలు", "పాజిటివ్ ఓటింగ్ కోసం మాత్రమే ఎంపిక", "పైన ఏదీ కాదు (NOTA) బటన్", "రహస్య ఓటింగ్ ఎంపిక"],
      correctAnswerIndex: 2,
      explanation:"పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేసు (2013)లో, ఓటర్లు తమ హక్కును వినియోగించుకోవడానికి వీలుగా బ్యాలెట్ పేపర్లు/ఈవీఎంలలో 'నన్ ఆఫ్ ది ఎబౌ' (నోటా) బటన్‌ను అందించాలని ఎన్నికల సంఘాన్ని సుప్రీంకోర్టు ఆదేశించింది. గోప్యతను కాపాడుతూ ఓటు వేయండి.",
    ),

    Question(
      questionText: "పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేసు (2013)లో సుప్రీం కోర్ట్ యొక్క పరిశీలనల ప్రకారం, ఆర్టికల్ 19 ఏమి హామీ ఇస్తుంది?",
      options:["ఓటు మాత్రమే హక్కు", "స్వేచ్ఛగా మరియు నిష్పక్షపాతంగా ఎన్నికల హక్కు", "విమర్శించే మరియు విభేదించే హక్కు", "పాజిటివ్ ఓటింగ్ హక్కు మాత్రమే"],
      correctAnswerIndex: 2,
      explanation:"పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేస్ (2013)లో, ఒక నిర్దిష్ట అంశంపై మాట్లాడే, విమర్శించే మరియు విభేదించే హక్కును ఆర్టికల్ 19 హామీ ఇస్తుంది మరియు ప్రతికూల ఓటు వేయడానికి వ్యక్తిని అనుమతించకపోవడాన్ని ఓడిస్తుందని సుప్రీంకోర్టు గమనించింది. భావప్రకటనా స్వేచ్ఛ మరియు స్వేచ్ఛ హక్కు.",
    ),

    Question(
      questionText: "పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేసు (2013)లోని తీర్పు ఎన్నికల విధానాలపై ఎలాంటి ప్రభావం చూపింది?",
      options:["నిర్బంధ ఓటింగ్ పరిచయం", "ఓటింగ్‌లో గోప్యతను తొలగించడం", "పైన ఏదీ లేని (నోటా) ఎంపిక", "పాజిటివ్ ఓటింగ్ మాత్రమే అనుమతించబడుతుంది"],
      correctAnswerIndex: 2,
      explanation:"పీపుల్స్ యూనియన్ ఫర్ సివిల్ లిబర్టీస్ కేసు (2013) తీర్పు తర్వాత, ఎన్నికల సంఘం బ్యాలెట్ పత్రాలు/ఈవీఎంలలో 'నన్ ఆఫ్ ది ఎబౌ' (నోటా) ఆప్షన్‌ను ప్రవేశపెట్టింది, ఓటర్లు తమ హక్కును వ్యక్తపరచకుండా అనుమతించారు. గోప్యతను కాపాడుతూ ఓటు వేయండి.",
    ),

    Question(
      questionText: "2013లో నిర్ణయించబడిన రాజకీయాలను నేరపూరితం చేయడానికి సంబంధించిన కేసు యొక్క ప్రసిద్ధ పేరు ఏమిటి?",
      options:["లిల్లీ థామస్ కేసు", "TSR సుబ్రమణియన్ కేస్", "నేషనల్ లీగల్ సర్వీసెస్ అథారిటీ కేసు", "పైన ఏదీ కాదు"],
      correctAnswerIndex: 0,
      explanation:"2013లో నిర్ణయించబడిన రాజకీయాల నేరీకరణకు సంబంధించిన కేసును లిల్లీ థామస్ కేసు అని పిలుస్తారు. నేరాలకు పాల్పడిన తర్వాత పార్లమెంటు మరియు రాష్ట్ర శాసనసభల సభ్యులపై అనర్హత వేటు వేయడాన్ని తీర్పు తక్షణ అనర్హతకు దారితీసింది.",
    ),

    Question(
      questionText: "లిల్లీ థామస్ కేసు (2013)లో సుప్రీంకోర్టు దేన్ని కొట్టివేసింది?",
      options:["ప్రజల ప్రాతినిధ్య చట్టం, 1951లోని సెక్షన్ 79(డి)", "రాజ్యాంగంలోని సెక్షన్ 191", "ప్రజా ప్రాతినిధ్య చట్టం, 1951లోని సెక్షన్ 8(4)", "పైవేవీ కావు "],
      correctAnswerIndex: 2,
      explanation:"లిల్లీ థామస్ కేసు (2013)లో, సుప్రీంకోర్టు ప్రజాప్రాతినిధ్య చట్టం, 1951లోని సెక్షన్ 8(4)ని రాజ్యాంగ విరుద్ధమైనదిగా ప్రకటించింది. ఈ సెక్షన్ దోషులుగా నిర్ధారించబడిన సిట్టింగ్ సభ్యులకు ఆదా చేయడం ద్వారా ముగ్గురిని అనుమతించింది. అప్పీల్ చేయడానికి మరియు వారి నేరారోపణపై స్టే పొందేందుకు నెలలు.",
    ),

    Question(
      questionText: "లిల్లీ థామస్ కేసు (2013) దోషులుగా ఉన్న పార్లమెంటు మరియు రాష్ట్ర శాసనసభలపై ఎలాంటి ప్రభావం చూపింది?",
      options:["తక్షణ అనర్హత", "ఆటోమేటిక్ రీ-ఎలక్షన్", "అప్పీల్ చేయడానికి మూడు నెలలు", "అనర్హత నుండి మినహాయింపు"],
      correctAnswerIndex: 0,
      explanation:"లిల్లీ థామస్ కేసు (2013) దోషిగా తేలిన పార్లమెంటు మరియు రాష్ట్ర శాసనసభల సభ్యులపై తక్షణం అనర్హత వేటు వేయడానికి దారితీసింది. సుప్రీం కోర్టు అనర్హత దోషిగా నిర్ధారించబడిన తేదీ నుండి జరుగుతుంది మరియు ప్రజాప్రాతినిధ్యంలోని సెక్షన్ 8(4) చట్టం, 1951, రాజ్యాంగ విరుద్ధమని ప్రకటించబడింది.",
    ),

    Question(
      questionText: "TSR సుబ్రమణియన్ కేసు (2013)లో సుప్రీంకోర్టు ఏ సంస్కరణలను నిర్దేశించింది?",
      options:["న్యాయ సంస్కరణలు", "పోలీసు సంస్కరణలు", "సివిల్ సర్వీస్ సంస్కరణలు", "ఎన్నికల సంస్కరణలు"],
      correctAnswerIndex: 2,
      explanation:"TSR సుబ్రమణియన్ కేసు (2013)లో, పౌర సేవా బోర్డుల రాజ్యాంగంతో సహా సివిల్ సర్వీస్ సంస్కరణలు, నిర్ణీత కనీస పదవీకాలాన్ని అందించడం మరియు పౌర సేవకులు మౌఖిక సూచనల ప్రకారం కాకుండా వ్రాతపూర్వకంగా వ్యవహరించాలని ఆదేశించింది. ఈ సంస్కరణలు సమర్థవంతమైన, సమర్థవంతమైన మరియు పారదర్శకమైన పరిపాలనను లక్ష్యంగా చేసుకుంది.",
    ),

    Question(
      questionText: "నేషనల్ లీగల్ సర్వీసెస్ అథారిటీ కేసు (2014), లింగమార్పిడి వ్యక్తులకు సంబంధించి సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:["వారికి ప్రాథమిక హక్కులు లేవు", "వారు వారి లింగ గుర్తింపును నిర్ణయించలేరు", "వారు 'మూడవ లింగం'గా గుర్తించబడ్డారు", "వారు రిజర్వేషన్ల నుండి మినహాయించబడ్డారు"],
      correctAnswerIndex: 2,
      explanation:"నేషనల్ లీగల్ సర్వీసెస్ అథారిటీ కేసు (2014)లో, సుప్రీంకోర్టు లింగమార్పిడి వ్యక్తులను 'థర్డ్ జెండర్'గా ప్రకటించింది మరియు రాజ్యాంగంలోని పార్ట్ III కింద వారి ప్రాథమిక హక్కులను సమర్థించింది. న్యాయస్థానం వారి స్వీయ-గుర్తింపు లింగానికి హక్కును ధృవీకరిస్తుంది మరియు చట్టపరమైన ఆదేశాలను ఇచ్చింది. కేంద్ర మరియు రాష్ట్ర ప్రభుత్వాల గుర్తింపు.",
    ),

    Question(
      questionText: "శ్రేయా సింఘాల్ కేసు (2015), ఇన్ఫర్మేషన్ టెక్నాలజీ చట్టం (2000)లోని ఏ సెక్షన్‌ను సుప్రీంకోర్టు కొట్టివేసింది?",
      options:["సెక్షన్ 19", "సెక్షన్ 124", "సెక్షన్ 66A", "సెక్షన్ 217"],
      correctAnswerIndex: 2,
      explanation:"శ్రేయా సింఘాల్ కేసు (2015), ఇన్ఫర్మేషన్ టెక్నాలజీ చట్టం (2000)లోని సెక్షన్ 66Aని సుప్రీంకోర్టు కొట్టివేసింది. ఆన్‌లైన్‌లో అభ్యంతరకరమైన సందేశాలను పంపినందుకు శిక్షను అందించే ఈ సెక్షన్ వాక్ స్వాతంత్య్రాన్ని ఉల్లంఘిస్తోందని కోర్టు పేర్కొంది. ఆర్టికల్ 19(1)(ఎ) కింద వ్యక్తీకరణ హామీ ఇవ్వబడింది.",
    ),

    Question(
      questionText: "నేషనల్ జ్యుడీషియల్ అపాయింట్‌మెంట్స్ కమిషన్ (NJAC)కి సంబంధించి సుప్రీంకోర్టు అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ కేసు (2015)లో సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:["రాజ్యాంగం మరియు చెల్లుబాటు", "రాజ్యాంగ విరుద్ధం మరియు శూన్యం", "సవరించబడింది కానీ చెల్లుబాటు", "పనిచేయనిది"],
      correctAnswerIndex: 1,
      explanation:"సుప్రీంకోర్టు అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ కేసు (2015)లో, సుప్రీంకోర్టు 99వ సవరణ చట్టం (2014) మరియు నేషనల్ జ్యుడీషియల్ అపాయింట్‌మెంట్స్ కమీషన్ యాక్ట్ (2014) రాజ్యాంగ విరుద్ధమైనది మరియు చెల్లుబాటు కాదని ప్రకటించింది. కోర్టు మునుపటి 'ని పునరుద్ధరించింది. సుప్రీంకోర్టు మరియు హైకోర్టులకు న్యాయమూర్తుల నియామకం కోసం కొలీజియం వ్యవస్థ.",
    ),

    Question(
        questionText: "ఏ కేసును 'ట్రిపుల్ తలాక్ కేసు' అని కూడా పిలుస్తారు?",
        options:["శ్రేయా సింఘాల్ కేసు", "సుప్రీం కోర్ట్ అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ కేసు", "షయారా బానో కేసు", "పైన ఏదీ కాదు"],
        correctAnswerIndex: 2,
        explanation:"ట్రిపుల్ తలాక్ కేసు'గా పిలవబడే కేసు షయారా బానో కేసు (2017). ఈ కేసులో, సుప్రీం కోర్టు ట్రిపుల్ తలాక్ (తలాక్-ఎ-బిద్దత్) రాజ్యాంగ విరుద్ధమని ప్రకటించింది, ఇది స్పష్టంగా ఏకపక్షంగా మరియు ఉల్లంఘించేదిగా పేర్కొంది. రాజ్యాంగంలోని ఆర్టికల్ 14 ప్రకారం ప్రాథమిక హక్కు."
    ),

    Question(
        questionText: "షయారా బానో కేసు (2017)లో సుప్రీంకోర్టు ఏ చర్య తీసుకోవాలని కేంద్ర ప్రభుత్వాన్ని ఆదేశించింది?",
        options:["NJACని అమలు చేయండి", "ట్రిపుల్ తలాక్ చట్టాన్ని అమలు చేయండి", "సెక్షన్ 66Aని ప్రవేశపెట్టండి", "IT చట్టాన్ని సవరించండి"],
        correctAnswerIndex: 1,
        explanation:"షయారా బానో కేసు (2017)లో, ట్రిపుల్ తలాక్ యొక్క ఆచారాన్ని ప్రత్యేకంగా పరిష్కరిస్తూ, ముస్లిం సమాజంలో విడాకులను నియంత్రించడానికి ఆరు నెలల్లోగా చట్టం చేయాలని సుప్రీంకోర్టు కేంద్ర ప్రభుత్వాన్ని ఆదేశించింది. ఇది ముస్లిం చట్టానికి దారితీసింది. మహిళల (వివాహంపై హక్కుల పరిరక్షణ) చట్టం, 2019, దీనిని 'ట్రిపుల్ తలాక్ చట్టం' అని కూడా పిలుస్తారు."
    ),

    Question(
      questionText: "కె.ఎస్. పుట్టస్వామి కేసు (2017)లో, జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛలో అంతర్భాగంగా సుప్రీంకోర్టు ఏ ప్రాథమిక హక్కును ప్రకటించింది?",
      options:["సమానత్వం హక్కు", "విద్యా హక్కు", "గోప్యత హక్కు", "ఆస్తి హక్కు"],
      correctAnswerIndex: 2,
      explanation:"KS పుట్టస్వామి కేసు (2017)లో, సుప్రీంకోర్టు గోప్యత హక్కును ప్రాథమిక హక్కుగా ప్రకటించింది. ఆర్టికల్ 21 ప్రకారం గోప్యత హక్కు జీవించే హక్కు మరియు వ్యక్తిగత స్వేచ్ఛ యొక్క అంతర్గత భాగంగా రక్షించబడిందని కోర్టు తీర్పు చెప్పింది. మరియు రాజ్యాంగంలోని పార్ట్ III ద్వారా హామీ ఇవ్వబడిన స్వేచ్ఛలలో భాగంగా.",
    ),

    Question(
      questionText: "ఇండియన్ యంగ్ లాయర్స్ అసోసియేషన్ కేసు (2018)లోని తీర్పు ప్రకారం, శబరిమల ఆలయానికి సంబంధించి సుప్రీంకోర్టు రాజ్యాంగ విరుద్ధమని ఏది ప్రకటించింది?",
      options:["నిర్దిష్ట ఆచారాల సమర్పణ", "10-50 సంవత్సరాల వయస్సు గల మహిళల ప్రవేశంపై నిషేధం", "లౌడ్ స్పీకర్లపై పరిమితులు", "పూజల వేళలపై పరిమితి"],
      correctAnswerIndex: 1,
      explanation:"ఇండియన్ యంగ్ లాయర్స్ అసోసియేషన్ కేసు (2018)లో, శబరిమల ఆలయంలోకి 10-50 ఏళ్ల వయస్సు గల మహిళల ప్రవేశంపై నిషేధం రాజ్యాంగ విరుద్ధమని సుప్రీంకోర్టు ప్రకటించింది. ఈ నిషేధం హక్కును ఉల్లంఘిస్తుందని కోర్టు పేర్కొంది. ఆర్టికల్ 14 ప్రకారం సమానత్వం, ఆర్టికల్ 21 ప్రకారం వ్యక్తిగత స్వేచ్ఛ హక్కు మరియు ఆర్టికల్ 25 ప్రకారం మత స్వేచ్ఛ హక్కు.",
    ),

    Question(
      questionText: "కెఎస్ పుట్టస్వామి కేసు (2017) ఆధార్‌కు సంబంధించిన తీర్పులపై ఎలాంటి ప్రభావం చూపింది?",
      options:["ఆధార్ రాజ్యాంగ విరుద్ధమని ప్రకటించబడింది", "ఆధార్ చట్టాన్ని కొట్టివేసింది", "ఆధార్ చట్టం యొక్క రాజ్యాంగ చెల్లుబాటును సమర్థించండి", "ఆధార్‌పై ప్రభావం లేదు"],
      correctAnswerIndex: 2,
      explanation:"KS పుట్టస్వామి కేసు (2017) ఆధార్ తీర్పులను ప్రభావితం చేసింది. 2018లో, సుప్రీంకోర్టు ఆధార్ తీర్పు లేదా పుట్టస్వామి-II తీర్పు అని పిలువబడే ఆధార్ చెల్లుబాటుపై ప్రత్యేక తీర్పును వెలువరించింది. ఆధార్ యొక్క రాజ్యాంగ చెల్లుబాటును కోర్టు సమర్థించింది. (ఆర్థిక మరియు ఇతర రాయితీలు, ప్రయోజనాలు మరియు సేవల లక్ష్య డెలివరీ) చట్టం, 2016, కొన్ని నిబంధనలను తొలగించి, మార్పులు సూచించబడ్డాయి.",
    ),

    Question(
      questionText: "KS పుట్టస్వామి కేసు (2017)లో గోప్యత హక్కు గురించి సుప్రీంకోర్టు ఏమి చెప్పింది?",
      options:["సంపూర్ణ హక్కు", "సహేతుకమైన పరిమితులకు లోబడి", "రాజ్యాంగం ద్వారా రక్షించబడలేదు", "కొంతమంది వ్యక్తులకు పరిమితం"],
      correctAnswerIndex: 1,
      explanation:"KS పుట్టస్వామి కేసు (2017)లో, గోప్యతా హక్కు సంపూర్ణ హక్కు కాదని, రాజ్యాంగంలోని పార్ట్ III ప్రకారం ప్రాథమిక స్వేచ్ఛలపై సహేతుకమైన పరిమితులకు లోబడి ఉంటుందని సుప్రీంకోర్టు ప్రకటించింది. న్యాయస్థానం చట్టాల అవసరాన్ని నొక్కి చెప్పింది. ప్రాథమిక స్వేచ్ఛలపై అనుమతించదగిన పరిమితుల గీటురాయిని తట్టుకోవడానికి గోప్యతను అతిక్రమించడం.",
    ),
    Question(
      questionText: "భారతదేశంలో వ్యభిచారం నేరం చేయడంపై జోసెఫ్ షైన్ కేసు (2018) ప్రభావం ఏమిటి?",
      options:["వ్యభిచారం ఒక క్రిమినల్ నేరంగా మిగిలిపోయింది", "వ్యభిచారం నేరంగా పరిగణించబడుతుంది", "వ్యభిచారానికి పెనాల్టీలు పెరగడం", "వ్యభిచారం అనేది ఒక సివిల్ తప్పుగా గుర్తించబడింది"],
      correctAnswerIndex: 1,
      explanation:"జోసెఫ్ షైన్ కేసు (2018) భారత శిక్షాస్మృతిలోని సెక్షన్ 497ను కొట్టివేయడం ద్వారా భారతదేశంలో వ్యభిచారాన్ని నేరంగా పరిగణించింది. ఫలితంగా, వ్యభిచారం అనేది ఇకపై జైలుశిక్షను ఆకర్షించే క్రిమినల్ నేరం కాదు. అయినప్పటికీ, అది ఇప్పటికీ పౌరపరమైన తప్పుగా పరిగణించబడుతుంది. మరియు వివాహాన్ని రద్దు చేయడానికి ఒక కారణం.",
    ),

    Question(
        questionText: "నవతేజ్ సింగ్ జోహార్ కేసు (2018), భారత శిక్షాస్మృతిలోని సెక్షన్ 377కి సంబంధించి సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
        options:["సెక్షన్ 377 చెల్లుబాటు అవుతుంది", "సెక్షన్ 377 విస్తరించబడింది", "సెక్షన్ 377 పాక్షికంగా కొట్టివేయబడింది", "సెక్షన్ 377 రాజ్యాంగ విరుద్ధమని ప్రకటించబడింది"],
        correctAnswerIndex: 3,
        explanation:"నవతేజ్ సింగ్ జోహార్ కేసు (2018)లో, ఒకే లింగానికి చెందిన పెద్దల ఏకాభిప్రాయ లైంగిక చర్యలను నేరంగా పరిగణించే భారతీయ శిక్షాస్మృతిలోని సెక్షన్ 377ను సుప్రీంకోర్టు పాక్షికంగా కొట్టివేసింది. ఈ సెక్షన్ రాజ్యాంగ విరుద్ధమని కోర్టు ప్రకటించింది. ఒకే లింగానికి చెందిన పెద్దల మధ్య ఏకాభిప్రాయంతో కూడిన లైంగిక చర్యలను నేరంగా పరిగణిస్తుంది. తీర్పు ప్రభావం స్వలింగ సంపర్కాన్ని నేరరహితం చేయడం."
    ),

    Question(
      questionText: "LGBT వ్యక్తుల హక్కులకు సంబంధించి నవతేజ్ సింగ్ జోహార్ కేసు (2018)లో సుప్రీంకోర్టు ఏమి నొక్కి చెప్పింది?",
      options:["LGBT వ్యక్తులకు ప్రత్యేక హక్కులు లేవు", "LGBT వ్యక్తులకు పరిమిత హక్కులు ఉన్నాయి", "LGBT వ్యక్తులు ఇతరులతో సమానమైన ప్రాథమిక హక్కులను కలిగి ఉంటారు", "LGBT వ్యక్తులకు తక్కువ హక్కులు ఉన్నాయి"],
      correctAnswerIndex: 2,
      explanation:"నవతేజ్ సింగ్ జోహార్ కేసు (2018)లో, ఎల్‌జిబిటి (లెస్బియన్, గే, బైసెక్సువల్ మరియు ట్రాన్స్‌జెండర్) వ్యక్తులు ఇతరులతో సమానమైన ప్రాథమిక హక్కులకు అర్హులని సుప్రీంకోర్టు ప్రకటించింది. న్యాయస్థానం సమానత్వం, వివక్ష రహితం, స్వేచ్ఛను నొక్కి చెప్పింది. వ్యక్తీకరణ, మరియు LGBT వ్యక్తులకు గౌరవం మరియు గోప్యతతో జీవించే హక్కు.",
    ),

    Question(
      questionText: "జోసెఫ్ షైన్ కేసు (2018)లో క్రిమినల్ ప్రొసీజర్ కోడ్ సెక్షన్ 198(2)కి సంబంధించి సుప్రీంకోర్టు ఏమి గమనించింది?",
      options:["దీన్ని రాజ్యాంగబద్ధంగా ప్రకటించబడింది", "రాజ్యాంగ విరుద్ధమైనదిగా కొట్టివేయబడింది", "దీని వర్తించే సామర్థ్యాన్ని విస్తరించింది", "సెక్షన్ 198(2)పై ప్రభావం లేదు"],
      correctAnswerIndex: 1,
      explanation:"జోసెఫ్ షైన్ కేస్ (2018)లో, అడల్టరీ నేరానికి వర్తించేంత వరకు క్రిమినల్ ప్రొసీజర్ కోడ్ సెక్షన్ 198(2) రాజ్యాంగ విరుద్ధమని సుప్రీం కోర్టు ప్రకటించింది. (వ్యభిచారాన్ని నేరంగా పరిగణించడం) కొనసాగుతుంది, విధానపరమైన నిబంధన (సెక్షన్ 198(2)) అదే మార్గాన్ని సుగమం చేస్తుంది.",
    ),

    Question(
      questionText: "అయోధ్యలోని వివాదాస్పద భూమికి సంబంధించి ఎం. సిద్ధిక్ కేసు (2019)లో సుప్రీంకోర్టు ఇచ్చిన కేంద్ర ఆదేశం ఏమిటి?",
      options:[
        "రామ్ లల్లా విరాజమాన్‌కు భూమిని ప్రదానం చేశారు",
        "పార్టీలకు భూమిని సమానంగా పంచారు",
        "ఇప్పటికే ఉన్న నిర్మాణాల నిర్దేశిత కూల్చివేత",
        "భూమిని జాతీయ వారసత్వ ప్రదేశంగా ప్రకటించింది"
      ],
      correctAnswerIndex: 0,
      explanation:"ఎం. సిద్ధిక్ కేసు (2019)లో, సుప్రీంకోర్టు అయోధ్యలోని వివాదాస్పద భూమిలోని మొత్తం 2.77 ఎకరాలను రామ్ లల్లా విరాజమాన్‌కు అప్పగించింది. వివాదాస్పద స్థలంలో రామమందిర నిర్మాణానికి కోర్టు ఆదేశాలు ఇచ్చింది మరియు మసీదు నిర్మాణం కోసం UP సున్నీ సెంట్రల్ వక్ఫ్ బోర్డుకు 5 ఎకరాల ప్రత్యామ్నాయ భూమిని కేటాయించారు.",
    ),

    Question(
      questionText: "ఇంటర్నెట్ సేవల సస్పెన్షన్‌కు సంబంధించి అనురాధ భాసిన్ కేసు (2020)లో సుప్రీంకోర్టు ఏమి ప్రకటించింది?",
      options:[
        "ఇంటర్నెట్ యాక్సెస్ కోసం రాజ్యాంగ రక్షణ లేదు",
        "ఇంటర్నెట్ సస్పెన్షన్ నిరవధికంగా ఉంటుంది",
        "ఇంటర్నెట్‌ను మూసివేయడానికి ప్రభుత్వానికి అపరిమిత అధికారం ఉంది",
        "ఇంటర్నెట్ యాక్సెస్ హక్కు రాజ్యాంగ రక్షణను పొందుతుంది"
      ],
      correctAnswerIndex: 3,
      explanation:"అనురాధ భాసిన్ కేసు (2020)లో, ఆర్టికల్ 19(1)(ఎ) మరియు ఆర్టికల్ ప్రకారం వాక్ మరియు భావవ్యక్తీకరణ స్వేచ్ఛ మరియు ఇంటర్నెట్ మాధ్యమంలో ఏదైనా వృత్తిని అభ్యసించే స్వేచ్ఛ రాజ్యాంగ రక్షణను పొందుతుందని సుప్రీంకోర్టు ప్రకటించింది. 19(1)(g).ఇంటర్నెట్ సేవలను నిరవధికంగా నిలిపివేసే ఉత్తర్వు అనుమతించబడదని మరియు అటువంటి సస్పెన్షన్ అనుపాత సూత్రానికి కట్టుబడి ఉండాలని కోర్టు నొక్కి చెప్పింది.",
    ),

    Question(
      questionText: "రాంబాబు సింగ్ ఠాకూర్ కేసు (2020)లో రాజకీయాలను నేరపూరితంగా మార్చడాన్ని పరిష్కరించడానికి సుప్రీంకోర్టు ఇచ్చిన కీలక ఆదేశాలు ఏమిటి?",
      options:[
        "రాజకీయ పార్టీలు తమ వెబ్‌సైట్లలో క్రిమినల్ కేసులు ఉన్న అభ్యర్థుల గురించి సమాచారాన్ని బహిర్గతం చేయాలి",
        "నేరస్థులు రాజకీయాల్లో పాల్గొనకుండా నిషేధం",
        "అభ్యర్థులు నేర చరిత్ర కలిగిన రాజకీయ పార్టీలను నిషేధించడం",
        "రాజకీయ పార్టీలు ఎన్నికల కమిషన్‌కు మాత్రమే సమాచారం అందించాలి"
      ],
      correctAnswerIndex: 0,
      explanation:"రాంబాబు సింగ్ ఠాకూర్ కేసు (2020)లో, అభ్యర్థులుగా ఎంపిక చేయబడిన పెండింగ్ క్రిమినల్ కేసులు ఉన్న వ్యక్తుల గురించి సవివరమైన సమాచారాన్ని బహిర్గతం చేయాలని సుప్రీంకోర్టు రాజకీయ పార్టీలను ఆదేశించింది. ఈ సమాచారాన్ని వారి వెబ్‌సైట్‌లలో అప్‌లోడ్ చేయాలి మరియు వార్తాపత్రికలు మరియు మరిన్నింటిలో ప్రచురించాలి. సోషల్ మీడియా ప్లాట్‌ఫారమ్‌లు.ఎన్నికల్లో కేవలం గెలుపే కాకుండా అర్హతలు, విజయాలు మరియు మెరిట్ ఆధారంగా ఎంపికకు కారణాలు ఉండాలని కోర్టు నొక్కి చెప్పింది.",
    ),

    Question(
      questionText: "క్రిప్టోకరెన్సీ ట్రేడింగ్‌పై నిషేధానికి సంబంధించి ఇంటర్నెట్ మరియు మొబైల్ అసోసియేషన్ ఆఫ్ ఇండియా కేసు (2020) ఫలితం ఏమిటి?",
      options:[
        "క్రిప్టోకరెన్సీ ట్రేడింగ్‌ను నిషేధించడంపై RBI యొక్క సర్క్యులర్ సమర్థించబడింది",
        "క్రిప్టోకరెన్సీ ట్రేడింగ్ భారతదేశంలో నిషేధించబడింది",
        "క్రిప్టో ట్రేడింగ్‌పై నిషేధాన్ని సుప్రీం కోర్టు సమర్థించింది",
        "క్రిప్టోకరెన్సీ ట్రేడింగ్‌ను నిషేధించడంపై RBI యొక్క సర్క్యులర్ చట్టవిరుద్ధమైనది మరియు రాజ్యాంగ విరుద్ధమైనదిగా ప్రకటించబడింది"
      ],
      correctAnswerIndex: 3,
      explanation:"ఇంటర్నెట్ మరియు మొబైల్ అసోసియేషన్ ఆఫ్ ఇండియా కేసు (2020)లో, క్రిప్టోకరెన్సీ ట్రేడింగ్‌ను నిషేధిస్తూ రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) జారీ చేసిన సర్క్యులర్‌ను సుప్రీంకోర్టు కొట్టివేసింది. దామాషా ప్రకారం ఈ సర్క్యులర్ చట్టవిరుద్ధమని మరియు రాజ్యాంగ విరుద్ధమని కోర్టు ప్రకటించింది. మరియు ఆర్టికల్ 19(1)(g) ప్రకారం వాణిజ్యాన్ని కొనసాగించే స్వేచ్ఛను ఉల్లంఘించడం. ఈ తీర్పు భారతదేశంలో క్రిప్టోకరెన్సీ ట్రేడింగ్‌పై నిషేధాన్ని తొలగించింది.",
    ),
    Question(
      questionText: "ఏ కేసు ప్రాథమిక హక్కుల కేసుగా ప్రసిద్ధి చెందింది మరియు 25వ సవరణ చట్టం, 1971కి దారితీసింది?",
      options:[
        "రొమేష్ థాపర్ వర్సెస్ స్టేట్ ఆఫ్ మద్రాస్ (1950)",
        "కేశవానంద భారతి vs. కేరళ రాష్ట్రం (1973)",
        "ఇందిరా నెహ్రూ గాంధీ వర్సెస్ రాజ్ నారాయణ్ (1975)",
        "మినర్వా మిల్స్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1980)"
      ],
      correctAnswerIndex: 1,
      explanation:"కేశవానంద భారతి వర్సెస్ స్టేట్ ఆఫ్ కేరళ (1973) అనేది ప్రాథమిక హక్కుల కేసుగా ప్రసిద్ధి చెందింది మరియు 25వ సవరణ చట్టం, 1971కి దారితీసింది.",
    ),

    Question(
      questionText: "ఎలక్షన్ కేసుగా పిలువబడే ఏ కేసు, 39వ సవరణ చట్టం, 1975కి దారితీసింది?",
      options:[
        "ఇందిరా నెహ్రూ గాంధీ వర్సెస్ రాజ్ నారాయణ్ (1975)",
        "పి. సాంబమూర్తి వర్సెస్ ఆంధ్రప్రదేశ్ రాష్ట్రం (1985)",
        "జాచిల్హు వర్సెస్ కిహోటో హోలోహన్ (1992)",
        "ఎల్. చంద్ర కుమార్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1997)"
      ],
      correctAnswerIndex: 0,
      explanation:"ఇందిరా నెహ్రూ గాంధీ వర్సెస్ రాజ్ నారాయణ్ (1975), ఎన్నికల కేసుగా ప్రసిద్ధి చెందింది, ఇది 39వ సవరణ చట్టం, 1975కి దారితీసింది.",
    ),

    Question(
      questionText: "ఫిరాయింపు కేసుగా సూచించబడిన ఏ కేసు, పదవ షెడ్యూల్‌కు దారితీసింది?",
      options:[
        "కేశవానంద భారతి vs. కేరళ రాష్ట్రం (1973)",
        "ఎల్. చంద్ర కుమార్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1997)",
        "జాచిల్హు వర్సెస్ కిహోటో హోలోహన్ (1992)",
        "సుప్రీం కోర్ట్ అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (2015)"
      ],
      correctAnswerIndex: 2,
      explanation:"జాచిల్హు వర్సెస్ కిహోటో హోలోహన్ (1992) అనేది ఫిరాయింపు కేసుగా పిలువబడుతుంది మరియు పదవ షెడ్యూల్‌కు దారితీసింది.",
    ),

    Question(
      questionText: "నాల్గవ న్యాయమూర్తుల కేసుగా ప్రసిద్ధి చెందిన ఏ కేసు, 99వ సవరణ చట్టం, 2014కు దారితీసింది?",
      options:[
        "సుప్రీం కోర్ట్ అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (2015)",
        "యూనియన్ ఆఫ్ ఇండియా వర్సెస్ రాజేంద్ర ఎన్ షా (2021)",
        "ఎల్. చంద్ర కుమార్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1997)",
        "ఇంటర్నెట్ మరియు మొబైల్ అసోసియేషన్ ఆఫ్ ఇండియా వర్సెస్ రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (2020)"
      ],
      correctAnswerIndex: 0,
      explanation:"సుప్రీం కోర్ట్ అడ్వకేట్స్-ఆన్-రికార్డ్ అసోసియేషన్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (2015) అనేది నాల్గవ న్యాయమూర్తుల కేసుగా ప్రసిద్ధి చెందింది మరియు 99వ సవరణ చట్టం, 2014కి దారితీసింది.",
    ),

    Question(
      questionText: "ఏ కేసు 46వ సవరణ చట్టం, 1982కి దారితీసింది మరియు దీనిని ప్రైవీ పర్స్ కేసు అని కూడా పిలుస్తారు?",
      options:[
        "మాధవ్ రావ్ సింధియా వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1970)",
        "పి. సాంబమూర్తి వర్సెస్ ఆంధ్రప్రదేశ్ రాష్ట్రం (1985)",
        "యూనియన్ ఆఫ్ ఇండియా వర్సెస్ వీరేపాల్ సింగ్ చౌహాన్ (1995)",
        "మినర్వా మిల్స్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1980)"
      ],
      correctAnswerIndex: 0,
      explanation:"మాధవ్ రావ్ సింధియా వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1970), దీనిని ప్రివీ పర్స్ కేసు అని కూడా పిలుస్తారు, ఫలితంగా 46వ సవరణ చట్టం, 1982.",
    ),

    Question(
      questionText: "ఏ కేసు 42వ సవరణ చట్టం, 1976కి దారితీసింది మరియు బ్యాంక్ జాతీయీకరణ కేసుగా ప్రసిద్ధి చెందింది?",
      options:[
        "మినర్వా మిల్స్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1980)",
        "RC కూపర్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1970)",
        "ఇందిరా నెహ్రూ గాంధీ వర్సెస్ రాజ్ నారాయణ్ (1975)",
        "స్టేట్ ఆఫ్ హిమాచల్ ప్రదేశ్ vs. అసోసియేటెడ్ హోటల్స్ ఆఫ్ ఇండియా లిమిటెడ్. (1972)"
      ],
      correctAnswerIndex: 1,
      explanation:"ఆర్‌సి కూపర్ వర్సెస్ యూనియన్ ఆఫ్ ఇండియా (1970), బ్యాంక్ నేషనలైజేషన్ కేసుగా ప్రసిద్ధి చెందింది, ఇది 42వ సవరణ చట్టం, 1976కి దారితీసింది.",
    ),

    Question(
      questionText: "ఏ కేసు 97వ సవరణ చట్టం, 2011కి దారితీసింది మరియు దీనిని క్రాస్ రోడ్స్ కేసు అని పిలుస్తారు?",
      options:[
        "స్టేట్ ఆఫ్ మద్రాస్ వర్సెస్ చంపకం దొరైరాజన్ (1951)",
        "యూనియన్ ఆఫ్ ఇండియా వర్సెస్ రాజేంద్ర ఎన్ షా (2021)",
        "రొమేష్ థాపర్ వర్సెస్ స్టేట్ ఆఫ్ మద్రాస్ (1950)",
        "బెరుబారి యూనియన్, ఇన్ రే. (1960)"
      ],
      correctAnswerIndex: 1,
      explanation:"యూనియన్ ఆఫ్ ఇండియా వర్సెస్ రాజేంద్ర ఎన్ షా (2021) ఫలితంగా 97వ సవరణ చట్టం, 2011, దీనిని క్రాస్ రోడ్స్ కేసుగా పిలుస్తారు.",
    ),




  ];
  int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

  late Timer _examTimer;

  @override
  void initState() {
    super.initState();
    _loadLikedData();
    //_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
    _startriversTimer();
  }
  void _startriversTimer() {
    _examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
      setState(() {
        _elapsedTimeInSeconds++;
      });
    });
  }

  Future<void> _loadLikedData() async {
    // Load liked questions data here
    // ...
  }

  void _nextQuestion() {
    setState(() {
      if (_currentQuestionIndex < _questions.length - 1) {
        _currentQuestionIndex++;
        _selectedAnswerIndex = null;
      } else {
        // All questions have been answered, navigate to results screen
        _navigateToResults();
      }
    });
  }

  void _previousQuestion() {
    setState(() {
      if (_currentQuestionIndex > 0) {
        _currentQuestionIndex--;
        _selectedAnswerIndex = null;
      }
    });
  }

  void _navigateToResults() {
    // Navigate to results screen
    _examTimer.cancel(); // Cancel the exam timer before navigating
    Navigator.of(context).pushReplacement(
      MaterialPageRoute(
        builder: (context) => ResultsScreen(
          userAnswers: _userAnswers,
          questions: _questions,
          elapsedTimeInSeconds: _elapsedTimeInSeconds,
        ),
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
        backgroundColor: Colors.blueAccent,
      ),
      body: GestureDetector(
        onVerticalDragEnd: (details) {
          if (details.velocity.pixelsPerSecond.dy < 0) {
            // Swipe up detected, move to the next question
            _nextQuestion();
          } else if (details.velocity.pixelsPerSecond.dy > 0) {
            // Swipe down detected, move to the previous question
            _previousQuestion();
          }
        },
        onHorizontalDragEnd: (details) {
          if (details.primaryVelocity! > 0) {
            _previousQuestion();
          } else if (details.primaryVelocity! < 0) {
            _nextQuestion();
          }
        },
        child: ListView(
          padding: EdgeInsets.all(16.0),
          children: [
            MyBannerAdWidget(), // Add the banner ad here
            Text(
              "Question ${_currentQuestionIndex + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              _questions[_currentQuestionIndex].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),
            ..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
              final optionIndex = entry.key;
              final optionText = entry.value;
              return InkWell( // Added this InkWell
                onTap: () {
                  setState(() {
                    _selectedAnswerIndex = optionIndex;
                    _userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
                  });
                },
                child: ListTile(
                  title: Text(optionText),
                  leading: Radio<int>(
                    value: optionIndex,
                    groupValue: _selectedAnswerIndex,
                    onChanged: (int? value) {
                      setState(() {
                        _selectedAnswerIndex = value;
                        _userAnswers[_currentQuestionIndex] = value; // Store user's answer
                      });
                    },
                  ),
                ),
              );
            }).toList(),
            // Show correct answer if an option is selected
            if (_selectedAnswerIndex != null)
              Text(
                "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.green, // Set your desired color here
                ),
              ),

            MyBannerAdWidget(), // Add the banner ad here

          ],
        ),
      ),
      bottomNavigationBar: Container(
        color: Colors.red[400],
        child: Theme(
          data: Theme.of(context).copyWith(
            canvasColor: Colors.blueAccent[200],
          ),
          child: BottomNavigationBar(
            type: BottomNavigationBarType.fixed,
            items: const [
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
                label: '',
              ),
            ],
            onTap: (index) {
              if (index == 0) {
                _previousQuestion();
              } else if (index == 1) {
                _nextQuestion();
              }
            },
          ),
        ),
      ),
      // Overall exam timer display

      // Overall exam timer display
      // Overall exam timer display
      persistentFooterButtons: [
        Text(
          'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
      ],

    );
  }
  @override
  void dispose() {
    // Dispose of the exam timer when the widget is disposed
    _examTimer.cancel();
    super.dispose();
  }
}

class ResultsScreen extends StatelessWidget {
  final int elapsedTimeInSeconds;
  final List<int?> userAnswers;
  final List<Question> questions;

  ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


  int calculateScore() {
    int score = 0;
    for (int i = 0; i < questions.length; i++) {
      if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
        score++;
      }
    }
    return score;
  }
  String formatElapsedTime(int seconds) {
    int minutes = seconds ~/ 60;
    int remainingSeconds = seconds % 60;
    return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
  }
  @override
  Widget build(BuildContext context) {
    final int score = calculateScore();
    final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
    return Scaffold(
      appBar: AppBar(
        title: Text("Results"),
        actions: [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text("Completed Time: $completedTime" ),
          ),
        ],
      ),
      body: ListView(
        padding: EdgeInsets.all(16.0),
        children: [
          MyBannerAdWidget(), // Add the banner ad here
          Text(
            "Your Score: $score/${questions.length}",
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16.0),
          for (int i = 0; i < questions.length; i++) ...[
            Text(
              "Question ${i + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              questions[i].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 8.0),
            Text(
              "Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              "Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 16.0),
            Text(
              "Explanation: ${questions[i].explanation}",
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),

          ],
        ],
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: ljti_te(),
  ));
}
