import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class parliment_te extends StatefulWidget {
  final String? userIdentifier;

  parliment_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<parliment_te> createState() => _parliment_teState();
}

class _parliment_teState extends State<parliment_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(100, null); // Initialize with the number of questions

  List<Question> _questions = [


//23.పార్లమెంట్

    Question(
        questionText: "రాజ్యాంగం ప్రకారం, భారత కన్సాలిడేటెడ్ ఫండ్ నుండి డబ్బును ఏ షరతులో ఉపసంహరించుకోవచ్చు?",
        options : [
          "రాష్ట్రపతి కోరినప్పుడు",
          "ఆర్థిక సంవత్సరం పూర్తయిన తర్వాత",
          "గ్రాంట్ల డిమాండ్లపై లోక్ ఓటు వేసి ఆమోదించిన తర్వాత సభ ",
          "ప్రధాన మంత్రి విచక్షణతో"
        ],
        correctAnswerIndex : 2,
        explanation : "లోక్ ఓటు వేసి ఆమోదించిన తర్వాత మాత్రమే కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా నుండి డబ్బును ఉపసంహరించుకోవచ్చు. రాజ్యాంగం ప్రకారం సభ .",
    ),

    Question(
      questionText: "అప్రోప్రియేషన్ చట్టం దేనికి అధికారం ఇస్తుంది లేదా చట్టబద్ధం చేస్తుంది?",
      options : [
        "కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా నుండి డబ్బు ఉపసంహరణ",
        "అప్రోప్రియేషన్ బిల్లుల పరిచయం",
        "కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా నుండి చెల్లింపులు",
        "రాజ్యాంగానికి సవరణలు"
      ],
      correctAnswerIndex : 2,
      explanation : "కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా నుండి చెల్లింపులను అప్రాప్రియేషన్ చట్టం అధికారం లేదా చట్టబద్ధం చేస్తుంది, ప్రభుత్వం కేటాయించిన నిధులను అనుమతించదు.",
    ),

    Question(
      questionText: "'ఓట్ ఆన్ అకౌంట్' ప్రయోజనం ఏమిటి?",
      options : [
      "బడ్జెట్ చక్రాన్ని ముందుకు తీసుకెళ్లడానికి",
      "లోక్‌ను రద్దు చేయడానికి సభ ",
    "అప్రోప్రియేషన్ బిల్లు అమలుకు ముందు సాధారణ కార్యకలాపాలకు డబ్బు ఇవ్వడానికి",
    "రాజ్యాంగానికి సవరణలు ఆమోదించడానికి"
    ],
    correctAnswerIndex : 2,
    explanation : "ఆర్థిక సంవత్సరానికి సంబంధించిన క్రియాత్మక సమస్యలను అధిగమించి, విభజన బిల్లు అమలుకు ముందు సాధారణ ప్రభుత్వ కార్యకలాపాలకు డబ్బును అందించడానికి 'ఓట్ ఆన్ అకౌంట్' అందించాలి.",
    ),

    Question(
      questionText: "బడ్జెట్ సెషన్‌ను 2017 నుండి జనవరి 31కి ఎందుకు పెంచారు?",
      options : [
        "ప్రత్యేక సందర్భాన్ని జరుపుకోవడానికి",
        "ఓట్ ఆన్ అకౌంట్‌ను దిద్దుబాటు",
        "అంతర్జాతీయ ఆర్థిక విధానాలకు అనుగుణంగా",
        "బడ్జెట్ చర్చలకు మరింత సమయం ఇవ్వడానికి"
      ],
      correctAnswerIndex : 1,
      explanation:"ఓట్ ఆన్ అకౌంట్‌ను మరియు ఆర్థిక సంవత్సరం ముగిసేలోపు ఒకే అప్రియేషన్ బిల్లును ఆమోదించడానికి వీలుగా బడ్జెట్ సెషన్ 2017 జనవరి 31కి ముందుకు వచ్చింది.",
    ),

    Question(
      questionText: "ఎన్నికల సంవత్సరంలో, ఓటు ఆన్ అకౌంట్‌ను ఎంత కాలం వరకు తీసుకోవచ్చు?",
      options : [
        "ఒక నెల",
        "రెండు నెలలు",
        "మూడు నుండి ఐదు నెలలు",
        "ఆరు నెలల"
      ],
      correctAnswerIndex : 2,
      explanation : "ఎన్నికల సంవత్సరంలో, ఓట్ ఆన్ అకౌంట్ ఎక్కువ కాలం పాటు తీసుకోబడుతుంది, సాధారణంగా మూడు నెలల నుండి ఐదు నెలల వరకు ఉంటుంది.",
    ),

    Question(
      questionText: "పార్లమెంటుకు మధ్యంతర బడ్జెట్ ఎప్పుడు సమర్పించబడుతుంది?",
      options : [
        "సాధారణ ఎన్నికలకు ముందు",
        "సాధారణ ఎన్నికల తర్వాత",
        "బడ్జెట్ సెషన్ సమయంలో",
        "ఆర్థిక సంవత్సరం ముగింపులో"
      ],
      correctAnswerIndex : 0,
      explanation : "ఎన్నికలు జరగడానికి ముందు సాధారణ ఎన్నికల పార్లమెంటుకు మధ్యంతర బడ్జెట్ సమర్పించబడుతుంది.",
    ),

    Question(
      questionText: "2017 బడ్జెట్ చక్రంలో ఏ మార్పు జరిగింది?",
      options : [
      "బడ్జెట్ చక్రం ఫిబ్రవరి చివరి వరకు పొడిగించబడింది",
      "బడ్జెట్ చక్రం తగ్గించబడింది",
      "బడ్జెట్ సమావేశాలు జనవరి 31కి వాయిదా పడ్డాయి.",
    "బడ్జెట్ సమావేశాలు ఆలస్యమయ్యాయి."
    ],
    correctAnswerIndex : 2,
      explanation:"2017, బడ్జెట్ సెషన్ జనవరి 31కి వాయిదా పడింది, ఆర్థిక సంవత్సరం ముగిసేలోపు ఓట్ ఆన్ అకౌంట్‌ను నివారించండి, ఒకే అప్రాప్రియేషన్ బిల్లును ఆమోదించడానికి పార్లమెంటును అనుమతిస్తుంది.",
    ),
    Question(
      questionText: "పార్లమెంటులో 'గిలెటిన్' ఏ దశలో జరుగుతుంది?",
      options : [
        "బడ్జెట్ సమర్పణ",
        "సాధారణ చర్చ",
        "విభాగ కమిటీల పరిశీలన",
        "మంజూరు డిమాండ్లపై ఓటింగ్"
      ],
      correctAnswerIndex : 3,
      explanation : "పార్లమెంటులో గ్రాంట్ల డిమాండ్లపై చర్చ మరియు ఓటింగ్ కోసం కేటాయించిన రోజుల చివరి రోజున 'గిలెటిన్' జరుగుతుంది.",
    ),

    Question(
      questionText: "బడ్జెట్ ప్రక్రియ సమయంలో డిపార్ట్‌మెంటల్ స్టాండింగ్ కమిటీల ప్రయోజనం ఏమిటి?",
      options : [
        "ఆర్థిక సర్వేను సమర్పించడానికి",
        "సాధారణ చర్చను ఏర్పాటు",
        "గ్రాంట్స్ కోసం డిమాండ్లను పరిశీలించడానికి మరియు చర్చించడానికి",
        "గ్రాంట్ల డిమాండ్ ఓటులపై వేయడానికి"
      ],
      correctAnswerIndex : 2,
      explanation : "శాఖల స్టాండింగ్ కమిటీలు మంత్రిత్వ శాఖలపై సవివరమైన మరియు సమగ్రమైన పార్లమెంటరీ ఆర్థిక నియంత్రణను అందిస్తూ, సంబంధిత మంత్రుల గ్రాంట్ల డిమాండ్లను వివరంగా పరిశీలిస్తాయి.",
    ),

    Question(
      questionText: "ఆర్థిక మంత్రి 'బడ్జెట్ ప్రసంగం' అని పిలువబడే ప్రసంగంతో బడ్జెట్‌ను ఏ దశలో సమర్పిస్తారు?",
      options : [
        "సాధారణ చర్చ",
        "గ్రాంట్స్ కోసం డిమాండ్లపై ఓటింగ్",
        "విభాగ కమిటీల పరిశీలన",
        "బడ్జెట్ సమర్పణ"
      ],
      correctAnswerIndex : 3,
      explanation : " లోక్‌కు బడ్జెట్‌ను సమర్పించే సమయంలో ఆర్థిక మంత్రి 'బడ్జెట్ ప్రసంగం' అని పిలిచే ప్రసంగంతో బడ్జెట్‌ను సమర్పిస్తారు. సభ .",
    ),

    Question(
      questionText: " రాజ్యం పాత్ర ఏమిటి గ్రాంట్ల డిమాండ్లపై ఓటింగ్ సందర్భంగా సభ ?",
      options : [
        "డిమాండ్‌లపై ఓటు వేయడానికి",
        "బడ్జెట్‌పై చర్చకు",
        "కట్ మోషన్ కోసం కదలికలను సమర్పించడానికి",
        "ప్రత్యుత్తరమిచ్చే సాధారణ హక్కు కలిగి ఉండటానికి"
      ],
      correctAnswerIndex : 1,
      explanation : " రాజ్యం బడ్జెట్ ప్రక్రియలో గ్రాంట్ల డిమాండ్లపై ఓటు వేసే అధికారం లేదు; అది బడ్జెట్ పై మాత్రమే చర్చిస్తుంది మరియు ఓటు వేసే అధికారం లేదు.",
    ),

    Question(
      questionText: "గ్రాంట్ల డిమాండ్లపై ఓటింగ్ సమయంలో 'కట్ మోషన్' ప్రయోజనం ఏమిటి?",
      options : [
        "మంజూరు కోసం నిర్దిష్ట డిమాండ్‌ను ఆమోదించడానికి",
        "డిమాండ్‌కు అంతర్లీనంగా ఉన్న విధానంపై అసమ్మతిని వ్యక్తం చేయడానికి",
        "ప్రత్యామ్నాయ ప్రక్రియ తరలించడానికి",
        "ప్రభుత్వానికి ఫిర్యాదులు సమర్పించడానికి"
      ],
      correctAnswerIndex : 1,
      explanation : "ఒక 'కట్ మోషన్' కోసం డిమాండ్‌లో అంతర్లీనంగా ఉన్న విధానం యొక్క అసమ్మతిని వ్యక్తీకరించడానికి ఆమోదం మరియు ఇది డిమాండ్ నిర్దిష్ట స్థాయికి తగ్గించాలని సూచించవచ్చు.",
    ),

    Question(
      questionText: "బడ్జెట్‌పై సాధారణ చర్చ సాధారణంగా ఎప్పుడు జరుగుతుంది?",
      options : [
      "బడ్జెట్ సమర్పణకు ముందు",
      "గ్రాంట్స్ కోసం డిమాండ్లపై ఓటింగ్ తర్వాత",
      "విభాగ కమిటీల పరిశీలన సమయంలో",
      "బడ్జెట్ ప్రవేశపెట్టిన కొద్ది రోజులకే."
    ],
    correctAnswerIndex : 5,
    explanation : "బడ్జెట్‌పై సాధారణ చర్చ సాధారణంగా పార్లమెంటు ఉభయ సభల్లో సమర్పించిన కొన్ని రోజుల తర్వాత జరుగుతుంది.",
    ),

    Question(
        questionText: "బడ్జెట్ ప్రక్రియలో 'గిలెటిన్' యొక్క ప్రాముఖ్యత ఏమిటి?",
        options : [
          "గ్రాంట్స్ కోసం నిర్దిష్ట డిమాండ్లపై కేంద్రీకృత చర్చను ప్రారంభించండి",
          "ఆర్థిక సర్వేను సమర్పించడానికి",
          "కట్ మోషన్ కోసం కదలికలను సమర్పించడానికి",
          "మంజూరు కోసం నిర్దిష్ట డిమాండ్‌ను ఆమోదించడానికి"
        ],
        correctAnswerIndex : 1,
        explanation:"గ్రాంట్ల కోసం నిర్దిష్ట డిమాండ్లపై కేంద్రీకృత చర్చను సులభతరం చేస్తూ, చర్చకు కేటాయించిన చివరి రోజున గ్రాంట్ల కోసం మిగిలిన అన్ని డిమాండ్లను ఓటు వేయడానికి మరియు పారవేసేందుకు 'గిలెటిన్' ఉత్పత్తి."
    ),
    Question(
      questionText: "భారత రాజ్యాంగంలోని ఏ ఆర్టికల్ ప్రకారం రాష్ట్రపతి ప్రతి ఆర్థిక సంవత్సరానికి అంచనా వేసిన వసూళ్లు మరియు ఖర్చుల ప్రకటనను పార్లమెంటు ఉభయ సభల ముందు ఉంచాలి?",
      options : [
        "ఆర్టికల్ 112",
        "ఆర్టికల్ 113",
        "ఆర్టికల్ 114",
        "ఆర్టికల్ 117"
      ],
      correctAnswerIndex : 0,
      explanation:"భారత రాజ్యాంగంలోని ఆర్టికల్ 112 ప్రకారం రాష్ట్రపతి ప్రతి ఆర్థిక సంవత్సరానికి అంచనా వేసిన వసూళ్లు మరియు ఖర్చుల ప్రకటనను పార్లమెంటు ఉభయ సభల ముందు ఉంచాలి.",
    ),

    Question(
      questionText: "ఏ రకమైన ఖర్చు పార్లమెంటు ద్వారా ఓటు వేయబడదు మరియు చర్చకు మాత్రమే సాధ్యమవుతుంది?",
      options : [
        "కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా నుండి చేసిన ఖర్చు",
        "కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియాపై ఛార్జ్ చేయబడిన వ్యయం",
        "రాష్ట్రపతి కార్యాలయానికి సంబంధించిన ఖర్చు",
        "న్యాయ ఖర్చులు"
      ],
      correctAnswerIndex : 1,
      explanation : "కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియాపై ఛార్జ్ చేయబడిన ఖర్చు పార్లమెంటు ద్వారా ఓటు వేయబడదు .",
    ),

    Question(
      questionText: "చట్టం ద్వారా కేటాయింపు కింద తప్ప కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా నుండి ఎలాంటి డబ్బును విత్డ్రా చేయరాదని ఏ ఆర్టికల్ నిరూపిస్తుంది?",
      options : [
        "ఆర్టికల్ 112",
        "ఆర్టికల్ 113",
        "ఆర్టికల్ 114",
        "ఆర్టికల్ 117"
      ],
      correctAnswerIndex : 2,
      explanation:"భారత రాజ్యాంగంలోని ఆర్టికల్ 114 చట్టం ద్వారా కేటాయింపు కింద మినహాయించబడిన భారత కన్సాలిడేటెడ్ ఫండ్ నుండి ఎటువంటి డబ్బును విత్డ్రా చేయరాదని నిర్దేశిస్తుంది.",
    ),

    Question(
      questionText: "రాజ్యాంగం ప్రకారం, పన్నులకు సంబంధించిన ద్రవ్య బిల్లును ఎక్కడ ప్రవేశపెట్టాలి?",
      options : [
        "పార్లమెంటు ఉభయ సభలు",
        " రాజ్య సభ ",
        " లోక్ సభ ",
        "పార్లమెంట్ సంయుక్త సమావేశం"
      ],
      correctAnswerIndex : 2,
      explanation : "రాజ్యాంగం ప్రకారం, పన్నులకు సంబంధించిన ద్రవ్య బిల్లును లోక్‌లో ప్రవేశపెట్టాలి సభ .",
    ),

    Question(
      questionText: "గ్రాంట్స్ కోసం డిమాండ్లపై ఓటు వేసే ప్రత్యేక అధికారాన్ని పార్లమెంటులో ఏ సభ ఉందా?",
      options : [
        " రాజ్య సభ ",
        "రెండు ఇళ్ళు",
        " లోక్ సభ ",
        "పార్లమెంట్ సంయుక్త సమావేశం"
      ],
      correctAnswerIndex : 2,
      explanation : " లోక్ గ్రాంట్‌ల డిమాండ్‌పై ఓటు వేసే ప్రత్యేక అధికారాన్ని సభ కలిగి ఉంది.",
    ),

    Question(
      questionText: "గ్రాంట్ల డిమాండ్లపై ఓటింగ్ సమయంలో 'కట్ మోషన్' ప్రయోజనం ఏమిటి?",
      options : [
        "మంజూరు కోసం నిర్దిష్ట డిమాండ్‌ను ఆమోదించడానికి",
        "డిమాండ్‌కు అంతర్లీనంగా ఉన్న విధానంపై అసమ్మతిని వ్యక్తం చేయడానికి",
        "ప్రత్యామ్నాయ ప్రక్రియ తరలించడానికి",
        "ప్రభుత్వానికి ఫిర్యాదులు సమర్పించడానికి"
      ],
      correctAnswerIndex : 1,
      explanation : "ఒక 'కట్ మోషన్' కోసం డిమాండ్‌లో అంతర్లీనంగా ఉన్న విధానం యొక్క అసమ్మతిని వ్యక్తీకరించడానికి ఆమోదం మరియు ఇది డిమాండ్ నిర్దిష్ట స్థాయికి తగ్గించాలని సూచించవచ్చు.",
    ),

    Question(
      questionText: "భారత రాజ్యాంగంలోని ఏ ఆర్టికల్ బడ్జెట్ అమలుకు సంబంధించి పార్లమెంటు ఉభయ సభలకు సంబంధించిన పాత్రలు లేదా స్థానాలను నిర్వహిస్తుంది?",
      options : [
        "ఆర్టికల్ 109",
        "ఆర్టికల్ 112",
        "ఆర్టికల్ 113",
        "ఆర్టికల్ 117"
      ],
      correctAnswerIndex : 7,
      explanation : "భారత రాజ్యాంగంలోని ఆర్టికల్ 117 బడ్జెట్ అమలుకు సంబంధించి పార్లమెంటు ఉభయ సభలకు సంబంధించిన పాత్రలు లేదా స్థానాలను నిర్వహిస్తుంది.",
    ),
    Question(
      questionText: "బడ్జెట్ కోసం రాజ్యాంగంలో ఉపయోగించిన పదం ఏమిటి?",
      options : [
        "ఆర్థిక పత్రం",
        "వార్షిక ఆర్థిక నివేదిక",
        "ప్రభుత్వ ప్రకటన",
        "ఆర్థిక బడ్జెట్"
      ],
      correctAnswerIndex : 1,
      explanation : "రాజ్యాంగంలో, బడ్జెట్‌ను 'వార్షిక ఆర్థిక నివేదిక'గా సూచిస్తారు మరియు 'బడ్జెట్' అనే పదం దీనికి ప్రసిద్ధ పేరు.",
    ),

    Question(
      questionText: "భారతదేశంలో బడ్జెట్ ప్రధానంగా దేనిని కలిగి ఉంటుంది?",
      options : [
        "పన్నుల ప్రతిపాదనల వివరాలు",
        "రాబడి మరియు మూలధన రశీదుల అంచనాలు",
        "ఆర్థిక మరియు ఆర్థిక విధానం",
        "ముగింపు ఆర్థిక సంవత్సరం యొక్క వాస్తవ రసీదులు మరియు ఖర్చులు"
      ],
      correctAnswerIndex : 1,
      explanation:"భారతదేశంలో బడ్జెట్ ప్రాథమికంగా రాబడి మరియు మూలధన రచయితల అంచనాలను కలిగి ఉంటుంది, అలాగే రాబడి, వ్యయ వివరాలు మరియు ఆర్థిక మరియు ఆర్థిక విధానాలను పెంచే మార్గాలు మరియు ఇతర అంశాలతో పాటుగా ఉంటాయి.",
    ),

    Question(
      questionText: "భారతదేశంలో ఆర్థిక సంవత్సరం ఎప్పుడు జరుగుతుంది మరియు ఎప్పుడు ముగుస్తుంది?",
      options : [
        "జనవరి 1 నుండి డిసెంబర్ 31 వరకు",
        "ఏప్రిల్ 1 నుండి మార్చి 31",
        "జూలై 1 నుండి జూన్ 30 వరకు",
        "అక్టోబర్ 1 నుండి సెప్టెంబర్ 30 వరకు"
      ],
      correctAnswerIndex : 1,
      explanation : "భారతదేశంలో ఆర్థిక సంవత్సరం ఏప్రిల్ 1న ప్రారంభమై తదుపరి సంవత్సరం మార్చి 31న ముగుస్తుంది.",
    ),

    Question(
      questionText: "1924లో సాధారణ బడ్జెట్ నుండి రైల్వే బడ్జెట్‌ను వేరు చేయడానికి కారణాలు లేదా లక్ష్యాలు ఏమిటి?",
      options : [
        "రైల్వే ఫైనాన్స్‌లో వశ్యతను పరిచయం చేయడానికి",
        "సాధారణ రాబడుల స్థిరత్వం కోసం",
        "రైల్వేలు తమ సొంత అభివృద్ధి కోసం లాభాలను కొనసాగించేలా చేయడం",
        "పైన ఉన్నవన్నీ"
      ],
      correctAnswerIndex : 3,
      explanation:"1924లో రైల్వే బడ్జెట్‌ను వేరు చేయడం ద్వారా రైల్వే ఫైనాన్స్‌లో సౌలభ్యాన్ని ప్రవేశపెట్టడం, సాధారణ రాబడుల సురక్షిత స్థిరత్వం మరియు రైల్వేలు తమ సొంత అభివృద్ధి కోసం లాభాలను కొనసాగించాలని లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "కేంద్ర ప్రభుత్వం రైల్వే బడ్జెట్‌ను సాధారణ బడ్జెట్‌లో ఎప్పుడు విలీనం చేసిందా?",
      options : [
        "1921",
        "2017",
        "2000",
        "1985"
      ],
      correctAnswerIndex : 1,
      explanation:"కేంద్ర ప్రభుత్వం రైల్వే బడ్జెట్‌ను 2017లో సాధారణ బడ్జెట్‌లో విలీనం చేసింది, రైల్వేలు మరియు ఇతర మంత్రిత్వ శాఖలకు ప్రత్యేక బడ్జెట్‌లను కలిగి ఉండే పద్ధతికి ముగింపు పలికింది.",
    ),

    Question(
      questionText: "రైల్వే బడ్జెట్ సాధారణ బడ్జెట్‌లో విలీనం కావడానికి ముందు ఏమి ఉంది?",
      options : [
        "అన్ని మంత్రిత్వ శాఖల రసీదులు మరియు ఖర్చుల అంచనాలు",
        "రైల్వే మంత్రిత్వ శాఖ మాత్రమే రసీదులు మరియు ఖర్చుల అంచనాలు",
        "పన్నుల ప్రతిపాదనల అంచనాలు",
        "మూలధన రశీదుల అంచనాలు మాత్రమే"
      ],
      correctAnswerIndex : 1,
      explanation:"సాధారణ బడ్జెట్‌లో విలీనం కావడానికి ముందు, రైల్వే బడ్జెట్ కేవలం రైల్వే మంత్రిత్వ శాఖ యొక్క రసీదులు మరియు ఖర్చుల అంచనాలను కలిగి ఉంటుంది.",
    ),
    Question(
      questionText: "పార్లమెంటు ఉభయ సభల సంయుక్త సమావేశం యొక్క ఉద్దేశ్యం ఏమిటి?",
      options : [
        "సాధారణ బిల్లులను చర్చించడానికి",
        "బిల్లు ఆమోదానికి సంబంధించిన ప్రతిష్టంభనను పూర్తి",
        "రాజ్యాంగ సవరణ బిల్లులపై చర్చకు",
        "మనీ బిల్లులు పాస్ చేయడానికి"
      ],
      correctAnswerIndex : 1,
      explanation : "ఉభయ సభల ఉమ్మడి సమావేశం బిల్లు ఆమోదంపై ప్రతిష్టంభనను ఏర్పాటు చేయడం ఒక అసాధారణ పని.",
    ),

    Question(
      questionText: "ఏ పరిస్థితుల్లో ఉమ్మడి సభను పిలవవచ్చు?",
      options : [
        "బిల్లు డబ్బు బిల్లు అయితే",
        "బిల్లు రాజ్యాంగ సవరణ బిల్లు అయితే",
        "బిల్లును ఇతర సభ తిరస్కరించింది",
        "బిల్లును ఉభయ సభలు ఏకగ్రీవంగా ఆమోదించడానికి"
      ],
      correctAnswerIndex : 2,
      explanation:"బిల్లును ఇతర సభ తిరస్కరించిన సందర్భాల్లో, సవరణలపై సభలు చివరకు ఏకీభవించనప్పుడు బిల్లును ఆమోదించకుండా ఆరు నెలలకు పైగా గడిచిన సందర్భాల్లో ఉమ్మడి సమావేశాన్ని పిలవవచ్చు.",
    ),

    Question(
      questionText: "ఉభయ సభల సంయుక్త సమావేశానికి ఎవరు అధ్యక్షత వహిస్తారు?",
      options : [
      " రాజ్యాధ్యక్షుడు సభ ",
      " లోక్ డిప్యూటీ స్పీకర్ సభ ",
      "రాజ్య డిప్యూటీ చైర్మన్ సభ ",
    "లోక్ స్పీకర్ సభ "
    ],
    correctAnswerIndex : 3,
      explanation : " లోక్ స్పీకర్ ఉభయ సభకు సభ అధ్యక్షత వహిస్తుంది మరియు వారు లేనప్పుడు డిప్యూటీ స్పీకర్. ఇద్దరూ గైర్హాజరైతే డిప్యూటీ చైర్మన్ రాజయ్య సభ అధ్యక్షత వహిస్తారు. ",
    ),

    Question(
      questionText: "జాయింట్ సిట్టింగ్‌ని ఏర్పాటు చేయడానికి కోరం అవసరం ఏమిటి?",
      options : ["మూడవ వంతు", "ఐదవ వంతు", "పదవ వంతు", "ఒక సగం"],
      correctAnswerIndex : 2,
      explanation : "ఉభయ సభల మొత్తం సభ్యుల సంఖ్యలో పదో వంతు ఉభయ సభను ఏర్పాటు చేయాలని కోరాం.",
    ),

    Question(
      questionText: "ఉమ్మడి సమావేశంలో కొత్త సవరణలు ఎప్పుడు ప్రతిపాదించవచ్చు?",
      options : [
        "ఉమ్మడి సిట్టింగ్ సమయంలో ఎప్పుడైనా",
        "బిల్లు డబ్బు బిల్లు అయితే మాత్రమే",
        "బిల్లు రాజ్యాంగ సవరణ బిల్లు అయితే మాత్రమే",
        "సభల మధ్య తుది అసమ్మతి ఏర్పడిన సందర్భంలో లేదా బిల్లు ఆమోదంలో జాప్యం కారణంగా"
      ],
      correctAnswerIndex : 3,
      explanation : "సభల మధ్య తుది ఆమోదం లేదా బిల్లు ఆమోదంలో జాప్యం కారణంగా ఉమ్మడి సమావేశంలో కొత్త సవరణలు ప్రతిపాదించవచ్చు.",
    ),

    Question(
      questionText: "1950 నుండి ఇప్పటి వరకు ఎన్ని సార్లు ఉమ్మడి సభ కోసం ఏర్పాటు చేయాలి?",
      options : ["ఒకసారి", "రెండుసార్లు", "మూడుసార్లు", "నాలుగు సార్లు"],
      correctAnswerIndex : 2,
      explanation:"1950 నుండి, వరకట్న నిషేధ బిల్లు, 1960, బ్యాంకింగ్ సర్వీస్ కమీషన్ (రద్దు) బిల్లు, 1977 మరియు ఉగ్రవాద నిరోధక బిల్లు, 2002 బిల్లులతో కూడిన ఉమ్మడి సమావేశానికి సంబంధించిన మూడు సార్లు మాత్రమే అమలు చేయబడింది.",
    ),
    Question(
      questionText: "రాజ్యాంగంలో మూడు రకాల ఆర్థిక బిల్లులు ఏమిటి?",
      options : [
        "ఎ, బి, సి",
        "మనీ బిల్లులు, ఆర్థిక బిల్లులు (I), మరియు ఆర్థిక బిల్లులు (II)",
        "ప్రాథమిక, ద్వితీయ, తృతీయ",
        "ప్రత్యేకమైన, కలుపుకొని, ద్వంద్వ"
      ],
      correctAnswerIndex : 1,
      explanation : "రాజ్యాంగంలో మూడు రకాల ఆర్థిక బిల్లులు ద్రవ్య బిల్లులు, ఆర్థిక బిల్లులు (I), మరియు ఆర్థిక బిల్లులు (II).",
    ),

    Question(
      questionText: "మనీ బిల్లులను ఇతర ఆర్థిక బిల్లుల నుండి ఏది వేరు చేస్తుంది?",
      options : [
    "లోక్‌లో మాత్రమే పరిచయం చేయబడతారు సభ , ఇతర ఆర్థిక బిల్లులను ఏ సభలోనైనా ప్రవేశపెట్టవచ్చు. ",
    "పరిచయం కోసం వారికి రాష్ట్రపతి సిఫార్సు అవసరం. ",
   " లోక్ స్పీకర్ చేత ధృవీకరించబడింది సభ .",
    "ఏ ప్రత్యేక సిఫార్సు లేకుండానే ఏ సభలోనైనా వారిని ప్రవేశపెట్టవచ్చు."
    ],
    correctAnswerIndex : 2,
      explanation : "మనీ ప్రత్యేకంగా ఆర్టికల్ 11లో ఉన్న అంశాలకు సంబంధించిన మరియు లోక్ స్పీకర్ చేత బిల్లు ఆమోదించబడింది సభ . అవి కూడా లోక్‌లో మాత్రమే ప్రవేశపెడతారు సభ .",
    ),

    Question(
      questionText: "ఏ అంశాలలో ఆర్థిక బిల్లు (I) మనీ బిల్లును పోలి ఉంటుంది?",
      options : [
      "సభలో పరిచయం మరియు రాష్ట్రపతి సిఫార్సు అవసరం లేదు. ",
      "లోక్‌లో మాత్రమే పరిచయం చేయవచ్చు సభ మరియు సిఫార్సు అవసరం. ",
      "వాటిని సాధారణ బిల్లులుగా పరిగణిస్తారు. ",
      "రెండు సభలో సవరణలు అనుమతించబడవు."
      ],
      correctAnswerIndex : 1,
      explanation : "ఆర్థిక బిల్లు (I) ద్రవ్య బిల్లును పోలి ఉంటుంది, ఇందులోని లోక్‌లో మాత్రమే ప్రవేశపెట్టవచ్చు సభ మరియు రాష్ట్రపతి సిఫార్సు అవసరం.",
    ),

    Question(
      questionText: "ఆర్థిక బిల్లు (II) యొక్క ప్రత్యేక లక్షణం ఏమిటి?",
      options : [
      "దీనికి ఉభయ సభల్లో ఏకగ్రీవ ఆమోదం అవసరం.",
     " రాజ్యంలో మాత్రమే ప్రవేశపెట్టబడుతుంది సభ .",
    "దీనిని ఏ సభలు సవరించలేవు. ",
    "రాష్ట్రపతి దాని పరిశీలనను సిఫార్సు చేస్తే తప్ప ఇది ఆమోదించబడదు."
    ],
    correctAnswerIndex : 3,
      explanation : "ఆర్థిక బిల్లు (II) యొక్క ప్రత్యేక లక్షణం, రాష్ట్రపతి సభకు దాని పరిశీలనను సిఫార్సు చేస్తే తప్ప అది ఆమోదించబడదు.",
    ),

    Question(
      questionText: "ఆర్థిక బిల్లు (I) లేదా (II) కోసం రాష్ట్రపతి జైంట్ సిట్టింగ్‌ను ఎప్పుడు పిలవగలరు?",
      options : [
      "రెండు సభల మధ్య విభేదాలు ఉంటే.",
      " లోక్ అయితే సభ రద్దయింది. ",
      "రాజ్యంలో బిల్లు తిరస్కరణకు గురైతే సభ .",
    "బిల్లు ప్రత్యేకంగా పన్ను సంబంధిత విషయాలు ఉంటే."
    ],
    correctAnswerIndex : 0,
      explanation : "రెండు సభల మధ్య అసమ్మతి ఏర్పడిన సందర్భంలో ఆర్థిక బిల్లు (I) లేదా (II) కోసం రాష్ట్రపతి సంయుక్త సభను పిలవవచ్చు.",
    ),

    Question(
      questionText: "ఆర్థిక బిల్లు ఆమోదం కోసం సమర్పించబడినప్పుడు రాష్ట్రపతికి ఎలాంటి options ఉంటాయి?",
      options : [
        "సమ్మతి ఇవ్వండి, సమ్మతిని నిలిపివేయండి లేదా పునఃపరిశీలన కోసం పంపండి. ",
        "సమ్మతి మాత్రమే ఇవ్వండి. ",
        "సమ్మతిని మాత్రమే నిలిపివేయండి. ",
        "సవరణలు ఉంటే మాత్రమే పునఃపరిశీలనకు పంపండి."
      ],
      correctAnswerIndex : 0,
      explanation : "రాష్ట్రపతి బిల్లుకు సమ్మతి ఇవ్వవచ్చు, ఆమోదాన్ని నిలిపివేయవచ్చు లేదా ఆమోదం కోసం సమర్పించినప్పుడు పునఃపరిశీలన కోసం తిరిగి ఇవ్వవచ్చు.",
    ),
    Question(
      questionText: "సాధారణ బిల్లును ప్రవేశపెట్టడానికి ఏ ప్రకటన నిజం?",
      options : [
      "ఇది ఒక మంత్రి ద్వారా మాత్రమే ప్రవేశపెట్టబడుతుంది. ",
      "రాజ్యానికి పంపినప్పుడు స్పీకర్ ధృవీకరణ అవసరం సభ .",
    "ఇది రాష్ట్రపతి సిఫార్సుపై మాత్రమే ప్రవేశపెట్టబడింది. ",
    "లోక్‌లో గాని ప్రవేశపెట్టవచ్చు సభ లేదా రాజ్యసభ సభ ."
    ],
    correctAnswerIndex : 3,
    explanation : "సాధారణ బిల్లును లోక్‌లో గాని ప్రవేశపెట్టవచ్చు సభ లేదా రాజ్యసభ సభ .",
    ),

    Question(
      questionText: "మనీ బిల్లును ప్రవేశపెట్టడంలో ప్రత్యేకత ఏమిటి?",
      options : [
    "రాజ్యానికి పంపినప్పుడు స్పీకర్ ధృవీకరణ అవసరం సభ .",
      "ఇది ఒక మంత్రి లేదా ప్రైవేట్ సభ్యుడు ద్వారా పరిచయం చేయవచ్చు. ",
      "ఇది పరిచయం కోసం సిఫార్సు అవసరం. ",
    "  లోక్‌లో మాత్రమే ప్రవేశపెట్టబడుతుంది సభ , రాజ్యసభలో కాదు సభ ."
    ],
    correctAnswerIndex : 3,
    explanation : "మనీ బిల్లు లోక్‌లో మాత్రమే ప్రవేశపెట్టబడుతుంది సభ , రాజ్యసభలో కాదు సభ .",
    ),

    Question(
        questionText: " రాజ్యం ఎలాంటి చర్య తీసుకోగలదు ఆర్డినరీ బిల్లుకు సంబంధించి సభ తీసుకుంటారా?",
        options : [
        "ఇది బిల్లును అదనంగా 14 రోజుల వరకు మాత్రమే ఉంటుంది. ",
        "రాజ్యం సవరించడం లేదా తిరస్కరించడం సాధ్యం కాదు సభ .",
    "ఇది బిల్లు మరియు రాజ్యాన్ని సవరించవచ్చు లేదా తిరస్కరించవచ్చు నిబంధనలతో లేదా లేకుండా బిల్లును సభ తిరిగి ఇవ్వాలి. ",
    "ఇది పొడవుగా ఆరు నెలల వరకు బిల్లును నిలుపుదల చేయగలదు."
    ],
    correctAnswerIndex : 2,
    explanation : " రాజ్యం సభ సాధారణ బిల్లును సవరించవచ్చు లేదా తిరస్కరించవచ్చు మరియు అది సిఫార్సులతో లేదా లేకుండా బిల్లును తిరిగి ఇవ్వాలి."
    ),

    Question(
      questionText: " రాజ్యం కంటే కాలం ఎంత సభ మనీ బిల్లును నిర్బంధించగలదా?",
      options : [
      "14 రోజులు",
      "ఆరు నెలల",
      "30 రోజులు",
      "రాజ్యం ద్వారా మనీ బిల్లును నిర్బంధించడానికి ఎటువంటి నిబంధన లేదు సభ ."
    ],
    correctAnswerIndex : 3,
    explanation : " రాజ్యానికి ఎలాంటి నిబంధన లేదు మనీ బిల్లును నిర్బంధించడానికి సభ ; ఇది మొత్తంగా 14 రోజులు మాత్రమే చర్చించబడుతుంది.",
    ),

    Question(
      questionText: "మనీ బిల్లుపై ప్రతిష్టంభన ఎలా పరిష్కరించబడుతుంది?",
      options : [
        "ఉమ్మడి సభ లేకుండానే బిల్లు విధిని నిర్ణయిస్తారు. ",
        "ఉభయ సభల సంయుక్త సమావేశాన్ని రాష్ట్రపతి పిలిపించారు. ",
        "ఇది రాష్ట్రపతి ఆమోదం అవసరం లేకుండా స్వయంచాలకంగా చట్టం అవుతుంది. ",
        " రాజ్యం ప్రతిష్టంభనను పూర్తి సభ బిల్లును సవరించవచ్చు."
      ],
      correctAnswerIndex : 0,
      explanation : "మనీ బిల్లుపై ప్రతిష్టంభన ఏర్పడితే, ఉభయ సభ అవసరం లేకుండానే రాష్ట్రపతి బిల్లును నిర్ణయిస్తారు.",
    ),

    Question(
        questionText: "మనీ బిల్లు లోక్‌లో ఓడిపోతే ఏమవుతుంది సభా ?",
        options : [
    "రాజ్యాంగం అయితే రాష్ట్రపతి ఇప్పటికీ ఆమోదించవచ్చు సభ అంగీకరించింది. ",
        "ఇది ప్రభుత్వ రాజీనామాకు దారి తీస్తుంది. ",
        "లోక్ మాత్రమే ఆమోదించినా రాష్ట్రపతి ఆమోదం కోసం పంపబడుతుంది సభ .",
    "ఇది రాష్ట్రపతి ఆమోదం అవసరం లేకుండా స్వయంచాలకంగా చట్టం అవుతుంది."
    ],
        correctAnswerIndex : 1,
        explanation : "మనీ బిల్లు లోక్‌లో ఓడిపోతే సభ , అది ప్రభుత్వ రాజీనామాకు దారి తీస్తుంది.",
    ),

    Question(
      questionText: "సాధారణ బిల్లు లేదా మనీ బిల్లుకు సంబంధించి రాష్ట్రపతికి ఎలాంటి options ఉన్నాయా?",
      options : [
        "ఆమోదించవచ్చు, తిరస్కరించవచ్చు లేదా పునఃపరిశీలన కోసం తిరిగి రావచ్చు. ",
        "మాత్రమే ఆమోదించగలరు లేదా తిరస్కరించగలరు. ",
        "పునరాలోచన కోసం మాత్రమే తిరిగి రావచ్చు. ",
        "పార్లమెంటు నిర్ణయంతో సంబంధం లేకుండా మాత్రమే ఆమోదించగలరు."
      ],
      correctAnswerIndex : 0,
      explanation : "ఒక సాధారణ బిల్లు లేదా మనీ బిల్లును పునఃపరిశీలన కోసం రాష్ట్రపతి ఆమోదించవచ్చు, తిరస్కరించవచ్చు లేదా తిరిగి ఇవ్వవచ్చు.",
    ),
    Question(
      questionText: "ఆర్టికల్ 110 ప్రకారం, మనీ బిల్లుగా పరిగణించబడే బిల్లుకు ప్రమాణంగా ఏ విషయం స్పష్టంగా పేర్కొనబడలేదు?",
      options : [
        "జరిమానాలు లేదా ఇతర ద్రవ్య జరిమానాలు విధించడం",
        "కస్టడీ ఆఫ్ ది కన్సాలిడేటెడ్ ఫండ్ ఆఫ్ ఇండియా",
        "కేంద్ర ప్రభుత్వం ద్వారా డబ్బును తీసుకునే నియంత్రణ",
        "స్థానిక ప్రయోజనాల కోసం స్థానిక అధికార పన్నులు విధించడం"
      ],
      correctAnswerIndex : 3,
      explanation:"స్థానిక ప్రయోజనాల కోసం స్థానిక అధికారం ద్వారా పన్ను విధించడం అనేది బిల్లును ద్రవ్యంగా చెల్లించడానికి ఒక ప్రమాణంగా ఆర్టికల్ 110లో స్పష్టంగా చూపబడలేదు.",
    ),

    Question(
      questionText: "బిల్లు డబ్బు బిల్లు కాదా అని నిర్ణయించే తుది అధికారం ఎవరికి ఉంటుంది?",
      options : [
      "రాష్ట్రపతి",
      " రాజ్యం సభ ",
      "లోక్ స్పీకర్ సభ ",
    "ప్రధాన మంత్రి"
    ],
    correctAnswerIndex : 2,
      explanation : " లోక్ స్పీకర్ బిల్లు ద్రవ్య బిల్లు కాదా అని నిర్ణయించే అధికారం తుది సభకు ఉంది. ఈ విషయంలో స్పీకర్ నిర్ణయమే అంతిమమని, ప్రశ్నించలేమన్నారు. ",
    ),

    Question(
      questionText: "మనీ బిల్లుకు సంబంధించి ఏ ఇంటికి ఎక్కువ అధికారాలు ఉన్నాయా?",
      options : [
        " లోక్ సభ ",
        " రాజ్య సభ ",
        "రెండు సభలకు సమాన అధికారాలు ఉన్నాయి",
        "నిర్ణయం నిర్దిష్ట బిల్లుపై ఆధారపడి ఉంటుంది"
      ],
      correctAnswerIndex : 0,
      explanation : " లోక్ రాజ్యసభతో ప్రస్తుత ద్రవ్య బిల్లుకు సంబంధించి సభకు ఎక్కువ అధికారాలు ఉన్నాయి సభ . రాజ్యం _ సభలను మాత్రమే చేయగలదు మరియు బిల్లును లోక్‌కు తిరిగి ఇవ్వాలి 14 రోజుల్లో సభ .",
    ),

    Question(
      questionText: " రాజ్యమైతే ఏమవుతుంది సభ 14 రోజుల్లో ద్రవ్య బిల్లును తిరిగి ఇవ్వలేదా?",
      options : [
    "లోక్ ఆమోదించిన రూపంలో ఉభయ సభలు ఆమోదించినట్లుగా పరిగణించబడుతుంది సభ .",
      "బిల్లు స్వయంచాలకంగా తిరస్కరించబడింది. ",
     " లోక్కి పంపబడింది పునర్విచారణకు సభ . ",
    "బిల్లు విధిని రాష్ట్రపతి నిర్ణయిస్తారు."
    ],
    correctAnswerIndex : 0,
      explanation:" రాజ్యం అయితే సభ 14 రోజులలోపు ద్రవ్య బిల్లును తిరిగి ఇవ్వదు, బిల్లు నిజానికి లోక్ ఆమోదించిన రూపంలో ఉభయ సభలు ఆమోదించినట్లుగా పరిగణించబడుతుంది. సభ .",
    ),

    Question(
      questionText: "మనీ బిల్లుకు సంబంధించి రాష్ట్రపతికి ఎలాంటి options ఉన్నాయా?",
      options : [
        "ఆమోదించవచ్చు, తిరస్కరించవచ్చు లేదా పునఃపరిశీలన కోసం తిరిగి రావచ్చు. ",
        "మాత్రమే ఆమోదించగలరు లేదా తిరస్కరించగలరు. ",
        "పునరాలోచన కోసం మాత్రమే తిరిగి రావచ్చు. ",
        "సమ్మతిని నిలిపివేయవచ్చు కానీ పరిశీలన కోసం తిరిగి రాలేరు."
      ],
      correctAnswerIndex : 1,
      explanation : "రాష్ట్రపతి ద్రవ్య బిల్లును మాత్రమే ఆమోదించగలరు లేదా తిరస్కరించగలరు. రాష్ట్రపతి సభల ద్వారా పునఃపరిశీలన కోసం ద్రవ్య బిల్లును తిరిగి ఇవ్వలేరు. ",
    ),
    Question(
      questionText: "సాధారణ బిల్లు రెండవ పఠనం సమయంలో చర్చ యొక్క దృష్టి ఏమిటి?",
      options : [
        "బిల్లు యొక్క explanationాత్మక పరిశీలన మరియు తుది ఆకృతి",
        "బిల్లు యొక్క సాధారణ సూత్రాలు మరియు నిబంధనలు",
        "బిల్లుకు సవరణలు",
        "బిల్లుపై ప్రజల అభిప్రాయం"
      ],
      correctAnswerIndex : 1,
      explanation : "సాధారణ బిల్లు యొక్క రెండవ పఠనం సమయంలో, బిల్లు యొక్క సాధారణ సూత్రాలు మరియు నిబంధనలపై దృష్టి కేంద్రీకరించబడింది. తదుపరి దశలలో బిల్లు యొక్క explanationాత్మక పరిశీలన మరియు తుది ఆకృతి ప్రసంగించబడుతుంది. ",
    ),

    Question(
        questionText: "సాధారణ బిల్లు పరిశీలన దశలో ఏమి జరుగుతుంది?",
        options : [
          "బిల్లుపై సాధారణ చర్చ",
          "బిల్లు పరిచయం",
          "క్లాజ్ వారీగా explanationాత్మక పరీక్ష నిబంధన",
          "సవరణలు ప్రతిపాదించబడ్డాయి మరియు ఓటు వేయబడ్డాయి"
        ],
        correctAnswerIndex : 3,
        explanation : "సాధారణ బిల్లు యొక్క పరిశీలన దశలో, ప్రతి నిబంధనను విడివిడిగా మరియు సభ్యుల సవరణలను ప్రతిపాదించవచ్చు. ఈ సవరణలు ఓటు వేయబడి ఆమోదించబడితే, అవి బిల్లులో భాగమవుతాయి."
    ),

    Question(
      questionText: "మొత్తం సాధారణ బిల్లు ఆమోదం లేదా తిరస్కరణపై చర్చ ఏ దశలో దృష్టి పెడుతుంది?",
      options : [
        "మొదటి పఠనం",
        "రెండవ పఠనం",
        "మూడవ పఠనం",
        "పరిశీలన దశ"
      ],
      correctAnswerIndex : 2,
      explanation : "మొత్తం సాధారణ బిల్లు ఆమోదం లేదా తిరస్కరణపై చర్చ మూడవ పఠనం సమయంలో జరుగుతుంది. ఈ దశ పరిశీలన దశలో explanationాత్మక పరిశీలన మరియు చర్చ జరుగుతుంది. ",
    ),

    Question(
      questionText: "సాధారణ బిల్లును తీసుకునేటప్పుడు రెండవ సభకు ఎలాంటి options ఉన్నాయా?",
      options : [
        "బిల్లును సవరణలు లేకుండా ఆమోదించండి, సవరణలతో ఆమోదించండి, బిల్లును తిరస్కరించండి లేదా పెండింగ్‌లో ఉంచండి",
        "బిల్లును తిరస్కరించండి లేదా సవరణలు లేకుండా ఆమోదించండి",
        "సవరణలతో మాత్రమే బిల్లును ఆమోదించండి",
        "బిల్లును జైంట్ కమిటీకి పంపండి"
      ],
      correctAnswerIndex : 0,
      explanation : "రెండవ సభ, సాధారణ బిల్లును తీసుకున్నప్పుడు, నాలుగు ప్రత్యామ్నాయాలు ఉన్నాయి: సవరణలు లేకుండా బిల్లును ఆమోదించండి, సవరణలతో ఆమోదించండి, బిల్లును తిరస్కరించండి లేదా పెండింగ్‌లో ఉంచండి.",
    ),

    Question(
      questionText: "సాధారణ బిల్లుకు సంబంధించి ఉభయ సభల మధ్య ప్రతిష్టంభన ఏర్పడితే ఏమవుతుంది?",
      options : [
        "బిల్లు స్వయంచాలకంగా తిరస్కరించబడింది. ",
        "రాష్ట్రపతిదే తుది నిర్ణయం. ",
        "బిల్లు సుప్రీంకోర్టుకు పంపబడింది. ",
        "ప్రతిష్టంభనను ఏర్పాటు ఉమ్మడి సభను పిలవవచ్చు."
      ],
      correctAnswerIndex : 3,
      explanation : "ఒక సాధారణ బిల్లుకు సంబంధించి ఉభయ సభల మధ్య ప్రతిష్టంభన ఏర్పడితే, ప్రతిష్టంభనకు అనుగుణంగా రాష్ట్రపతి ఉభయ సభలను పిలవవచ్చు. మెజారిటీ బిల్లును ఆమోదించారు, అది ఉభయ సభలు ఆమోదించినట్లు భావించబడుతుంది. ",
    ),

    Question(
      questionText: "సాధారణ బిల్లుకు సంబంధించి రాష్ట్రపతికి ఎలాంటి వీటో ఉందా?",
      options : [
        "సంపూర్ణ వీటో",
        "షరతులతో కూడిన వీటో",
        " సస్పెన్స్ వీటో",
        "పాకెట్ వీటో"
      ],
      correctAnswerIndex : 2,
      explanation : "ఒక సాధారణ బిల్లుకు సంబంధించి రాష్ట్రపతికి ' సస్పెన్సివ్ వీటో' ఉంది. పునర్విచారణ తర్వాత బిల్లును ఉభయ సభలు మళ్లీ ఆమోదించాయి, రాష్ట్రపతి తప్పనిసరిగా ఆమోదం తెలపాలి. ",
    ),

    Question(
      questionText: "పార్లమెంటులో పబ్లిక్ బిల్లులు మరియు ప్రైవేట్ బిల్లుల మధ్య ప్రధాన తేడా ఏమిటి?",
      options : [
        "పబ్ బిల్లులు మంత్రులచే ప్రవేశపెట్టబడినప్పటికీ మరియు ప్రభుత్వ విధానాలను ప్రతిబింబిస్తుంది, ప్రైవేట్ బిల్లులు మంత్రియేతర సభ్యులచే ప్రవేశపెట్టబడిన మరియు ప్రభుత్వ వైఖరిని ప్రతిబింబించవు. ",
        "పబ్లిక్ బిల్లులు ఆమోదం పొందే అవకాశం ఎక్కువ మరియు తిరస్కరించబడితే ప్రభుత్వం రాజీనామాకు దారితీయవచ్చు, అయితే ప్రైవేట్ బిల్లులకు ఆమోదం తక్కువగా ఉంటుంది మరియు ప్రభుత్వంపై ప్రభావం ఉండదు. ",
        "పబ్లిక్ బిల్లులు ప్రవేశపెట్టడానికి ఒక నెల నోటీసు అవసరం, ప్రైవేట్ బిల్లులకు ఏడు రోజుల నోటీసు అవసరం. ",
        "పబ్లిక్ బిల్లులు ఆర్థిక విషయాలతో వ్యవహరిస్తాయి, ప్రైవేట్ బిల్లులు ఇతర అంశాలకు సంబంధించినవి."
      ],
      correctAnswerIndex : 0,
      explanation : "ప్రధాన వ్యత్యాసం, పబ్లిక్ బిల్లులు మంత్రులచే ప్రవేశపెట్టబడతాయి, ప్రభుత్వ విధానాలను ప్రతిబింబిస్తాయి మరియు ఎక్కువ ఆమోదం పొందే అవకాశాలు ఉన్నాయి. మంత్రియేతర సభ్యులు ప్రవేశపెట్టిన ప్రైవేట్ బిల్లులు ప్రభుత్వ స్టాండ్‌లను ప్రతిబింబించవు, తక్కువ ఆమోదం పొందే అవకాశాలు ఉన్నాయి. తిరస్కరించబడిన ప్రభుత్వంపై ప్రభావం చూపుతుంది. " ,
    ),

    Question(
      questionText: "పార్లమెంటులో సవరణ బిల్లు యొక్క ప్రాథమిక ప్రయోజనం ఏమిటి?",
      options : [
        "కొత్త ప్రతిపాదనలు, ఆలోచనలు లేదా విధానాలను పరిచయం చేస్తున్నాము. ",
        "ఒక నిర్దిష్ట విషయంపై ఇప్పటికే ఉన్న చట్టాలను ఏకీకృతం చేయడం. ",
        "ఇప్పటికే ఉన్న చట్టాలను సవరించడం, సవరించడం లేదా సవరించడం.",
        "గడువు ముగిసిన చట్టాన్ని కొనసాగించడం."
      ],
      correctAnswerIndex : 2,
      explanation : "పార్లమెంటులో సవరణ బిల్లు ప్రస్తుత చట్టాలను సవరించడానికి, సవరించడానికి లేదా సవరించడానికి ప్రయత్నిస్తుంది.",
    ),

    Question(
      questionText: "డ్రాఫ్టింగ్ సమయంలో ఏ రకమైన బిల్లుకు న్యాయ శాఖతో సంప్రదింపులు కావాలా?",
      options : [
        "ముగిస్తున్న చట్టాల (కొనసాగింపు) బిల్లు",
        "ధృవీకరణ బిల్లు",
        "మనీ బిల్లు",
        "ప్రైవేట్ బిల్లు"
      ],
      correctAnswerIndex : 3,
      explanation : "ఒక ప్రైవేట్ బిల్లు ముసాయిదా సమయంలో న్యాయ శాఖతో సంప్రదింపులు అవసరం.",
    ),

    Question(
      questionText: "ప్రైవేట్ బిల్లును రూపొందించడంలో సంబంధిత శాఖ బాధ్యత ఏమిటి?",
      options : [
        "లా డిపార్ట్‌మెంట్‌తో సంప్రదించి బిల్లును రూపొందించడం. ",
        "ఇది ప్రభుత్వ విధానాలను ప్రతిబింబిస్తుందని నిర్ధారించడం. ",
        "పార్లమెంటు ఆమోదం కోరుతున్నాను. ",
        "బిల్లును రాష్ట్రపతికి అందజేస్తున్నాము."
      ],
      correctAnswerIndex : 0,
      explanation : "ప్రైవేట్ బిల్లును రూపొందించడంలో సంబంధిత శాఖ బాధ్యత న్యాయ శాఖతో సంప్రదించి బిల్లును రూపొందించడం.",
    ),

    Question(
      questionText: "ఒక ప్రైవేట్ బిల్లు తిరస్కరణకు గురైతే పార్లమెంటరీ విశ్వాసం మరియు ప్రభుత్వ రాజీనామాపై అంతరార్థం ఏమిటి?",
      options : [
        "పార్లమెంటరీ విశ్వాసం లేదా ప్రభుత్వ రాజీనామాపై ఎటువంటి ప్రభావం లేదు. ",
        "ఇది ప్రభుత్వ రాజీనామాకు దారి తీస్తుంది. ",
        "ఇది పార్లమెంటరీ విశ్వాసం లోపాన్ని ప్రతిబింబిస్తుంది. ",
        "ఇది ప్రభుత్వంపై అవిశ్వాస తీర్మానాన్ని ప్రేరేపిస్తుంది."
      ],
      correctAnswerIndex : 0,
      explanation : "ప్రైవేట్ బిల్లు తిరస్కరణకు పార్లమెంటరీ విశ్వాసం లేదా ప్రభుత్వ రాజీనామాపై ఎలాంటి ప్రభావం ఉండదు.",
    ),
    Question(
      questionText: "యూత్ పార్లమెంట్ పథకం యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
      options : [
        "పార్లమెంటరీ పద్ధతులు మరియు విధానాలకు యువ తరాలను పరిచయం చేయడానికి. ",
        "యువతలో రాజకీయ చర్చలకు వేదికను సృష్టించడం. ",
        "వినోద ప్రయోజనాల కోసం మాక్ పార్లమెంట్ సమావేశాలను నిర్వహించడం. ",
        "రాజకీయ కార్యక్రమాల్లో యువత పాల్గొనేలా ప్రోత్సహించడం."
      ],
      correctAnswerIndex : 0,
      explanation : "యువ తరాలకు పార్లమెంటరీ పద్ధతులు మరియు విధానాలతో పరిచయం చేయడమే యూత్ పార్లమెంట్ పథకం యొక్క ప్రాథమిక లక్ష్యం.",
    ),

    Question(
      questionText: "పార్లమెంటులో తీర్మానాలు మరియు తీర్మానాలు ఎలా ఉంటాయి?",
      options : [
        "తీర్మానాలు ఎల్లప్పుడూ ఓటు వేయబడతాయి, అయితే కదలికలు తప్పనిసరిగా ఓటు వేయబడవు. ",
        "మోషన్‌లను ప్రైవేట్ సభ్యులు మాత్రమే పంపుతారు, అయితే తీర్మానాలు మంత్రులచే పంపబడతాయి. ",
        "తీర్మానాలు ప్రైవేట్, ప్రభుత్వం మరియు చట్టబద్ధమైన కేటగిరీలుగా వర్గీకరించబడ్డాయి, అయితే కదలికలు కాదు. ",
        "అన్ని తీర్మానాలు ముఖ్యమైన కదలికలుగా పరిగణించబడతాయి, అయితే కదలికలు కాదు."
      ],
      correctAnswerIndex : 3,
      explanation : "తీర్మానాలు చలనాల నుండి భిన్నంగా ఉంటాయి, అన్ని తీర్మానాలు ముఖ్యమైన కదలికలుగా మారాలి, కదలికలు తప్పనిసరిగా ఉండాలి. అదనంగా, అన్ని తీర్మానాలపై ఓటు వేయాలి. ",
    ),

    Question(
      questionText: "పార్లమెంటులో ప్రైవేట్ సభ్యుల తీర్మానం మరియు ప్రభుత్వ తీర్మానం మధ్య కీలకమైన తేడా ఏమిటి?",
      options : [
        "ప్రైవేట్ సభ్యుల తీర్మానాలు ప్రత్యామ్నాయ శుక్రవారాల్లో మాత్రమే చర్చించబడతాయి, అయితే ప్రభుత్వ తీర్మానాలు ప్రతిరోజూ చర్చించబడతాయి. ",
        "ప్రభుత్వ తీర్మానాలను మంత్రులు తరలిస్తారు, అయితే ప్రైవేట్ సభ్యుల తీర్మానాలను మంత్రి కాకుండా ఇతర సభ్యుల ద్వారా పంపుతారు. ",
        "ప్రభుత్వ తీర్మానాలు అంతర్జాతీయ ఒప్పందాలు, విధానాలు మరియు కమిటీ సిఫార్సులతో నిర్వహిస్తాయి, అయితే ప్రైవేట్ సభ్యుల తీర్మానాలు మరింత సాధారణమైనవి. ",
        "ప్రైవేట్ సభ్యుల తీర్మానాలకు ఒక నెల నోటీసు అవసరం, ప్రభుత్వ తీర్మానాలకు ఏడు రోజుల నోటీసు మాత్రమే అవసరం."
      ],
      correctAnswerIndex : 1,
      explanation : "ప్రత్యేక సభ్యుని తీర్మానాలను మంత్రి కాకుండా ఇతర సభ్యులచే తరలించబడటం ప్రధాన వ్యత్యాసం, అయితే ప్రభుత్వ తీర్మానాలు మంత్రులచే తరలించబడతాయి.",
    ),

    Question(
        questionText: " రాజ్యంలో 'ప్రత్యేక ప్రస్తావన' కింద ఏ పరిస్థితులలో ఒక పరిశీలన లేవనెత్తవచ్చు సభా ?",
        options : [
          "ప్రశ్న గంట మరియు అరగంట చర్చ సమయంలో. ",
          "ఇది ఆర్డర్ ఆఫ్ ఆర్డర్ అయినప్పుడు. ",
          "వాయిదా తీర్మానం సమయంలో ఇది విధానపరమైన విషయం అయినప్పుడు. ",
          "సభ యొక్క ఏ నియమం కింద దీనిని పెంచలేనప్పుడు."
        ],
        correctAnswerIndex : 3,
      explanation : "రాజ్యంలో 'ప్రత్యేక ప్రస్తావన' కింద ఒక భోజనం లేవనెత్తవచ్చు సభ ఒక పాయింట్ ఆర్డర్ కానప్పుడు, సమయాల్లో లేవనెత్తబడదు మరియు సభ యొక్క ఏ నియమం పరిధిలోకి రానప్పుడు.",
    ),
    Question(
      questionText: "పార్లమెంటులో 'ధన్యవాద తీర్మానం' ఉద్దేశ్యం ఏమిటి?",
      options : [
        "రాష్ట్రపతి ప్రసంగాన్ని విమర్శించడానికి. ",
        "రాష్ట్రపతి ప్రసంగానికి ఆమోదం తెలిపేందుకు. ",
        "రాష్ట్రపతి వివరించిన విధానాలు మరియు కార్యక్రమాలపై చర్చించడానికి మరియు చర్చించడానికి. ",
        "కొత్త చట్టాన్ని ప్రతిపాదించడానికి."
      ],
      correctAnswerIndex : 2,
      explanation : "పార్లమెంట్‌లో 'ధన్యవాద తీర్మానం' అనేది ఉభయ సభలను ఉద్దేశించి ప్రసంగించే సమయంలో రాష్ట్రపతి వివరించిన విధానాలు మరియు కార్యక్రమాలపై చర్చించడం మరియు చర్చించడం.",
    ),

    Question(
      questionText: " లోక్‌లో 'సెన్సర్ మోషన్' మరియు 'అవిశ్వాస తీర్మానం' మధ్య ప్రధాన తేడా ఏమిటి సభా ?",
      options : [
      "ఏ వ్యక్తికి లేదా మంత్రుల బృందానికి వ్యతిరేకంగా ఒక నిందారోపణ మోషన్‌ను తరలించవచ్చు, అయితే అవిశ్వాస తీర్మానం మొత్తం మంత్రుల మండలిపై మాత్రమే తరలించబడుతుంది.",
      "ఒక అభిశంసన తీర్మానం ఆమోదం పొందితేనే మంత్రుల మండలి రాజీనామా చేయవలసి ఉంటుంది, అయితే అవిశ్వాస తీర్మానం ఆమోదించిన తర్వాత మంత్రి మండలి రాజీనామాను తప్పనిసరి చేస్తుంది.",
      "లోక్‌లో ఆమోదించడానికి గల కారణాలను తప్పనిసరిగా ఇవ్వాలి సభ , అవిశ్వాస తీర్మానానికి కారణాలు చెప్పాల్సిన అవసరం లేదు.",
      "లోక్ విశ్వాసాన్ని నిర్ధారించడానికి ఒక నిందారోపణ మోషన్ తరలించబడింది మంత్రి మండలిలో సభ ."
    ],
    correctAnswerIndex : 0,
      explanation:"ముఖ్యమైన తేడా, ఒక వ్యక్తి మంత్రి లేదా మంత్రుల బృందానికి వ్యతిరేకంగా సెన్సర్ మోషన్‌ను తరలించవచ్చు, అయితే అవిశ్వాస తీర్మానం మొత్తం మంత్రుల మండలిపై మాత్రమే తరలించబడుతుంది.",
    ),

    Question(
      questionText: "పార్లమెంట్‌లో 'డిలేటరీ మోషన్' ప్రయోజనం ఏమిటి?",
      options : [
        "బిల్లు, చలనం లేదా తీర్మానాన్ని చర్చించడానికి మరియు చర్చించడానికి. ",
        "సభను తాత్కాలికంగా వాయిదా వేయడానికి. ",
        "సభ ముందు కార్యకలాపాలను నిలిపివేయడానికి. ",
        "పరిశీలనలో ఉన్న వ్యాపారం యొక్క ప్రారంభాన్ని ఆలస్యం చేయడానికి."
      ],
      correctAnswerIndex : 3,
      explanation : "పార్లమెంటులో 'డిలేటరీ మోషన్' ఉద్దేశ్యం సభలో పరిశీలనలో ఉన్న వ్యాపార పురోగతిని ఆలస్యం చేయడమే.",
    ),

    Question(
      questionText: "పార్లమెంట్‌లో 'పాయింట్ ఆఫ్ ఆర్డర్' పాత్ర ఏమిటి?",
      options : [
        "విధానపరమైన విషయాలపై చర్చలు లేవనెత్తడానికి. ",
        "సభ ముందు కార్యకలాపాలను నిలిపివేయడానికి. ",
        "ప్రభుత్వాన్ని నియంత్రించడానికి. ",
        "రాష్ట్రపతి ప్రసంగాన్ని విమర్శించడానికి."
      ],
      correctAnswerIndex : 2,
      explanation:"పార్లమెంటులో 'పాయింట్ ఆఫ్ ఆర్డర్' పాత్ర, హౌస్ లేదా రాజ్యాంగం యొక్క నియమాల explanation లేదా అమలుకు సంబంధించిన ఆందోళనలను లేవనెత్తడం ద్వారా ప్రభుత్వాన్ని నియంత్రించడం.",
    ),
    Question(
      questionText: "పార్లమెంట్‌లో 'సబ్‌స్టాంటివ్ మోషన్' ప్రయోజనం ఏమిటి?",
      options : [
        "సభలో ఒక అంశంపై చర్చను ఆపడానికి. ",
        "సాధారణ ప్రజా ప్రాముఖ్యత గురించి చర్చించడానికి. ",
        "అసలు చలనానికి ప్రత్యామ్నాయాన్ని ప్రతిపాదించడానికి. ",
        "చాలా ముఖ్యమైన విషయం స్వతంత్రంగా వ్యవహరించడానికి."
      ],
      correctAnswerIndex : 3,
      explanation : "పార్లమెంట్‌లో 'సబ్స్టాంటివ్ మోషన్' అనేది రాష్ట్రపతిని అభిశంసించడం లేదా ప్రధాన ఎన్నికల కమిషనర్‌ను తొలగించడం వంటి చాలా ముఖ్యమైన అంశంతో స్వీయ-నియంత్రణ స్వతంత్ర ప్రతిపాదనను నిర్వహిస్తుంది.",
    ),

    Question(
      questionText: "పార్లమెంట్‌లో 'క్లోజర్ మోషన్' ఉద్దేశ్యం ఏమిటి?",
      options : [
        "పరిశీలనలో ఉన్న వ్యాపారం యొక్క ప్రారంభాన్ని ఆలస్యం చేయడానికి. ",
        "సభలో ఒక అంశంపై చర్చను తగ్గించడానికి. ",
        "అసలు చలనానికి ప్రత్యామ్నాయంగా కొత్త చలనాన్ని ప్రవేశపెట్టడానికి. ",
        "చర్చ సమయంలో మరొక చలనాన్ని అధిగమించడానికి."
      ],
      correctAnswerIndex : 1,
      explanation : "సభలో ఒక అంశంపై చర్చను తగ్గించడానికి పార్లమెంటులో ఒక 'క్లోజర్ మోషన్' తరలించబడింది. ఆమోదించబడితే, చర్చ నిలిపివేయబడుతుంది మరియు విషయం ఓటింగ్ ఉంచబడుతుంది. ",
    ),

    Question(
      questionText: "పార్లమెంటులో 'ప్రివిలేజ్ మోషన్' ఎప్పుడు ప్రవేశపెడతారు?",
      options : [
        "ఒక విషయంపై చర్చను తగ్గించడానికి. ",
        "అత్యవసరమైన ప్రజా ప్రాముఖ్యతపై దృష్టిని ఆకర్షించడానికి. ",
        "పార్లమెంటరీ అధికారాలను ఉల్లంఘించినందుకు మంత్రిని నిందించడానికి. ",
        "ఒక మంత్రి అధికారిక ప్రకటన కోరేందుకు."
      ],
      correctAnswerIndex : 2,
      explanation : "వాస్తవాలను దాచిపెట్టడం లేదా తప్పుడు వాటిని అందించడం వంటి పార్లమెంటరీ అధికారాలను ఉల్లంఘించినందుకు మంత్రిని నిందించడానికి పార్లమెంటులో 'ప్రివిలేజ్ మోషన్' ప్రవేశపెట్టబడింది.",
    ),

    Question(
      questionText: "పార్లమెంట్‌లో 'అవిశ్వాస తీర్మానం' ఉద్దేశం ఏమిటి?",
      options : [
        "అత్యవసరమైన ప్రజా ప్రాముఖ్యతపై దృష్టిని ఆకర్షించడానికి. ",
        "చాలా ముఖ్యమైన నియంత్రణ స్వతంత్రంగా ఎదుర్కోవటానికి. ",
        "ఒక మంత్రి నుండి అధికారిక ప్రకటన కోరేందుకు. ",
        "విశ్వాసం లేకపోవడం వల్ల మంత్రిత్వ శాఖను పదవి నుండి తొలగించడం."
      ],
      correctAnswerIndex : 3,
      explanation : "పార్లమెంటులో 'అవిశ్వాస తీర్మానం' ఉద్దేశ్యం మంత్రుల మండలిపై విశ్వాసం లేకపోవడాన్ని వ్యక్తం చేయడం, మంత్రిత్వ శాఖను పదవి నుండి తొలగించే అవకాశం ఉంది.",
    ),
    Question(
      questionText: "పార్లమెంటరీ కార్యక్రమాలలో 'జీరో అవర్' యొక్క ముఖ్య ఉద్దేశ్యం ఏమిటి?",
      options : [
        "మంత్రులను మౌనిక ప్రశ్నలు అడగడానికి. ",
        "అత్యవసర ప్రజా ప్రాముఖ్యత కలిగిన వివిధ విషయాలను లేవనెత్తడానికి. ",
        "ప్రాథమిక కదలికలను చర్చించడానికి. ",
        "ప్రశ్నలకు వ్రాతపూర్వక సమాధానాలను వెతకడానికి."
      ],
      correctAnswerIndex : 1,
      explanation : "పార్లమెంటరీ కార్యక్రమాలలో 'జీరో అవర్' అనేది అత్యవసర ప్రజా ప్రాముఖ్యత కలిగిన వివిధ విషయాలను లేవనెత్తడానికి సభ్యులకు అనధికారిక సమయ స్లాట్.",
    ),

    Question(
      questionText: " ప్రశ్న సమయంలో 'నక్షత్రం లేని ప్రశ్న' నుండి 'నక్షత్రం ఉన్న ప్రశ్న'కి తేడా ఏమిటి ?",
      options : [
        "నక్షత్రం ఉన్న ప్రశ్నలకు వ్రాతపూర్వక సమాధానం అవసరం, అయితే నక్షత్రం లేని ప్రశ్నలకు మౌనిక సమాధానం అవసరం. ",
        "నక్షత్రం ఉన్న ప్రశ్నలకు మౌనిక సమాధానం అవసరం, అయితే నక్షత్రం లేని ప్రశ్నలకు వ్రాతపూర్వక సమాధానం అవసరం. ",
        "నక్షత్రం ఉన్న ప్రశ్నలు అనుబంధ ప్రశ్నలను అనుమతిస్తాయి, అయితే నక్షత్రం లేని ప్రశ్నలు అనుబంధ ప్రశ్నలను అనుమతిస్తాయి. ",
        "నక్షత్రం ఉన్న ప్రశ్నలు ఆకుపచ్చ రంగులో ముద్రించబడతాయి, అయితే నక్షత్రం లేని ప్రశ్నలు తెలుపులో ముద్రించబడతాయి."
      ],
      correctAnswerIndex : 2,
      explanation:"ప్రశ్న సమయంలో, 'నక్షత్రం గుర్తు ఉన్న ప్రశ్న'కు మౌనిక సమాధానం మరియు అనుబంధ ప్రశ్నలను అనుమతించాలి, అయితే ' నక్షత్రం లేని ప్రశ్న'కి వ్రాతపూర్వక సమాధానం అవసరం మరియు అనుబంధ ప్రశ్నలకు అనుమతి ఉంది.",
    ),

    Question(
      questionText: "ఇతర రకాల ప్రశ్నల నుండి 'షార్ట్ నోటీసు ప్రశ్న' ఎలా ఉంటుంది?",
      options : [
        "దీనికి అనుబంధ ప్రశ్న అవసరం. ",
        "దీనికి వ్రాతపూర్వక సమాధానం అవసరం. ",
        "పది రోజుల సాధారణ నోటీసు ఇవ్వకుండా ఇది అడిగారు. ",
        "ఇది మంత్రులకు మాత్రమే ఉద్దేశించబడింది."
      ],
      correctAnswerIndex : 2,
      explanation : "ఒక 'షార్ట్ నోటీసు ప్రశ్న' అనేది పది రోజుల సాధారణ నోటీసు ఇవ్వకుండా అడిగేది. దానికి మౌనంగా సమాధానం ఇవ్వబడుతుంది. ",
    ),

    Question(
      questionText: "ప్రశ్న సమయంలో ప్రైవేట్ సభ్యులకు సంధించిన ప్రశ్నల జాబితాను ఏ రంగు వేరు చేస్తుంది?",
      options : [
        "ఆకుపచ్చ",
        "తెలుపు",
        "లేత గులాబీ",
        "పసుపు"
      ],
      correctAnswerIndex : 3,
      explanation : "ప్రశ్న సమయంలో ప్రైవేట్ సభ్యులకు సంధించిన ప్రశ్నల జాబితా ఇతర రకాల ప్రశ్నల నుండి పసుపు రంగులో ముద్రించబడింది.",
    ),
    Question(
      questionText: "సాధారణ మెజారిటీ అంటే ఏమిటి మరియు పార్లమెంటులో ఏ సందర్భాలలో అది కావాలా?",
      options : [
        "ఇది రాజ్యాంగ సవరణలకు అవసరమైన సభ మొత్తం సభ్యత్వంలో మెజారిటీ. ",
        "ఇది మెజారిటీ సభ్యులు హాజరు మరియు ఓటు వేయడం, బిల్లులు మరియు మోషన్లను ఆమోదించడం వంటి వివిధ విషయాల కోసం అవసరం. ",
        "ఇది ఉపాధ్యక్షుని తొలగింపునకు అవసరమైన ఖాళీ స్థానాలను మినహాయించి మెజారిటీ. ",
        "ఇది రాష్ట్రపతి అభిశంసనకు అవసరమైన మెజారిటీ."
      ],
      correctAnswerIndex : 1,
      explanation:"సాధారణ మెజారిటీ అనేది పార్లమెంటులో విశ్వాసం మరియు నిందారోపణలకు సంబంధించిన బిల్లులు, తీర్మానాలు మరియు కొన్ని తీర్మానాలను ఆమోదించడం వంటి వివిధ విషయాల కోసం సభకు హాజరైన మరియు ఓటు వేస్తున్న సభ్యులలో మెజారిటీ.",
    ),

    Question(
        questionText: "ఎఫెక్టివ్ మెజారిటీ అంటే ఏమిటి మరియు ఏ సందర్భాలలో ఇది అవసరం?",
        options : [
          "ఇది రాజ్యాంగ సవరణలకు అవసరమైన సభ మొత్తం సభ్యత్వంలో మెజారిటీ. ",
          "ఇది మెజారిటీ సభ్యులు హాజరైన మరియు ఓటింగ్ చేస్తున్నారు, ఉపాధ్యక్షుడిని తొలగించడానికి ఇది అవసరం. ",
          "ఇది రాష్ట్రపతి అభిశంసనకు అవసరమైన సభ మొత్తం సభ్యత్వంలో మెజారిటీ. ",
          "ఇది ఉపాధ్యక్షుని తొలగింపునకు అవసరమైన ఖాళీ స్థానాలను మినహాయించి మెజారిటీ."
        ],
        correctAnswerIndex : 1,
        explanation : "ఎఫెక్టివ్ మెజారిటీ అంటే ఖాళీగా ఉన్న సీట్లను మినహాయించి సభ మొత్తం ఉపరాష్ట్రంలో మెజారిటీ. డిప్యూటీ ఛైర్మన్, స్పీకర్ మరియు డిప్యూటీ స్పీకర్ వంటి తొలగింపు సందర్భాలలో ఇది అవసరం."
    ),

    Question(
      questionText: "సంపూర్ణ మెజారిటీ అంటే ఏమిటి మరియు ఏ సందర్భాలలో ఇది అవసరం?",
      options : [
        "ఇది రాజ్యాంగ సవరణలకు అవసరమైన మెజారిటీ సభ్యులు హాజరుకావడం మరియు ఓటింగ్ చేయడం. ",
        "ఇది ఉపాధ్యక్షుని తొలగింపునకు అవసరమైన ఖాళీ స్థానాలను మినహాయించి మెజారిటీ. ",
        "ఇది రాజ్యాంగ సవరణలకు అవసరమైన సభ మొత్తం సభ్యత్వంలో మెజారిటీ. ",
        "ఇది రాష్ట్రపతి అభిశంసనకు అవసరమైన మెజారిటీ."
      ],
      correctAnswerIndex : 2,
      explanation : "సంపూర్ణ మెజారిటీ అంటే, ఖాళీగా ఉన్న సీట్లు లేదా హాజరుకాని వారితో సంబంధం లేకుండా, సభ మొత్తం సభ్యత్వంలో మెజారిటీ. ఇది స్వతంత్ర అవసరంగా సూచించబడదు కానీ ప్రత్యేక మెజారిటీలో భాగంగా కొన్ని సందర్భాల్లో ఇది అవసరం. ",
    ),

    Question(
      questionText: "ప్రత్యేక మెజారిటీ-I అంటే ఏమిటి మరియు ఏ సందర్భాలలో ఇది అవసరం?",
      options : [
        "రాజ్యాంగ సవరణలకు అవసరమైన మెజారిటీ సభ్యులు హాజరై మరియు ఓటింగ్ చేస్తున్నారు. ",
        "రాజ్యాంగాన్ని తొలగించడం మరియు న్యాయమూర్తులను తొలగించడం వంటి నిర్దిష్ట కేసుల కోసం ప్రతి హౌస్‌లోని మొత్తం మెజారిటీలో హాజరైన మరియు ఓటు వేయడానికి మూడింట రెండు వంతుల మెజారిటీ అవసరం. ",
        "ప్రతి సభ మొత్తం సభ్యత్వంలో మూడింట రెండు వంతుల మెజారిటీ, రాష్ట్రపతి అభిశంసకు అవసరం. ",
        "సభ్యులలో మూడింట రెండు వంతుల మెజారిటీ హాజరైన మరియు ఓటు వేస్తోంది ( రాజ్యంలో సభ ), ఆల్-ఇండియా సర్వీసెస్ మరియు నేషనల్ ఎమర్జెన్సీకి సంబంధించిన విషయాల కోసం అవసరం."
      ],
      correctAnswerIndex : 1,
      explanation : "ప్రత్యేక మెజారిటీ-I అనేది ప్రతి సభలోని మొత్తం సభ్యత్వంలో మెజారిటీ మరియు మూడింట రెండు వంతుల మెజారిటీ సభ్యులు హాజరు మరియు ఓటింగ్ చేస్తున్నారు. రాజ్యాంగాన్ని సవరించడం, న్యాయమూర్తులను తొలగించడం మరియు ఇతర ముఖ్యమైన విషయాల వంటి కేసులకు ఇది అవసరం. " ,
    ),
    Question(
      questionText: "ఉభయ సభలు లేదా ఉభయ సభల సంయుక్త సమావేశంలో విషయాలు ఎలా నిర్ణయించబడతాయి?",
      options : [
        "ప్రిసైడింగ్ అధికారి నిర్ణయం ద్వారా",
        "హాజరైన మరియు ఓటింగ్ చేస్తున్న సభ్యుల సాధారణ మెజారిటీ ఓట్ల ద్వారా",
        "ప్రిసైడింగ్ అధికారి కాస్టింగ్ ఓటు ద్వారా",
        "సభ్యులందరి ఏకగ్రీవ ఒప్పందం ద్వారా"
      ],
      correctAnswerIndex : 1,
      explanation : "ఏదైనా సభ లేదా ఉభయ సభల సంయుక్త సమావేశంలో అన్ని ప్రిసైడింగ్ అధికారిని మినహాయించి హాజరైన మరియు ఓటు వేసే సభ్యుల మెజారిటీ ఓట్ల ద్వారా నిర్ణయించబడుతుంది.",
    ),

    Question(
      questionText: "సభ ప్రిసైడింగ్ అధికారి ఎప్పుడు ఓటు వేస్తారు?",
      options : [
        "ప్రతి సందర్భంలో",
        "టై లేదా ఓట్ల సమానత్వం విషయంలో",
        "నిర్దిష్ట అభ్యర్థన ఉన్నప్పుడు మాత్రమే",
        "ప్రతి సెషన్ ప్రారంభంలో"
      ],
      correctAnswerIndex : 1,
      explanation:"టై లేదా ఓట్ల సమానత్వం విషయంలో సభ ప్రిసైడింగ్ అధికారి కాస్టింగ్ ఓటును వినియోగించుకుంటారు.",
    ),

    Question(
      questionText: " లోక్‌లో ఓటు వేయడానికి వివిధ పద్ధతులు ఏమిటి సభా ?",
      options : [
        "వాయిస్ ఓటు, విభజన మరియు రహస్య బ్యాలెట్",
        "వాయిస్ ఓటు మరియు కాస్టింగ్ ఓటు",
        "డివిజన్ మరియు ఫిజికల్ కౌంట్",
        "రహస్య బ్యాలెట్ మరియు స్లిప్పుల పంపిణీ ద్వారా ఓట్ల నమోదు"
      ],
      correctAnswerIndex : 0,
      explanation : " లోక్‌లో ఓటు వేయడానికి అనుసరించిన వివిధ పద్ధతులు సభలో వాయిస్ ఓటు, విభజన (వివిధ శిక్షణ ద్వారా) మరియు రహస్య బ్యాలెట్ ఉన్నాయి.",
    ),

    Question(
      questionText: "పార్లమెంటులో లావాదేవీలు జరపడానికి ఏ భాషలు ప్రకటించబడ్డాయి?",
      options : ["హిందీ మరియు ఇంగ్లీష్", "ఇంగ్లీష్ మరియు ప్రాంతీయ భాషలు", "సంస్కృతం మరియు హిందీ", "ఇంగ్లీష్ మరియు సంస్కృతం"],
      correctAnswerIndex : 0,
      explanation : "వ్యాపార లావాదేవీలకు హిందీ మరియు ఇంగ్లీషు భాషలుగా రాజ్యాంగం ప్రకటించబడింది.",
    ),

    Question(
        questionText: "పార్లమెంట్ సందర్భంలో 'కుంటి-బాతు సెషన్' సమయంలో ఏమి జరుగుతుంది?",
        options : [
          "ఇది ముఖ్యమైన శాసన కార్యకలాపాలు లేని సెషన్ను సూచిస్తుంది. ",
          "ఇది తిరిగి ఎన్నికైన సభ్యులు మాత్రమే పాల్గొనే సెషన్. ",
          "ఇది మునుపటి లోక్‌లో చివరి సెషన్ కొత్త లోక్ తర్వాత సభ సభ ఎన్నికైంది. ",
          "ఇది పర్యావరణ సమస్యలకు అంకితమైన సెషన్."
        ],
        correctAnswerIndex : 2,
      explanation :  "లోక్ యొక్క చివరి సెషన్‌ను సూచిస్తుంది కొత్త లోక్ తర్వాత సభ కొత్త లోక్‌కు తిరిగి ఎన్నిక కాలేకపోయిన సభ్యులతో కూడిన సభ జరిగింది సభ .",
    ),
    Question(
        questionText: " లోక్‌లో 'సభ నాయకుడు'గా ఎవరు పరిగణించబడతారు సభా ?",
        options : [
        "భారత రాష్ట్రపతి",
        "లోక్ సభ్యుడైతే సభ , లేదా నామినేటెడ్ మంత్రి",
    "లోక్ స్పీకర్ సభ ",
    "ప్రతిపక్ష నాయకుడు"
    ],
    correctAnswerIndex : 1,
      explanation : "లోక్ నిబంధనల ప్రకారం సభ , 'సభా నాయకుడు' అంటే ప్రధానమంత్రి, అతను/ఆమె లోక్ సభ్యురాలు అయితే సభ , లేదా ప్రధానమంత్రి నామినేట్ చేసిన మంత్రి.",
    ),

    Question(
      questionText: "పార్లమెంటులో 'ప్రతిపక్ష నాయకుడు' ఏ విధులు నిర్వహిస్తున్నారు?",
      options : [
        "ప్రభుత్వ విధానాలపై నిర్మాణాత్మక విమర్శలను అందించడానికి మరియు ప్రత్యామ్నాయ ప్రభుత్వాన్ని అందించడానికి",
        "సభలో అధికార పార్టీని నడిపించడానికి",
        "శాసన ప్రక్రియను పర్యవేక్షించడానికి",
        "రాష్ట్రపతి అభిప్రాయాలను సూచించడానికి"
      ],
      correctAnswerIndex : 0,
      explanation : "ప్రభుత్వ విధానాలపై నిర్మాణాత్మక విమర్శలను అందించడం మరియు ప్రత్యామ్నాయ ప్రభుత్వాన్ని అందించడం 'ప్రతిపక్ష నేత' యొక్క ప్రధాన విధులు.",
    ),

    Question(
      questionText: "పార్లమెంటులో 'విప్' పాత్ర ఏమిటి?",
      options : [
        "పార్లమెంటులో పార్టీ సభ్యుల ప్రవర్తన, నియంత్రించడానికి మరియు పర్యవేక్షించడానికి"
            "పార్లమెంటరీ చర్చలకు నాయకత్వం వహించడానికి",
        "శాసనపరమైన విషయాలపై నిర్ణయాలు తీసుకోవడానికి",
        "స్పీకర్ లేనప్పుడు ప్రిసైడింగ్ అధికారిగా వ్యవహరించడం"
      ],
      correctAnswerIndex : 0,
      explanation:"పార్లమెంటులో పార్టీ సభ్యుల ప్రవర్తనను నియంత్రించడం మరియు పర్యవేక్షించడం, వారి హాజరును నిర్ధారించడం మరియు నిర్దిష్ట సమస్యలకు లేదా వ్యతిరేకంగా మద్దతు పొందడం కోసం 'విప్' బాధ్యత వహిస్తుంది.",
    ),

    Question(
      questionText: "పార్లమెంట్‌లో వాయిదా వేయడం మరియు వాయిదా వేయడం మధ్య తేడా ఏమిటి?",
      options : [
        "నిర్దిష్ట సమయం వరకు వాయిదా పనిని నిలిపివేస్తుంది; వాయిదా వేయడం వలన నిరవధిక వ్యవధి వరకు సిట్టింగ్‌ను ముగించారు. ",
        "రెండు పదాలు ఒకే చర్యను సూచిస్తాయి. ",
        "వాయిదా సెషన్‌ను ముగిస్తుంది, అయితే వాయిదా వేయడం సిట్టింగ్‌ను ముగించింది. ",
        "వాయిదా వేయడం ప్రిసైడింగ్ అధికారిచే చేయబడుతుంది, అయితే వాయిదాను రాష్ట్రపతి చేస్తారు."
      ],
      correctAnswerIndex : 0,
      explanation : "నిర్దిష్ట సమయం వరకు వాయిదా పనిని నిలిపివేస్తుంది, అయితే వాయిదా వేయడం వలన నిరవధిక కాలానికి సిట్టింగ్‌ను రద్దు చేస్తారు. అధికార సభ ప్రిసైడింగ్ అధికారికి ఉంటుంది. ",
    ),

    Question(
      questionText: " లోక్ రద్దు ఎప్పుడు సభ జరుగుతుందా?",
      options : [
        "ఐదేళ్ల తర్వాత స్వయంచాలకంగా",
        "సభను రద్దు చేయాలని రాష్ట్రపతి నిర్ణయించినప్పుడల్లా",
        "ప్రధానమంత్రి సిఫార్సు చేసినప్పుడు",
        "సెషన్ తర్వాత"
      ],
      correctAnswerIndex : 1,
      explanation : " లోక్ రద్దు ఐదేళ్ల తర్వాత లేదా రాష్ట్రపతి సభను రద్దు చేయాలని నిర్ణయించినప్పుడు సభ స్వయంచాలకంగా విద్యుత్.",
    ),

    Question(
      questionText: " లోక్‌లో ఉండడానికి అవసరమైన కనీస సభ్యుల సంఖ్య ఎంత వ్యాపారం నిర్వహించడం కోసం సభ ?",
      options:["10 మంది సభ్యులు", "25 మంది సభ్యులు", "55 మంది సభ్యులు", "75 మంది సభ్యులు"],
      correctAnswerIndex : 2,
      explanation : "కోరం, లోక్‌లో వ్యాపారం చేయడానికి అవసరమైన కనీస సభ్యుల సంఖ్య సభ , మొత్తం సభ్యుల సంఖ్యలో పదో వంతు, ఇది 55 మంది సభ్యులు.",
    ),
    Question(
      questionText: " లోక్ డిప్యూటీ స్పీకర్ పదవికి పదవీకాలం ఎంత సభా ?",
      options : [
      "జీవితకాలం",
      "5 సంవత్సరాల స్థిర పదం",
      "లోక్‌గా ఉన్న సమయంలో స్పీకర్‌లాగే సభ ",
    "రాష్ట్రపతిచే నియమించబడినది"
    ],
    correctAnswerIndex : 2,
      explanation : "స్పీకర్ లాగా, సాధారణంగా డిప్యూటీ స్పీకర్ లోక్ జీవితకాలంలో పదవిలో ఉంటారు సభ .",
    ),

    Question(
      questionText: " ఏ పరిస్థితులలో డిప్యూటీ స్పీకర్ కార్యాలయాన్ని ఖాళీ చేయవచ్చా?",
      options : [
      "అతను/ఆమె ప్రధానికి లేఖ రాసి రాజీనామా చేస్తే",
     "లోక్ సభ్యులందరి మెజారిటీ ఆమోదించిన తీర్మానం ద్వారా తొలగించబడితే సభ ",
    "కేబినెట్‌లో మంత్రిగా నియమితులైతే",
   " డిప్యూటీ స్పీకర్‌ను మార్చాలని ప్రధాని నిర్ణయించుకుంటే"
    ],
    correctAnswerIndex : 1,
    explanation : "అప్పటి లోక్ సభ్యులలో మెజారిటీ సభ్యులు ఆమోదించిన తీర్మానం ద్వారా తొలగించబడినట్లయితే డిప్యూటీ స్పీకర్ పదవిని ఖాళీ చేయవచ్చు సభ .",
    ),

    Question(
      questionText: "పార్లమెంటరీ కమిటీలో సభ్యునిగా నియమించబడినప్పుడు డిప్యూటీ స్పీకర్‌కు ఏ ప్రత్యేక హక్కు ఉంటుంది?",
      options : [
        "స్పీకర్ పదవికి స్వయంచాలక పదోన్నతి",
        "కమిటీకి స్వయంచాలక అధ్యక్షత",
        "అధిక వేతనానికి అర్హత",
        "కమిటీ నిర్ణయాలలో రెండు ఓట్లు వేయగల సామర్థ్యం"
      ],
      correctAnswerIndex : 1,
      explanation : "డిప్యూటీ స్పీకర్, పార్లమెంటరీ కమిటీలో సభ్యులుగా నియమితులైనప్పుడు, స్వయంచాలకంగా దాని ఛైర్మన్ అవుతారు.",
    ),

    Question(
      questionText: "స్పీకర్ మరియు డిప్యూటీ స్పీకర్ ఇద్దరూ గైర్హాజరైనప్పుడు స్పీకర్ బాధ్యతలను ఎవరు స్వీకరిస్తారు?",
      options : [
      "చీఫ్ విప్",
      "ప్రధాన మంత్రి",
      "భారత రాష్ట్రపతి",
      "లోక్‌లో అత్యంత సీనియర్ సభ్యుడు సభ "
    ],
    correctAnswerIndex : 3,
    explanation : "స్పీకర్ మరియు డిప్యూటీ స్పీకర్ ఇద్దరూ గైర్హాజరైనప్పుడు, స్పీకర్ను అటువంటి లోక్ సభ్యుడు నియమించారు . రాష్ట్రపతిగా సభను దీని కోసం నియమించవచ్చు.",
    ),

    Question(
        questionText: "కొత్తగా ఎన్నికైన లోక్‌కి కొద్ది రోజుల ముందు ఉన్న తాత్కాలిక కార్యాలయాన్ని ఏమంటారు? సభ కొత్త స్పీకర్‌ను ఎన్నుకుంటుందా?",
        options : [
          "యాక్టింగ్ స్పీకర్",
          "తాత్కాలిక స్పీకర్",
          "స్పీకర్ ప్రో టెం",
          "తాత్కాలిక స్పీకర్"
        ],
        correctAnswerIndex : 2,
        explanation:"కొత్తగా ఎన్నికైన లోక్‌కి కొద్ది రోజుల ముందు ఉన్న తాత్కాలిక కార్యాలయం కొత్త స్పీకర్‌ను ఎన్నుకునే సభను 'స్పీకర్ ప్రో టెం' అంటారు."
    ),

    Question(
      questionText: " రాజ్య ఎక్స్ అఫీషియో ఛైర్మన్ ఎవరు సభా ?",
      options : [
      "భారత రాష్ట్రపతి",
      "ప్రధాన మంత్రి",
      "భారత ఉపాధ్యక్షుడు",
     " లోక్ స్పీకర్ సభ "
    ],
    correctAnswerIndex : 2,
    explanation : "భారత ఉపరాష్ట్రపతి రాజ్యానికి ఎక్స్ అఫీషియో ఛైర్మన్ సభ .",
    ),

    Question(
      questionText: " రాజ్యసభ ఛైర్మన్‌కు స్పీకర్‌కు ఎలాంటి అధికారాలు ఉన్నాయి సభ జరగదా?",
      options : [
        "బిల్లు డబ్బు బిల్లు కాదా అని నిర్ణయించడం",
        "పార్లమెంటు రెండు సభల సంయుక్త సమావేశానికి అధ్యక్షత వహించడం",
        "మొదటి సందర్భంలో ఓటింగ్",
        "ఛైర్‌పర్సన్‌ల కమిటీ సభ్యులను నియమించడం"
      ],
      correctAnswerIndex : 0,
      explanation : "ఒక బిల్లు ద్రవ్య బిల్లు కాదా అని స్పీకర్ నిర్ణయిస్తారు మరియు ఈ నిర్ణయం అంతిమమైనది. అదనంగా, పార్లమెంటు ఉభయ సభల ఉమ్మడి సమావేశానికి స్పీకర్ అధ్యక్షత వహిస్తారు. ",
    ),

    Question(
      questionText: "డిప్యూటీ ఛైర్మన్‌ను తొలగించే తీర్మానాన్ని పరిశీలించినప్పుడు వారి పాత్రకు ఏమి జరుగుతుంది?",
      options : [
        "వారు సభకు అధ్యక్షత వహిస్తున్నారు",
        "అధ్యక్షుడు లేనప్పుడు మాత్రమే వారు అధ్యక్షత వహిస్తారు",
        "వారు సభ సమావేశానికి అధ్యక్షత వహించలేరు",
        "స్వయంచాలకంగా యాక్టింగ్ చైర్మన్ అవుతారు"
      ],
      correctAnswerIndex : 2,
      explanation : "డిప్యూటీ ఛైర్మన్ తొలగింపు తీర్మానం పరిశీలనలో ఉన్నప్పుడు, వారు హాజరైనప్పటికీ సమావేశానికి అధ్యక్షత వహించలేరు.",
    ),

    Question(
      questionText: " లోక్‌లో చైర్మన్‌ల ప్యానెల్‌ను ఎవరు నామినేట్ చేస్తారు సభా ?",
      options : [
        "ప్రధాన మంత్రి",
        "స్పీకర్",
        "రాష్ట్రపతి",
        "డిప్యూటీ స్పీకర్"
      ],
      correctAnswerIndex : 1,
      explanation : " లోక్ నిబంధనల ప్రకారం సభ , ఛైర్‌పర్సన్‌ల ప్యానెల్‌ను స్పీకర్ నామినేట్ చేస్తారు.",
    ),

    Question(
      questionText: " రాజ్య ఛైర్మన్ పాత్ర ఏమిటి ఉపరాష్ట్రపతి అధ్యక్షుడిగా ఉన్నప్పుడు సభ ?",
      options : [
    "రాజ్య అధ్యక్షుడిగా కొనసాగుతున్నారు సభ ",
    "ఆచార విధులను మాత్రమే నిర్వహిస్తుంది",
      "వైస్ ప్రెసిడెంట్ యొక్క విధులను నిర్వహిస్తుంది",
      "తాత్కాలికంగా కార్యాలయాన్ని ఖాళీ చేయండి"
      ],
      correctAnswerIndex : 0,
      explanation:" ఏ కాలంలోనైనా ఉపరాష్ట్రపతి రాష్ట్రపతిగా, రాజ్యసభ ఛైర్మన్‌గా వ్యవహరించారు సభ ఛైర్మన్ కార్యాలయ విధులను నిర్వహించడం మరియు రాజ్యసభ అధ్యక్షుడిగా కొనసాగుతుంది సభ .",
    ),
    Question(
      questionText: " లోక్ స్పీకర్ కార్యాలయం యొక్క స్వతంత్రత మరియు నిష్పాక్షికతను ఏ నిబంధన నిర్ధారిస్తుంది సభా ?",
      options : [
      "మొదటి సందర్భంలో ఓటు వేయగల స్పీకర్ సామర్థ్యం. ",
     " లోక్‌లో స్పీకర్ పని తీరుపై చర్చ మరియు విమర్శలు సభ .",
    "ప్రాధాన్యత స్పీకర్ యొక్క ఉన్నత స్థానం. ",
    "సమర్థవంతమైన మెజారిటీతో స్పీకర్ పదవీకాలం మరియు తొలగింపు యొక్క భద్రత."
    ],
    correctAnswerIndex : 3,
    explanation : "స్పీకర్ కార్యాలయం యొక్క స్వతంత్రత మరియు నిష్పాక్షికత పదవీకాల భద్రత మరియు లోక్‌లో ప్రభావవంతమైన మెజారిటీతో తొలగించాల్సిన అవసరం ఉంది . సభ .",
    ),
    Question(
      questionText: "రాజ్యాంగం ప్రకారం, పార్లమెంటు సభ్యునిగా ఎంపిక కావడానికి ఒక వ్యక్తికి అర్హత ఏమిటి?",
      options : [
        "భారత పౌరసత్వం, వయస్సు 25 సంవత్సరాల కంటే తక్కువ కాదు మరియు పార్లమెంటరీ నియోజకవర్గానికి ఓటర్లుగా నమోదు. ",
        "భారత పౌరసత్వం, వయస్సు 30 సంవత్సరాల కంటే తక్కువ కాదు, మరియు పార్లమెంటరీ నియోజకవర్గానికి ఓటర్లుగా నమోదు. ",
        "భారత పౌరసత్వం, వయస్సు 25 సంవత్సరాల కంటే తక్కువ కాదు మరియు షెడ్యూల్డ్ కులం లేదా తెగ సభ్యత్వం. ",
        "భారత పౌరసత్వం, వయస్సు 30 సంవత్సరాల కంటే తక్కువ కాదు మరియు పార్లమెంటు సూచించిన ఇతర అర్హతలను కలిగి ఉండాలి."
      ],
      correctAnswerIndex : 3,
      explanation:"రాజ్యాంగం భారత పౌరసత్వం, 30 సంవత్సరాల కంటే తక్కువ వయస్సు లేని వ్యక్తి మరియు పార్లమెంటు సభ్యునిగా ఎంపిక కావడానికి పార్లమెంటు సూచించిన ఇతర అర్హతలను కలిగి ఉండాలి.",
    ),

    Question(
      questionText: "ఒక వ్యక్తి పార్లమెంటు సభ్యునిగా ఎన్నిక కావడానికి ప్రజాప్రాతినిధ్య చట్టం (1951) ద్వారా నిర్దేశించబడిన అదనపు అనర్హతలు ఏమిటి?",
      options : [
        "ఎన్నికల నేరాలకు పాల్పడినట్లు తేలింది, ఏదైనా నేరానికి పాల్పడినందుకు ఒక సంవత్సరం పాటు జైలుశిక్ష మరియు అవినీతికి పాల్పడిన ప్రభుత్వ ఉద్యోగం నుండి తొలగించబడుతుంది. ",
        "ఏదైనా నేరాలకు పాల్పడినట్లు కనుగొనబడింది, ఏదైనా నేరానికి రెండు లేదా అంతకంటే ఎక్కువ సంవత్సరాలు జైలు శిక్ష విధించబడుతుంది మరియు అవినీతి కారణంగా ప్రభుత్వ సేవ తొలగించబడుతుంది.",
        "వివిధ సమూహాల మధ్య శత్రుత్వాన్ని ప్రోత్సహించినందుకు దోషిగా నిర్ధారించబడింది, సామాజిక నేరాలు మరియు ఆచరించిన శిక్షలు మరియు అవినీతికి బోధించిన ప్రభుత్వ సేవ నుండి తొలగించబడింది.",
        "వివిధ సమూహాల మధ్య శత్రుత్వాన్ని ప్రోత్సహించడం, ఎన్నికల ఖర్చులలో విజయం సాధించడం మరియు ప్రభుత్వ కాంట్రాక్టులపై ఆసక్తి చూపినందుకు దోషిగా నిర్ధారించబడింది."
      ],
      correctAnswerIndex : 1,
      explanation:"ప్రజా ప్రాతినిధ్య చట్టం (1951) ఎన్నికల నేరాలకు పాల్పడినట్లు నిర్ధారించడం, రెండు లేదా అంతకంటే ఎక్కువ సంవత్సరాలు జైలు శిక్ష విధించడం మరియు అవినీతికి పాల్పడినందుకు ప్రభుత్వ ఉద్యోగం నుండి తొలగించడం అనర్హతలను జతచేస్తుంది.",
    ),

    Question(
        questionText: "పదో షెడ్యూల్ సందర్భంలో, ఫిరాయింపు చట్టం ప్రకారం సభ్యుడు ఎప్పుడు అనర్హతకు వస్తాడు?",
        options : [
          "సభ్యుడు ఏదైనా రాజకీయ పార్టీ సభ్యత్వాన్ని స్వచ్ఛందంగా వదులుకుంటే. ",
          "సభ్యుడు పార్టీ నిర్దేశానికి వ్యతిరేకంగా సభలో ఓటు వేసినా లేదా ఓటింగ్‌కు దూరంగా ఉంటే. ",
          "స్వతంత్రంగా ఎన్నికైన సభ్యుడు ఏదైనా రాజకీయ పార్టీలో చేరితే. ",
          "ఏదైనా నామినేటెడ్ సభ్యుడు ఆరు నెలలలోపు ఏదైనా రాజకీయ పార్టీలో చేరితే."
        ],
        correctAnswerIndex : 1,
        explanation : "ఒక సభ్యుడు రాజకీయ పార్టీ సభ్యత్వాన్ని స్వచ్ఛందంగా వదులుకున్నా, పార్టీ దిశకు వ్యతిరేకంగా ఓటు వేసిన మరో పార్టీలో చేరినా, లేదా నామినేటెడ్ సభ్యుడు ఆరు నెలల తర్వాత ఏదైనా రాజకీయ పార్టీలో చేరినా పదవ షెడ్యూల్ (ఫిరాయింపు చట్టం) ప్రకారం అనర్హత వేటు పడుతుంది."
    ),
    Question(
      questionText: " రాజ్యం యొక్క బలం ఏమిటి సభ , మరియు అది ఎలా కూర్చబడింది?",
      options : [
        "గరిష్ట బలం: 238 రాష్ట్రాలు మరియు కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు పరోక్షంగా ఎన్నికయ్యారు; కూర్పు: 225 రాష్ట్ర ప్రతినిధులు, 8 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 12 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది. ",
        "గరిష్ట బలం: 250 ప్రతినిధులు; కూర్పు: 225 రాష్ట్ర ప్రతినిధులు, 8 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 12 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది. ",
        "గరిష్ట బలం: 245 ప్రతినిధులు; కూర్పు: 225 రాష్ట్ర ప్రతినిధులు, 10 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 10 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది. ",
        "గరిష్ట బలం: 250 ప్రతినిధులు; కూర్పు: 230 రాష్ట్ర ప్రతినిధులు, 8 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 12 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది."
      ],
      correctAnswerIndex : 1,
      explanation : " రాజ్యం సభలో 250 మంది ప్రతినిధులను కలిగి ఉన్నారు, 28 మంది రాష్ట్రాలు మరియు కేంద్రపాలిత ప్రాంతాల నుండి పరోక్షంగా ఎన్నికయ్యారు మరియు 12 మంది రాష్ట్రపతిచే నామినేట్ చేయబడతారు. ప్రస్తుత కూర్పులో 225 మంది రాష్ట్ర ప్రతినిధులు, 8 మంది కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 12 మంది నామినేటెడ్ సభ్యులు ఉన్నారు. ",
    ),

    Question(
      questionText: " రాజ్యంలో రాష్ట్ర ప్రతినిధులు ఎలా ఉన్నారు సభ ఎన్నికైంది మరియు రాష్ట్రాలకు ఏ ప్రాతిపదికన సీట్లు కేటాయించబడతాయి?",
      options : [
        "ప్రజలచే నేరుగా ఎన్నుకోబడినవి; కేంద్రపాలిత ప్రాంతాల సంఖ్య ఆధారంగా సీట్లు కేటాయించబడతాయి. ",
        "రాష్ట్ర శాసనసభల సభ్యులచే పరోక్షంగా ఎన్నుకోబడతారు; జనాభా ఆధారంగా కేటాయించబడిన సీట్లు. ",
        "ప్రజలచే నేరుగా ఎన్నుకోబడినవారు; జనాభా ఆధారంగా కేటాయించబడిన సీట్లు. ",
        "రాష్ట్ర శాసనసభల సభ్యులచే పరోక్షంగా ఎన్నుకోబడతారు; రాష్ట్రాల సంఖ్య ఆధారంగా సీట్లు కేటాయించబడతాయి."
      ],
      correctAnswerIndex : 1,
      explanation : " రాజ్యంలో రాష్ట్రాల ప్రతినిధులు సభలను రాష్ట్ర శాసనసభల సభ్యులు పరోక్షంగా ఎన్నుకుంటారు. రాష్ట్రాల జనాభా ఆధారంగా, దామాషా ప్రాతినిధ్యానికి భరోసా కల్పిస్తూ సీట్లు కేటాయిస్తారు. ",
    ),

    Question(
      questionText: " లోక్ యొక్క బలం ఎంత సభ , మరియు అది ఎలా కూర్చబడింది?",
      options : [
        "గరిష్ట బలం: 543 ప్రతినిధులు; కూర్పు: 524 రాష్ట్ర ప్రతినిధులు, 19 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 2 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది. ",
        "గరిష్ట బలం: 550 ప్రతినిధులు; కూర్పు: 530 రాష్ట్ర ప్రతినిధులు, 20 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 2 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది. ",
        "గరిష్ట బలం: 530 ప్రతినిధులు; కూర్పు: 510 రాష్ట్ర ప్రతినిధులు, 20 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 2 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది. ",
        "గరిష్ట బలం: 545 ప్రతినిధులు; కూర్పు: 525 రాష్ట్ర ప్రతినిధులు, 20 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 2 మంది రాష్ట్రపతిచే నామినేట్ చేయబడింది."
      ],
      correctAnswerIndex : 1,
      explanation : " లోక్ సభ సంఖ్యలో 550 మంది ప్రతినిధులను కలిగి ఉన్నారు, రాష్ట్రాల నుండి 530 మంది, కేంద్రపాలిత ప్రాంతాల నుండి 20 మంది మరియు రాష్ట్రపతిచే నామినేట్ చేయబడిన 2 మంది. ప్రస్తుత కూర్పులో 524 మంది రాష్ట్ర ప్రతినిధులు, 19 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు మరియు 2 నామినేటెడ్ సభ్యులు ఉన్నారు. ",
    ),

    Question(
        questionText: " లోక్‌లో రాష్ట్ర ప్రతినిధులు ఎలా ఉన్నారు సభ ఎన్నుకోబడిందా?",
        options : [
          "ప్రజలచే నేరుగా ఎన్నుకోబడినవారు; జనాభా ఆధారంగా కేటాయించబడిన సీట్లు. ",
          "రాష్ట్ర శాసనసభల సభ్యులచే పరోక్షంగా ఎన్నుకోబడతారు; కేంద్రపాలిత ప్రాంతాల సంఖ్య ఆధారంగా సీట్లు కేటాయించబడతాయి. ",
          "ప్రజలచే నేరుగా ఎన్నుకోబడినవారు; రాష్ట్రాల సంఖ్య ఆధారంగా సీట్లు కేటాయించబడతాయి. ",
          "రాష్ట్ర శాసనసభల సభ్యులచే పరోక్షంగా ఎన్నుకోబడతారు; జనాభా ఆధారంగా కేటాయించబడిన సీట్లు."
        ],
        correctAnswerIndex : 0,
        explanation : " లోక్‌లోని రాష్ట్రాల ప్రతినిధులు సభ నేరుగా ప్రజలచే ఎన్నుకోబడుతుంది మరియు ప్రతి రాష్ట్ర జనాభా ఆధారంగా సీట్లు కేటాయించబడతాయి."
    ),
    Question(
      questionText: "భారత ప్రజాస్వామ్య రాజకీయ వ్యవస్థలో పార్లమెంటు ప్రాముఖ్యత ఏమిటి?",
      options : [
        "ఇది రాష్ట్రపతికి సలహా సంఘంగా పనిచేస్తుంది. ",
        "పార్లమెంటరీ ప్రభుత్వాన్ని స్వీకరించడం వల్ల ఇది ప్రధాన పాత్ర పోషిస్తుంది. ",
        "ఇది ఎగ్జిక్యూటివ్ నుండి విడిగా స్వతంత్ర సంస్థగా పనిచేస్తుంది. ",
        "ఇది ప్రాథమికంగా న్యాయవ్యవస్థ మరియు విషయాలపై దృష్టి పెడుతుంది."
      ],
      correctAnswerIndex : 1,
      explanation:"భారత ప్రజాస్వామ్య రాజకీయ వ్యవస్థలో పార్లమెంటులో ఒక ప్రముఖ మరియు కేంద్ర భాగాన్ని కలిగి ఉంది.",
    ),

    Question(
      questionText: "రాజ్యాంగం ప్రకారం భారత పార్లమెంటులో మూడు భాగాలు ఏమిటి?",
      options : [
        "అధ్యక్షుడు, ప్రతినిధుల సభ మరియు సెనెట్. ",
        "ప్రెసిడెంట్, హౌస్ ఆఫ్ లార్డ్స్ మరియు హౌస్ ఆఫ్ కామన్స్. ",
        "ప్రెసిడెంట్, కౌన్సిల్ ఆఫ్ స్టేట్స్ మరియు హౌస్ ఆఫ్ ది పీపుల్. ",
        "రాష్ట్రపతి, సుప్రీంకోర్టు మరియు లోక్ సభ ."
      ],
      correctAnswerIndex : 2,
      explanation : "భారత పార్లమెంటు మూడు భాగాలను కలిగి ఉంది: ప్రెసిడెంట్, కౌన్సిల్ ఆఫ్ స్టేట్స్ ( రాజ్య సభ ), మరియు హౌస్ ఆఫ్ ది పీపుల్ ( లోక్ సభ )",
    ),

    Question(
      questionText: "రాష్ట్రాలు మరియు కేంద్రపాలిత ప్రాంతాలకు పార్లమెంటులో ఏ సభ జరుగుతుంది?",
      options : [
        " లోక్ సభ ",
        "హౌస్ ఆఫ్ లార్డ్స్",
        "ప్రతినిధుల సభ",
        " రాజ్య సభ "
      ],
      correctAnswerIndex : 3,
      explanation:" రాజ్య కౌన్సిల్ ఆఫ్ స్టేట్స్ అని కూడా పిలువబడే సభ , భారత పార్లమెంటులో రాష్ట్రాలు మరియు కేంద్రపాలిత ప్రాంతాలకు ప్రాధాన్యతనిస్తుంది.",
    ),

    Question(
      questionText: " రాజ్యంలో రాష్ట్ర ప్రతినిధులు ఎలా ఉన్నారు సభ ఎన్నికైంది మరియు రాష్ట్రాలకు ఏ ప్రాతిపదికన సీట్లు కేటాయించబడతాయి?",
      options : [
        "ప్రజలచే నేరుగా ఎన్నుకోబడినవి; కేంద్రపాలిత ప్రాంతాల సంఖ్య ఆధారంగా సీట్లు కేటాయించబడతాయి. ",
        "రాష్ట్ర శాసనసభల సభ్యులచే పరోక్షంగా ఎన్నుకోబడతారు; జనాభా ఆధారంగా కేటాయించబడిన సీట్లు. ",
        "ప్రజలచే నేరుగా ఎన్నుకోబడినవారు; జనాభా ఆధారంగా కేటాయించబడిన సీట్లు. ",
        "రాష్ట్ర శాసనసభల సభ్యులచే పరోక్షంగా ఎన్నుకోబడతారు; రాష్ట్రాల సంఖ్య ఆధారంగా సీట్లు కేటాయించబడతాయి."
      ],
      correctAnswerIndex : 1,
      explanation : " రాజ్యంలో రాష్ట్రాల ప్రతినిధులు సభలను రాష్ట్ర శాసనసభల సభ్యులు పరోక్షంగా ఎన్నుకుంటారు. రాష్ట్రాల జనాభా ఆధారంగా, దామాషా ప్రాతినిధ్యానికి భరోసా కల్పిస్తూ సీట్లు కేటాయిస్తారు. ",
    ),

    Question(
      questionText: " లోక్ యొక్క బలం ఎంత సభ , మరియు అది ఎలా కూర్చబడింది?",
      options : [
        "గరిష్ట బలం: 550 ప్రతినిధులు; కూర్పు: 530 రాష్ట్ర ప్రతినిధులు, 20 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు. ",
        "గరిష్ట బలం: 543 ప్రతినిధులు; కూర్పు: 524 రాష్ట్ర ప్రతినిధులు, 19 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు. ",
        "గరిష్ట బలం: 600 ప్రతినిధులు; కూర్పు: 580 రాష్ట్ర ప్రతినిధులు, 20 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు. ",
        "గరిష్ట బలం: 560 ప్రతినిధులు; కూర్పు: 540 రాష్ట్ర ప్రతినిధులు, 20 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులు."
      ],
      correctAnswerIndex : 1,
      explanation : " లోక్ 524 మంది రాష్ట్ర ప్రతినిధులు మరియు 19 కేంద్రపాలిత ప్రాంతాల ప్రతినిధులతో సహా 543 మంది ప్రతినిధులను కలిగి ఉన్నారు." ,
    ),

    Question(
      questionText: "2020కి ముందు, ఆంగ్లో-ఇండియన్ కమ్యూనిటీ నుండి ఇద్దరు సభ్యులను లోక్‌కి నామినేట్ చేయడానికి రాష్ట్రపతికి ఏ నిబంధన ఆమోదించబడింది సభా ?",
      options : [
        "ఆర్టికల్ 75(2)",
        "ఆర్టికల్ 330",
        "ఆర్టికల్ 331",
        "ఆర్టికల్ 324"
      ],
      correctAnswerIndex : 2,
      explanation : "2020కి ముందు, ఆర్టికల్ 331 ఆంగ్లో-ఇండియన్ కమ్యూనిటీ నుండి ఇద్దరు సభ్యులను లోక్‌కు నామినేట్ చేయడానికి రాష్ట్రపతిని ఆమోదించారు. సభ .",
    ),

    Question(
      questionText: " రాజ్యానికి సభ్యులను నామినేట్ చేయడం వెనుక ఉన్న హేతుబద్ధత ఏమిటి రాష్ట్రపతి చేత సభ ?",
      options : [
        "రాజకీయ పార్టీలకు ప్రాధాన్యత ఇవ్వడానికి. ",
        "కేంద్రపాలిత ప్రాంతాలకు ప్రాధాన్యమివ్వడానికి. ",
        "అనుపాత ప్రాతినిధ్యాన్ని నిర్ధారించడానికి. ",
        "ఎన్నికల ప్రక్రియలో లేకుండా ప్రముఖ వ్యక్తులకు స్థానం కల్పించడం."
      ],
      correctAnswerIndex : 3,
      explanation : " రాజ్యానికి సభ్యులను నామినేట్ చేయడం వెనుక ఉన్న హేతువు రాష్ట్రపతి సభ అంటే ఎన్నికల ప్రక్రియ లేకుండానే ప్రముఖులకు చోటు కల్పించడం.",
    ),

    Question(
        questionText: "ఏ వ్యవస్థలో రాజ్య సభ్యులు ఉన్నారు సభ ఎన్నుకోబడిందా?",
        options : [
          "ఫస్ట్-పాస్ట్-ది-పోస్ట్ సిస్టమ్",
          "ఒకే బదిలీ ఓటు ద్వారా దామాషా ప్రాబల్యం",
          "జాబితా వ్యవస్థ",
          "మిశ్రమ-సభ్యుల అనుపాత ప్రముఖ"
        ],
        correctAnswerIndex : 1,
        explanation : " రాజ్య సభ్యులు ఒకే బదిలీ ఓటు విధానం ద్వారా సభను దామాషా ప్రారంభ ద్వారా ఎన్నుకుంటారు."
    ),

    Question(
        questionText: " లోక్‌లో షెడ్యూల్డ్ కులాలు మరియు షెడ్యూల్డ్ తెగల సీట్ల రిజర్వేషన్లకు ప్రాతిపదిక ఏమిటి? సభా ?",
        options : [
          "మత స్వీకారము, మతపరమైన అనుబంధము",
          "కుల ఆధారిత సంస్థలు",
          "జనాభా నిష్పత్తులు",
          "విద్యార్హతలు"
        ],
        correctAnswerIndex : 2,
        explanation : " లోక్‌లో షెడ్యూల్డ్ కులాలు మరియు షెడ్యూల్డ్ తెగలకు సీట్లు రిజర్వ్ చేయబడ్డాయి జనాభా నిష్పత్తి ఆధారంగా సభ ."
    ),




  ];
  int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

  late Timer _examTimer;

  @override
  void initState() {
    super.initState();
    _loadLikedData();
    //_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
    _startriversTimer();
  }
  void _startriversTimer() {
    _examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
      setState(() {
        _elapsedTimeInSeconds++;
      });
    });
  }

  Future<void> _loadLikedData() async {
    // Load liked questions data here
    // ...
  }

  void _nextQuestion() {
    setState(() {
      if (_currentQuestionIndex < _questions.length - 1) {
        _currentQuestionIndex++;
        _selectedAnswerIndex = null;
      } else {
        // All questions have been answered, navigate to results screen
        _navigateToResults();
      }
    });
  }

  void _previousQuestion() {
    setState(() {
      if (_currentQuestionIndex > 0) {
        _currentQuestionIndex--;
        _selectedAnswerIndex = null;
      }
    });
  }

  void _navigateToResults() {
    // Navigate to results screen
    _examTimer.cancel(); // Cancel the exam timer before navigating
    Navigator.of(context).pushReplacement(
      MaterialPageRoute(
        builder: (context) => ResultsScreen(
          userAnswers: _userAnswers,
          questions: _questions,
          elapsedTimeInSeconds: _elapsedTimeInSeconds,
        ),
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
        backgroundColor: Colors.blueAccent,
      ),
      body: GestureDetector(
        onVerticalDragEnd: (details) {
          if (details.velocity.pixelsPerSecond.dy < 0) {
            // Swipe up detected, move to the next question
            _nextQuestion();
          } else if (details.velocity.pixelsPerSecond.dy > 0) {
            // Swipe down detected, move to the previous question
            _previousQuestion();
          }
        },
        onHorizontalDragEnd: (details) {
          if (details.primaryVelocity! > 0) {
            _previousQuestion();
          } else if (details.primaryVelocity! < 0) {
            _nextQuestion();
          }
        },
        child: ListView(
          padding: EdgeInsets.all(16.0),
          children: [
            Text(
              "Question ${_currentQuestionIndex + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              _questions[_currentQuestionIndex].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),
            ..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
              final optionIndex = entry.key;
              final optionText = entry.value;
              return InkWell( // Added this InkWell
                onTap: () {
                  setState(() {
                    _selectedAnswerIndex = optionIndex;
                    _userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
                  });
                },
                child: ListTile(
                  title: Text(optionText),
                  leading: Radio<int>(
                    value: optionIndex,
                    groupValue: _selectedAnswerIndex,
                    onChanged: (int? value) {
                      setState(() {
                        _selectedAnswerIndex = value;
                        _userAnswers[_currentQuestionIndex] = value; // Store user's answer
                      });
                    },
                  ),
                ),
              );
            }).toList(),
            // Show correct answer if an option is selected
            if (_selectedAnswerIndex != null)
              Text(
                "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.green, // Set your desired color here
                ),
              ),

            MyBannerAdWidget(), // Add the banner ad here

          ],
        ),
      ),
      bottomNavigationBar: Container(
        color: Colors.red[400],
        child: Theme(
          data: Theme.of(context).copyWith(
            canvasColor: Colors.blueAccent[200],
          ),
          child: BottomNavigationBar(
            type: BottomNavigationBarType.fixed,
            items: const [
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
                label: '',
              ),
            ],
            onTap: (index) {
              if (index == 0) {
                _previousQuestion();
              } else if (index == 1) {
                _nextQuestion();
              }
            },
          ),
        ),
      ),
      // Overall exam timer display

      // Overall exam timer display
      // Overall exam timer display
      persistentFooterButtons: [
        Text(
          'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
      ],

    );
  }
  @override
  void dispose() {
    // Dispose of the exam timer when the widget is disposed
    _examTimer.cancel();
    super.dispose();
  }
}

class ResultsScreen extends StatelessWidget {
  final int elapsedTimeInSeconds;
  final List<int?> userAnswers;
  final List<Question> questions;

  ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


  int calculateScore() {
    int score = 0;
    for (int i = 0; i < questions.length; i++) {
      if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
        score++;
      }
    }
    return score;
  }
  String formatElapsedTime(int seconds) {
    int minutes = seconds ~/ 60;
    int remainingSeconds = seconds % 60;
    return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
  }
  @override
  Widget build(BuildContext context) {
    final int score = calculateScore();
    final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
    return Scaffold(
      appBar: AppBar(
        title: Text("Results"),
        actions: [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text("Completed Time: $completedTime" ),
          ),
        ],
      ),
      body: ListView(
        padding: EdgeInsets.all(16.0),
        children: [
          Text(
            "Your Score: $score/${questions.length}",
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16.0),
          for (int i = 0; i < questions.length; i++) ...[
            Text(
              "Question ${i + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              questions[i].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 8.0),
            Text(
              "Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              "Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 16.0),
            Text(
              "Explanation: ${questions[i].explanation}",
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),

          ],
        ],
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: parliment_te(),
  ));
}
