import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class august_te extends StatefulWidget {
  final String? userIdentifier;

  august_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<august_te> createState() => _august_teState();
}

class _august_teState extends State<august_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(200, null); // Initialize with the number of questions

  List<Question> _questions = [

  Question(
  questionText: "ఆగస్టు 2023 నివేదిక ప్రకారం భారతదేశంలో ప్రస్తుత పులుల జనాభా ఎంత?",
  options: ["3,167", "3,925", "4,500", "5,200"],
  correctAnswerIndex: 1,
  explanation: "ఆగస్టు 2023 నాటికి, భారతదేశపు పులుల జనాభా 3,925గా నివేదించబడింది, వార్షిక వృద్ధి రేటు 6.1%."
  ),
  Question(
  questionText: "ప్రాజెక్ట్ టైగర్ ఎప్పుడు ప్రారంభించబడింది మరియు సంవత్సరాలుగా అది ఎలా అభివృద్ధి చెందింది?",
  options: [
  "ఆవాస రక్షణపై దృష్టి సారించి 1965లో ప్రారంభించబడింది.",
  "1973లో ప్రారంభించబడింది, మొదట్లో తొమ్మిది నిల్వలను కలిగి ఉంది మరియు తరువాత 53 నిల్వలకు విస్తరించింది.",
  "శాస్త్రీయ పరిశోధనపై దృష్టి సారించి 1980లో ప్రారంభించబడింది.",
  "1990లో ప్రారంభించబడింది, ప్రపంచ సహకారాన్ని నొక్కి చెబుతుంది."
  ],
  correctAnswerIndex: 1,
  explanation: "ప్రాజెక్ట్ టైగర్ 1973లో ప్రారంభించబడింది, ఇది తొమ్మిది నిల్వలను కలిగి ఉంది మరియు తరువాత 53 నిల్వలకు విస్తరించింది. ఇది నివాస సంరక్షణ నుండి ప్రకృతి దృశ్యం-స్థాయి విధానం, కమ్యూనిటీ ప్రమేయం, కఠినమైన చట్ట అమలు మరియు శాస్త్రీయ పర్యవేక్షణకు పరిణామం చెందింది."
  ),
  Question(
  questionText: "ఆగస్టు 2023 నివేదిక ప్రకారం భారతదేశంలో ఏ రాష్ట్రాలు అత్యధిక పులుల జనాభాను కలిగి ఉన్నాయి?",
  options: ["మధ్యప్రదేశ్", "కర్ణాటక", "ఉత్తరాఖండ్", "మహారాష్ట్ర"],
  correctAnswerIndex: 0,
  explanation: "ఆగస్టు 2023లో అత్యధిక పులులు ఉన్న రాష్ట్రాలు మధ్యప్రదేశ్ (785), కర్ణాటక (563), ఉత్తరాఖండ్ (560), మరియు మహారాష్ట్ర (444)."
  ),
  Question(
  questionText: "ఆగస్టు 6, 2023న హిరోషిమా దినోత్సవం యొక్క ప్రాముఖ్యత ఏమిటి?",
  options: [
  "భారత స్వాతంత్ర్య ఉద్యమాన్ని గుర్తుచేస్తుంది.",
  "1945లో హిరోషిమాపై వేసిన అణుబాంబు వార్షికోత్సవాన్ని సూచిస్తుంది.",
  "ఒక చారిత్రాత్మక శాంతి ఒప్పందాన్ని జరుపుకుంటుంది.",
  "గణనీయమైన పర్యావరణ విజయాన్ని గౌరవిస్తుంది."
  ],
  correctAnswerIndex: 1,
  explanation: "హిరోషిమా డే, ఆగష్టు 6, 2023న జరుపుకుంటారు, 1945లో హిరోషిమాపై అణుబాంబు వేసిన వార్షికోత్సవాన్ని పురస్కరించుకుని, అణు యుద్ధం యొక్క వినాశకరమైన పరిణామాలను హైలైట్ చేస్తుంది."
  ),
  Question(
  questionText: "క్విట్ ఇండియా ఉద్యమాన్ని ఎవరు ప్రారంభించారు మరియు దాని ప్రధాన లక్ష్యాలు ఏమిటి?",
  options: [
  "సుభాష్ చంద్రబోస్, సమాన హక్కులను కోరడానికి.",
  "మహాత్మా గాంధీ, బ్రిటిష్ పాలన నుండి తక్షణ మరియు పూర్తి స్వాతంత్ర్యం సాధించడానికి.",
  "జవహర్‌లాల్ నెహ్రూ, పారిశ్రామికీకరణను ప్రోత్సహించడానికి.",
  "సర్దార్ పటేల్, మెరుగైన వ్యవసాయ విధానాలను కోరుకుంటారు."
  ],
  correctAnswerIndex: 1,
  explanation: "బ్రిటీష్ వలస పాలన నుండి తక్షణ మరియు సంపూర్ణ స్వాతంత్ర్యం సాధించాలనే లక్ష్యంతో, క్విట్ ఇండియా ఉద్యమం ఆగష్టు 8, 1942న మహాత్మా గాంధీచే ప్రారంభించబడింది."
  ),
  Question(
  questionText: "RBI యొక్క ఆగస్ట్ 2023 ద్రవ్య విధాన సమావేశం యొక్క ముఖ్యాంశాలు ఏమిటి?",
  options: [
  "రెపో రేటు 7%కి పెరిగింది.",
  "ఆర్థిక సంవత్సరానికి ద్రవ్యోల్బణం అంచనా తగ్గింది.",
  "అనువైన మార్పిడి రేటు పరిచయం.",
  "రెపో రేటు 6.5% వద్ద మారలేదు, ద్రవ్యోల్బణం అంచనాలు మరియు లిక్విడిటీ చర్యలు చర్చించబడ్డాయి."
  ],
  correctAnswerIndex: 3,
  explanation: "RBI యొక్క ఆగస్టు 2023 ద్రవ్య విధాన సమావేశ ముఖ్యాంశాలు రెపో రేటును 6.5% వద్ద నిర్వహించడం, ద్రవ్యోల్బణం అంచనాలు, ఆర్థిక దృక్పథం, ద్రవ్యోల్బణ పథాన్ని పర్యవేక్షించడం, ద్రవ్యత్వ చర్యలు, UPI చెల్లింపు అప్‌డేట్‌లు, స్థిర-రేటు పాలనకు మార్పు మరియు స్థిరమైన విధాన వైఖరి. "
  ),

  Question(
  questionText: "రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) ఇటీవల UPI మరియు UPI లైట్ కోసం ఏ సంచలనాత్మక కార్యక్రమాలను ప్రకటించింది?",
  options: [
  "NFC టెక్నాలజీతో ఆఫ్‌లైన్ చెల్లింపుల పరిచయం.",
  "సంభాషణ చెల్లింపులు, UPI లైట్ చెల్లింపు పరిమితి మెరుగుదల మరియు NFC సాంకేతికతతో ఆఫ్‌లైన్ UPI చెల్లింపులు.",
  "UPI లావాదేవీల కోసం మెరుగైన భద్రతా చర్యలు.",
  "UPI లైట్ కోసం ఫిక్స్‌డ్-రేట్ పాలన పరిచయం."
  ],
  correctAnswerIndex: 1,
  explanation: "భారతదేశంలో డిజిటల్ చెల్లింపుల ల్యాండ్‌స్కేప్‌ను విప్లవాత్మకంగా మార్చడానికి RBI సంభాషణ చెల్లింపులు, UPI లైట్ చెల్లింపు పరిమితి మెరుగుదల మరియు NFC సాంకేతికతతో ఆఫ్‌లైన్ UPI చెల్లింపులను ప్రకటించింది."
  ),
  Question(
  questionText: "UPIలో సంభాషణ చెల్లింపుల యొక్క ముఖ్య లక్షణాలు ఏమిటి?",
  options: [
  "పెరిగిన లావాదేవీ పరిమితి మరియు మెరుగైన భద్రత.",
  "బహుభాషా మద్దతు, AI-ఆధారిత వ్యవస్థ మరియు సీనియర్ సిటిజన్‌లకు ప్రాప్యత.",
  "ఆఫ్‌లైన్ చెల్లింపులు మరియు ఆప్టిమైజ్ చేసిన ప్రాసెసింగ్.",
  "NPCI ద్వారా UPI లైట్ పరిచయం."
  ],
  correctAnswerIndex: 1,
  explanation: "UPIపై సంభాషణ చెల్లింపులలో బహుభాషా మద్దతు, లావాదేవీల కోసం AI-ఆధారిత సిస్టమ్‌ని ఉపయోగించడం మరియు ప్రత్యేకించి సీనియర్ సిటిజన్‌ల కోసం మెరుగైన ప్రాప్యత ఉన్నాయి."
  ),
  Question(
  questionText: "UPI లైట్‌కి కొత్త లావాదేవీ పరిమితి ఏమిటి మరియు సౌలభ్యాన్ని మెరుగుపరచడం ఎలా లక్ష్యం?",
  options: [
  "రూ. 200 బ్యాలెన్స్ సీలింగ్ రూ. 2,000.",
  "ఆప్టిమైజ్ చేసిన ప్రాసెసింగ్ విధానంతో రూ. 500.",
  "భద్రతా చర్యలపై దృష్టి సారించి రూ. 1,000.",
  "ఫిక్స్‌డ్-రేట్ విధానంతో రూ. 300."
  ],
  correctAnswerIndex: 1,
  explanation: "UPI Lite కోసం కొత్త లావాదేవీ పరిమితి రూ. 500, ఆప్టిమైజ్ చేయబడిన ప్రాసెసింగ్ విధానంతో మరింత గణనీయమైన మరియు అనుకూలమైన లావాదేవీలను సులభతరం చేయడం లక్ష్యంగా పెట్టుకుంది."
  ),
  Question(
  questionText: "ఆర్‌బిఐ ఎలా జోడించాలని ప్లాన్ చేస్తుందిUPI లైట్‌లో ess కనెక్టివిటీ సవాళ్లు?",
  options: [
  "బహుభాషా మద్దతు పరిచయం.",
  "NFC సాంకేతికతను ఉపయోగించి ఆఫ్‌లైన్ చెల్లింపులు.",
  "మెరుగైన భద్రతా చర్యలు.",
  "రుణగ్రహీతలకు స్థిర-రేటు పాలన పరిచయం."
  ],
  correctAnswerIndex: 1,
  explanation: "నియర్ ఫీల్డ్ కమ్యూనికేషన్ (NFC) సాంకేతికతను ఉపయోగించి ఆఫ్‌లైన్ చెల్లింపులను ప్రవేశపెట్టడం ద్వారా UPI లైట్‌లో కనెక్టివిటీ సవాళ్లను పరిష్కరించాలని RBI యోచిస్తోంది."
  ),
  Question(
  questionText: "జూలై 2023 కోసం ICC ప్లేయర్స్ ఆఫ్ ది మంత్ విజేతలు ఎవరు మరియు వారి చెప్పుకోదగ్గ ప్రదర్శనలు ఏమిటి?",
  options: [
  "ఆమె బ్యాటింగ్ ప్రదర్శన కోసం ఆష్లీ గార్డనర్ మరియు అతని కెప్టెన్సీ కోసం క్రిస్ వోక్స్.",
  "ఎల్లీస్ పెర్రీ తన ఆల్ రౌండ్ ప్రదర్శనకు, మరియు జాక్ క్రాలే అతని బౌలింగ్ కోసం.",
  "ఆమె ఆల్ రౌండ్ ప్రదర్శనకు ఆష్లీ గార్డనర్ మరియు అతని బౌలింగ్ కోసం క్రిస్ వోక్స్.",
  "ఆమె ఫీల్డింగ్ కోసం నాట్ స్కివర్-బ్రంట్ మరియు అతని వికెట్ కీపింగ్ కోసం బాస్ డి లీడ్."
  ],
  correctAnswerIndex: 2,
  explanation: "ఆష్లీ గార్డనర్ తన ఆల్ రౌండ్ ప్రదర్శనతో 232 పరుగులు చేసి 15 వికెట్లు పడగొట్టాడు. క్రిస్ వోక్స్ ఆస్ట్రేలియాతో జరిగిన మూడు టెస్టుల్లో 19 వికెట్లు పడగొట్టి అతని బౌలింగ్‌లో గెలిచాడు."
  ),
  Question(
  questionText: "చంద్రుని ఉపరితలంపై భారతదేశం చంద్రయాన్-3 విజయవంతంగా ల్యాండింగ్ చేయడం యొక్క ప్రాముఖ్యత ఏమిటి?",
  options: [
  "చంద్రునిపై భారతదేశం యొక్క మొదటి మిషన్.",
  "చంద్రునిపై విజయవంతంగా దిగిన నాలుగో దేశంగా భారత్ అవతరించింది.",
  "భారతదేశం ద్వారా మార్స్ అన్వేషణ.",
  "గ్లోబల్ స్పేస్ రేస్ ప్రారంభం."
  ],
  correctAnswerIndex: 1,
  explanation: "భారతదేశం చంద్రయాన్-3 విజయవంతంగా ల్యాండింగ్ చేయడం చాలా ముఖ్యమైనది, ఎందుకంటే ఇది చంద్రుని ఉపరితలంపై విజయవంతంగా ల్యాండ్ అయిన యునైటెడ్ స్టేట్స్, రష్యా మరియు చైనాల తర్వాత భారతదేశాన్ని నాల్గవ దేశంగా చేసింది."
  ),
  Question(
  questionText: "చంద్రయాన్-3 మిషన్‌లో రోవర్ ప్రజ్ఞాన్ పాత్ర ఏమిటి?",
  options: [
  "కమ్యూనికేషన్ ఉపగ్రహాలను ప్రయోగించడం.",
  "చంద్ర దక్షిణ ధ్రువాన్ని అన్వేషించడం.",
  "మార్స్ పై ప్రయోగాలు నిర్వహించడం.",
  "గ్రహశకలాల నుండి నమూనాలను సేకరిస్తోంది."
  ],
  correctAnswerIndex: 1,
  explanation: "రోవర్ ప్రజ్ఞాన్ ల్యాండర్ నుండి బయటకు వచ్చి చంద్రుని దక్షిణ ధ్రువాన్ని అన్వేషించడం, విలువైన డేటాను సేకరించడం మరియు చంద్రుని నిర్మాణం మరియు పరిణామాన్ని బాగా అర్థం చేసుకోవడానికి ప్రయోగాలు చేయడం ప్రారంభించాలని భావిస్తున్నారు."
  ),
  Question(
  questionText: "2023లో భారతదేశ 77వ స్వాతంత్ర్య దినోత్సవ వేడుకలతో సంబంధం ఉన్న థీమ్ ఏమిటి?",
  options: [
  "స్వేచ్ఛ మరియు ఐక్యత.",
  "నేషన్ ఫస్ట్, ఆల్వేస్ ఫస్ట్.",
  "వైవిధ్యం మరియు చేరిక.",
  "పర్యావరణ సమతుల్యత."
  ],
  correctAnswerIndex: 1,
  explanation: "2023లో 77వ స్వాతంత్ర్య దినోత్సవ వేడుకల థీమ్ 'నేషన్ ఫస్ట్, ఆల్వేస్ ఫస్ట్', ఇది జాతీయ ఐక్యత మరియు అభివృద్ధిపై ప్రభుత్వ దృష్టికి అనుగుణంగా ఉంటుంది."
  ),
  Question(
  questionText: "భారతదేశంలో స్వాతంత్ర్య దినోత్సవ వేడుకల సందర్భంగా నిర్వహించబడే కొన్ని ముఖ్య కార్యక్రమాలు ఏమిటి?",
  options: [
  "వార్షిక క్రీడా పోటీలు.",
  "సైనిక కవాతులు మరియు సాంస్కృతిక కార్యక్రమాలు.",
  "శాస్త్రీయ ప్రదర్శనలు.",
  "ఫ్యాషన్ షోలు మరియు అందాల పోటీలు."
  ],
  correctAnswerIndex: 1,
  explanation: "భారతదేశంలో స్వాతంత్ర్య దినోత్సవ వేడుకల్లో జెండా ఎగురవేసే వేడుకలు, సైనిక కవాతులు, దేశం యొక్క గొప్ప వారసత్వాన్ని ప్రదర్శించే సాంస్కృతిక కార్యక్రమాలు మరియు స్మారక స్టాంపులు మరియు నాణేల విడుదల ఉన్నాయి."
  ),
  Question(
  questionText: "భారత స్వాతంత్ర్యానికి దారితీసిన కొన్ని ముఖ్య సంఘటనలు ఏమిటి?",
  options: [
  "బెంగాల్ విభజన.",
  "క్విట్ ఇండియా ఉద్యమం.",
  "సాల్ట్ మార్చి.",
  "పైన ఉన్నవన్నీ."
  ],
  correctAnswerIndex: 3,
  explanation: "భారత స్వాతంత్ర్యానికి దారితీసిన ముఖ్య సంఘటనలు బెంగాల్ విభజన, క్విట్ ఇండియా ఉద్యమం, సాల్ట్ మార్చ్ మరియు మరిన్ని, బ్రిటిష్ వలస పాలనకు వ్యతిరేకంగా సుదీర్ఘ పోరాటాన్ని హైలైట్ చేయడం."
  ),
  Question(
  questionText: "భారతదేశంలో ఆగస్టు 23, 2023 యొక్క ప్రాముఖ్యత ఏమిటి?",
  options: [
  "జాతీయ అంతరిక్ష దినోత్సవం",
  "స్వాతంత్ర్య దినోత్సవం",
  "చంద్రయాన్-3 ప్రయోగ రోజు",
  "బ్రిక్స్ సమ్మిట్"
  ],
  correctAnswerIndex: 0,
  explanation: "ఆగస్టు 23, 2023ని భారతదేశంలో జాతీయ అంతరిక్ష దినోత్సవంగా జరుపుకుంటారు. చంద్రునిపై చంద్రయాన్-3 విజయవంతంగా ల్యాండింగ్ అయినందుకు గుర్తుగా ప్రధాని నరేంద్ర మోడీ దీనిని ప్రకటించారు. ల్యాండర్ తాకిన ప్రదేశానికి 'శివశక్తి' అని పేరు పెట్టారు. మరియు చంద్రయాన్-2 ల్యాండింగ్ సైట్ 'తిరంగ పాయింట్'.",
  ),

  Question(
  questionText: "ఇండియా స్మార్ట్ సిటీస్ అవార్డ్స్ 2022లో ఏ నగరం మరియు రాష్ట్రం ఉత్తమమైనవిగా గుర్తించబడ్డాయి?",
  options: [
  "సూరత్ మరియు రాజస్థాన్",
  "ఆగ్రా మరియు తమిళనాడు",
  "ఇండోర్ మరియు మధ్యప్రదేశ్",
  "కోయంబత్తూరు మరియు ఉత్తర ప్రదేశ్"
  ],
  correctAnswerIndex: 2,
  explanation: "ఇండోర్ ఉత్తమ నగరంగా ఎంపికైంది, మరియు మధ్యప్రదేశ్ భారతదేశం స్మార్ట్ సిటీస్ అవార్డ్స్ 2022లో ఉత్తమ రాష్ట్రంగా గుర్తింపు పొందింది. ఈ అవార్డులు నగరాలు మరియు రాష్ట్రాలు స్థిరమైన అభివృద్ధిని ప్రోత్సహించడంలో మరియు పట్టణ జీవన నాణ్యతను పెంచడంలో సాధించిన పురోగతి మరియు విజయాలను జరుపుకుంటాయి. ",
  ),

  Question(
  questionText: "ఇస్రో ఛైర్మన్ మరియు భారతదేశం యొక్క మూన్ మిషన్ వెనుక మెదడు ఎవరు?",
  options: [
  "పి వీరముత్తువేల్",
  "ఎస్ సోమనాథ్",
  "ఎం శంకరన్",
  "ఎస్ మోహన కుమార్"
  ],
  correctAnswerIndex: 1,
  explanation: "S సోమనాథ్ ISRO ఛైర్మన్ మరియు చంద్రయాన్-3తో సహా భారతదేశం యొక్క మూన్ మిషన్ వెనుక మెదడు. గగన్‌యాన్ మరియు సన్-మిషన్ ఆదిత్య-L1తో సహా ISRO యొక్క వివిధ మిషన్లను వేగవంతం చేయడంలో అతను కీలక పాత్ర పోషించాడు.",
  ),

  Question(
  questionText: "యునైటెడ్ స్టేట్స్, చైనా మరియు మాజీ సోవియట్ యూనియన్‌ల ర్యాంక్‌లలో చేరి, సాఫ్ట్ లూనార్ ల్యాండింగ్ సాధించిన నాల్గవ దేశంగా అధికారికంగా ఏ దేశం అవతరించింది?",
  options: [
  "రష్యా",
  "చైనా",
  "భారతదేశం",
  "సంయుక్త రాష్ట్రాలు"
  ],
  correctAnswerIndex: 2,
  explanation: "భారతదేశం అధికారికంగా చంద్రయాన్-3తో సాఫ్ట్ లూనార్ ల్యాండింగ్ సాధించిన నాల్గవ దేశంగా అవతరించింది. ఆగస్ట్ 23, 2023న విజయవంతమైన ల్యాండింగ్ జరిగింది, దీనితో భారతదేశం చంద్రుని అన్వేషణలో ముఖ్యమైన ఆటగాడిగా మారింది.",
  ),

  Question(
  questionText: "ఆగస్టు 15, 2023న భారతదేశ 77వ స్వాతంత్ర్య దినోత్సవ వేడుకల థీమ్ ఏమిటి?",
  options: [
  "భిన్నత్వంలో ఏకత్వం",
  "దేశం మొదటిది, ఎల్లప్పుడూ మొదటిది",
  "డిజిటల్ ఇండియా",
  "స్థిరమైన అభివృద్ధి"
  ],
  correctAnswerIndex: 1,
  explanation: "2023లో భారతదేశ 77వ స్వాతంత్ర్య దినోత్సవ వేడుకల థీమ్ 'నేషన్ ఫస్ట్, ఆల్వేస్ ఫస్ట్'. ఈ థీమ్ జాతీయ ఐక్యత మరియు అభివృద్ధిపై ప్రభుత్వ దృష్టికి అనుగుణంగా ఉంటుంది.",
  ),
  Question(
  questionText: "కార్పోరేట్ డెట్ మార్కెట్‌కు మద్దతుగా సెక్యూరిటీస్ అండ్ ఎక్స్ఛేంజ్ బోర్డ్ ఆఫ్ ఇండియా (SEBI) ఏ నిధిని స్థాపించింది?",
  options: [
  "కార్పొరేట్ రుణానికి హామీ పథకం (GSCD)",
  "కార్పొరేట్ డెట్ మార్కెట్ డెవలప్‌మెంట్ ఫండ్ (CDMDF)",
  "రిజర్వ్ బ్యాంక్ ఇన్నోవేషన్ హబ్ (RBIH)",
  "ఫ్రిక్షన్‌లెస్ క్రెడిట్ (PTPFC) కోసం పబ్లిక్ టెక్ ప్లాట్‌ఫారమ్"
  ],
  correctAnswerIndex: 1,
  explanation: "సెబీ కార్పొరేట్ డెట్ మార్కెట్ డెవలప్‌మెంట్ ఫండ్ (CDMDF)ని 'బ్యాక్‌స్టాప్ సదుపాయం'గా పనిచేయడానికి ఏర్పాటు చేసింది, పెట్టుబడి-స్థాయి కార్పొరేట్ డెట్ సెక్యూరిటీలను కొనుగోలు చేయడం ద్వారా ఒత్తిడితో కూడిన పరిస్థితులలో కార్పొరేట్ డెట్ మార్కెట్‌కు మద్దతునిస్తుంది. కార్పొరేట్ రుణానికి హామీ పథకం (GSCD) ఫండ్‌తో అనుబంధించబడింది.",
  ),

  Question(
  questionText: "మార్చి 2023కి రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) డిజిటల్ పేమెంట్స్ ఇండెక్స్ (RBIDPI) ఏమిటి మరియు సెప్టెంబర్ 2022తో పోలిస్తే ఇది ఎంత పెరిగింది?",
  options: [
  "RBIDPI: 377.46, వృద్ధి: 13.24%",
  "RBIDPI: 395.58, వృద్ధి: 13.24%",
  "RBIDPI: 377.46, వృద్ధి: 395.58%",
  "RBIDPI: 395.58, వృద్ధి: 23.46%"
  ],
  correctAnswerIndex: 1,
  explanation: "మార్చి 2023కి RBI డిజిటల్ చెల్లింపుల సూచిక (RBIDPI) 395.58గా ఉంది, ఇది సెప్టెంబర్ 2022తో పోలిస్తే 13.24% వృద్ధిని ప్రతిబింబిస్తుంది, ఇది 377.46 సూచిక విలువను కలిగి ఉంది.",
  ),

  Question(
  questionText: "యూనిఫైడ్ పేమెంట్స్ ఇంటర్‌ఫేస్ (UPI) నెట్‌వర్క్ జూలై 2023లో ఏ రికార్డులను సెట్ చేసింది?",
  options: [
  "లావాదేవీ వాల్యూమ్ మరియు విలువ రికార్డులు",
  "లావాదేవీ వాల్యూమ్ రికార్డ్ మాత్రమే",
  "లావాదేవీ విలువ రికార్డు మాత్రమే",
  "నెలవారీ లాభాల రికార్డు"
  ],
  correctAnswerIndex: 0,
  explanation: "జూలై 2023లో, UPI నెట్‌వర్క్ లావాదేవీ పరిమాణం మరియు విలువ రెండింటిలోనూ కొత్త రికార్డులను నెలకొల్పింది. లావాదేవీలు 44% సంవత్సరానికి పెరిగాయి, ₹15.34 లక్షల కోట్లకు చేరుకున్నాయి, లావాదేవీల సంఖ్య 996 కోట్లకు చేరుకుంది, జూలై 2022తో పోలిస్తే 58% పెరుగుదల ",
  ),

  Question(
  questionText: "న్యూఢిల్లీలో జరిగిన ఒక ప్రత్యేక కార్యక్రమంలో NMDC కొత్త లోగోను ఎవరు వెల్లడించారు?",
  options: [
  "నరేంద్ర మోడీ",
  "జ్యోతిరాదిత్య సిడియా",
  "ఎస్ సోమనాథ్",
  "శశిధర్ జగదీషన్"
  ],
  correctAnswerIndex: 1,
  explanation: "న్యూ ఢిల్లీలో జరిగిన ఒక ప్రత్యేక కార్యక్రమంలో కేంద్ర ఉక్కు మరియు పౌర విమానయాన శాఖ మంత్రి జ్యోతిరాదిత్య సిడియా NMDC యొక్క కొత్త లోగోను వెల్లడించారు. కొత్త లోగో బాధ్యతాయుతమైన మైనింగ్ మరియు ప్రపంచ ప్రమాణాలకు NMDC యొక్క నిబద్ధతను ప్రతిబింబిస్తుంది.",
  ),

  Question(
  questionText: "రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) నుండి ఏ ప్రధాన ప్రభుత్వ రంగ సంస్థలు ₹2,000 కోట్ల సమర్పణ రుసుమును ఆలస్యంగా ఎదుర్కొన్నాయి?",
  options: [
  "ONGC విదేశ్ లిమిటెడ్, ఇండియన్ ఆయిల్ కార్ప్. లిమిటెడ్, గెయిల్ (ఇండియా) లిమిటెడ్, మరియు ఆయిల్ ఇండియా లిమిటెడ్",
  "SBI, HDFC బ్యాంక్, ICICI బ్యాంక్, మరియు యాక్సిస్ బ్యాంక్",
  "NMDC, బంధన్ బ్యాంక్, YES బ్యాంక్ మరియు కెనరా బ్యాంక్",
  "Airtel Payment Bank, Kiwi, AU స్మాల్ ఫైనాన్స్ బ్యాంక్, మరియు LIC"
  ],
  correctAnswerIndex: 0,
  explanation: "ONGC విదేశ్ లిమిటెడ్, ఇండియన్ ఆయిల్ కార్పొరేషన్ లిమిటెడ్, GAIL (ఇండియా) లిమిటెడ్ మరియు ఆయిల్ ఇండియా లిమిటెడ్‌లపై RBI ఆలస్య సమర్పణ రుసుములను ₹2,000 కోట్లు విధించింది, దీని వలన తమ విదేశీ పెట్టుబడులను తక్షణమే నివేదించడంలో విఫలమయ్యారు, ఇది తదుపరి చెల్లింపులు మరియు బదిలీలను ప్రభావితం చేస్తుంది. వ్యత్యాసాలు పరిష్కరించబడతాయి.",
  ),

  Question(
  questionText: "జీవితకాలం ఉచిత యాక్సిస్ బ్యాంక్ KWIK క్రెడిట్ కార్డ్‌లను పరిచయం చేయడానికి యాక్సిస్ బ్యాంక్‌తో ఏ ఫిన్‌టెక్ కంపెనీ భాగస్వామ్యం కలిగి ఉంది?",
  options: [
  "Airtel Payment Bank",
  "కివి",
  "యస్ బ్యాంక్",
  "కెనరా బ్యాంక్"
  ],
  correctAnswerIndex: 1,
  explanation: "కివీ, UPIపై క్రెడిట్‌ని ఎనేబుల్ చేయడంలో ప్రత్యేకత కలిగిన ఫిన్‌టెక్ కంపెనీ, దాని యాప్ ద్వారా జీవితకాల ఉచిత యాక్సిస్ బ్యాంక్ KWIK క్రెడిట్ కార్డ్‌లను పరిచయం చేయడానికి యాక్సిస్ బ్యాంక్‌తో భాగస్వామ్యం కలిగి ఉంది.",
  ),

  Question(
  questionText: "2023-24 ఏప్రిల్-జూన్ త్రైమాసికంలో ఏ బ్యాంక్ తన అత్యధిక త్రైమాసిక లాభాన్ని ₹16,884 కోట్లుగా నివేదించింది?",
  options: [
  "ICICI బ్యాంక్",
  "యాక్సిస్ బ్యాంక్",
  "HDFC బ్యాంక్",
  "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI)"
  ],
  correctAnswerIndex: 3,
  explanation: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) తన అత్యధిక త్రైమాసిక లాభాన్ని ₹16,884 కోట్లుగా ప్రకటించింది.2023-24 ఏప్రిల్-జూన్ త్రైమాసికంలో, అంతకుముందు సంవత్సరం ఇదే కాలంలో ₹6,068 కోట్ల నుండి గణనీయమైన పెరుగుదలను సూచిస్తుంది.",
  ),

  Question(
  questionText: "2023 ఆర్థిక సంవత్సరంలో అత్యధిక వేతనం పొందిన బ్యాంక్ CEO ఎవరు?",
  options: [
  "శశిధర్ జగదీషన్",
  "ఎస్ సోమనాథ్",
  "జ్యోతిరాదిత్య సిడియా",
  "నరేంద్ర మోడీ"
  ],
  correctAnswerIndex: 0,
  explanation: "HDFC బ్యాంక్ యొక్క CEO అయిన శశిధర్ జగదీషన్, 2023 ఆర్థిక సంవత్సరంలో మొత్తం రూ.10.55 కోట్ల ప్యాకేజీతో అత్యధిక చెల్లింపులు పొందిన బ్యాంక్ CEO అయ్యారు.",
  ),

  Question(
  questionText: "జూన్ 2023 మొదటి త్రైమాసికంలో ప్రభుత్వ రంగ బ్యాంకులు (PSB) ఎంత లాభాన్ని నమోదు చేశాయి?",
  options: [
  "రూ. 15,306 కోట్లు",
  "రూ. 20,000 కోట్లు",
  "రూ. 34,774 కోట్లు",
  "రూ. 10,000 కోట్లు"
  ],
  correctAnswerIndex: 2,
  explanation: "జూన్ 2023 మొదటి త్రైమాసికంలో పబ్లిక్ సెక్టార్ బ్యాంకులు (PSBలు) రూ. 34,774 కోట్లకు పైగా ఆకట్టుకునే లాభాన్ని నమోదు చేశాయి, ఇది వారి మునుపటి ఆదాయాల కంటే రెట్టింపు కంటే ఎక్కువ పెరుగుదలను ప్రదర్శించింది.",
  ),

  Question(
  questionText: "ఇండియాఫస్ట్ లైఫ్ ఇన్సూరెన్స్ కంపెనీ ఇటీవల ప్రారంభించిన సంచలనాత్మక బీమా ఉత్పత్తి పేరు ఏమిటి?",
  options: [
  "జీవితకాలం ఉచిత యాక్సిస్ బ్యాంక్ KWIK క్రెడిట్ కార్డ్",
  "ఇన్ఫినిటీ సేవింగ్స్ అకౌంట్",
  "జీవిత కలల హామీ (G.O.L.D.) ప్రణాళిక",
  "మారియట్ బోన్వాయ్ HDFC బ్యాంక్ క్రెడిట్ కార్డ్"
  ],
  correctAnswerIndex: 2,
  explanation: "ఇండియాఫస్ట్ లైఫ్ ఇన్సూరెన్స్ కంపెనీ ఇటీవలే 'గ్యారంటీ ఆఫ్ లైఫ్ డ్రీమ్స్ (G.O.L.D.) ప్లాన్‌ను ప్రారంభించింది, ఇది పాలసీదారులకు సాధారణ, దీర్ఘకాలిక ఆదాయాన్ని అందించడానికి రూపొందించబడిన నాన్-లింక్డ్ మరియు నాన్-పార్టిసిపేటింగ్ బీమా ప్లాన్.",
  ),

  Question(
  questionText: "ఆర్థిక మంత్రిత్వ శాఖ నివేదిక ప్రకారం, కనీస బ్యాలెన్స్‌ను నిర్వహించడంలో విఫలమైన ఖాతాదారుల నుండి ప్రభుత్వ యాజమాన్యంలోని మరియు ప్రముఖ ప్రైవేట్ బ్యాంకులు ఎంత రుసుములను పొందాయి?",
  options: [
  "₹21,000 కోట్లకు పైగా",
  "₹10,000 కోట్లకు పైగా",
  "₹5,000 కోట్లకు పైగా",
  "రూ.30,000 కోట్లకు పైగా"
  ],
  correctAnswerIndex: 0,
  explanation: "ఆర్థిక మంత్రిత్వ శాఖ నివేదిక ప్రకారం, ప్రభుత్వ యాజమాన్యంలోని బ్యాంకులు మరియు ప్రముఖ ప్రైవేట్ బ్యాంకులు రెండూ ప్రాథమికంగా 2018 నుండి కనీస నిల్వను నిర్వహించడంలో విఫలమైన ఖాతాదారుల నుండి ₹21,000 కోట్ల కంటే ఎక్కువ రుసుములను పొందాయి.",
  ),

  Question(
  questionText: "రీసైకిల్-పాలీ వినైల్ క్లోరైడ్ (r-PVC) మెటీరియల్‌తో రూపొందించబడిన పర్యావరణ అనుకూల డెబిట్ కార్డ్‌ను ప్రారంభించిన మొదటి భారతీయ బ్యాంకు ఏది?",
  options: [
  "HDFC బ్యాంక్",
  "SBI",
  "కెనరా బ్యాంక్",
  "Airtel Payment Bank"
  ],
  correctAnswerIndex: 3,
  explanation: "Airtel Payment Bank సేవింగ్స్ బ్యాంక్ ఖాతాతో తన కొత్త మరియు ఇప్పటికే ఉన్న కస్టమర్ల కోసం పర్యావరణ అనుకూల డెబిట్ కార్డ్‌ను ప్రారంభించిన మొదటి భారతీయ బ్యాంకుగా అవతరించింది. డెబిట్ కార్డ్‌లు రీసైకిల్-పాలీ వినైల్ క్లోరైడ్ (r-PVC) మెటీరియల్‌తో రూపొందించబడ్డాయి, ధృవీకరించబడ్డాయి పర్యావరణ అనుకూల పదార్థంగా.",
  ),

  Question(
  questionText: "రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) నుండి మొత్తం రూ.4.20 లక్షల ద్రవ్య జరిమానాలను ఏ సహకార బ్యాంకులు ఎదుర్కొన్నాయి?",
  options: [
  "కెనరా బ్యాంక్, యాక్సిస్ బ్యాంక్, HDFC బ్యాంక్, మరియు SBI",
  "వీటా అర్బన్ కోఆపరేటివ్ బ్యాంక్ లిమిటెడ్, శ్రీ వినాయక్ సహకారి బ్యాంక్ లిమిటెడ్, శ్రీజీ భాటియా కోఆపరేటివ్ బ్యాంక్ లిమిటెడ్, మరియు మిజోరం అర్బన్ కోఆపరేటివ్ డెవలప్‌మెంట్ బ్యాంక్ లిమిటెడ్",
  "YES బ్యాంక్, బంధన్ బ్యాంక్, AU స్మాల్ ఫైనాన్స్ బ్యాంక్, మరియు LIC",
  "ICICI బ్యాంక్, IDBI బ్యాంక్, కోటక్ మహీంద్రా బ్యాంక్, మరియు PNB"
  ],
  correctAnswerIndex: 1,
  explanation: "విటా అర్బన్ కోఆపరేటివ్ బ్యాంక్ లిమిటెడ్, శ్రీ వినాయక్ సహకరి బ్యాంక్ లిమిటెడ్, శ్రీజీ భాటియా కోఆపరేటివ్ బ్యాంక్ లిమిటెడ్, మరియు మిజోరాం అర్బన్ కోఆపరేటివ్ డెవలప్‌మెంట్ బ్యాంక్ లిమిటెడ్‌లపై వివిధ నిబంధనలను ఉల్లంఘించినందుకు ఆర్‌బిఐ మొత్తం రూ.4.20 లక్షల ద్రవ్య జరిమానాలు విధించింది. సెంట్రల్ బ్యాంకింగ్ అథారిటీ.",
  ),

  Question(
  questionText: "ఏ బ్యాంక్ 24x7 వీడియో బ్యాంకింగ్ ప్లాట్‌ఫారమ్‌ను ప్రారంభించింది, వినియోగదారులను నిపుణులైన బ్యాంకర్‌లతో ముఖాముఖి వీడియో పరస్పర చర్యలలో పాల్గొనడానికి అనుమతిస్తుంది?",
  options: [
  "HDFC బ్యాంక్",
  "ICICI బ్యాంక్",
  "యాక్సిస్ బ్యాంక్",
  "AU స్మాల్ ఫైనాన్స్ బ్యాంక్"
  ],
  correctAnswerIndex: 11,
  explanation: "AU స్మాల్ ఫైనాన్స్ బ్యాంక్, భారతదేశంలో అతిపెద్ద చిన్న ఫైనాన్స్ బ్యాంక్, 24x7 వీడియో బ్యాంకింగ్ ప్లాట్‌ఫారమ్‌ను ప్రారంభించింది, నిపుణులైన బ్యాంకర్‌లతో ముఖాముఖి వీడియో పరస్పర చర్యలలో పాల్గొనేందుకు వినియోగదారులను అనుమతిస్తుంది. ఈ సేవ రౌండ్-ది-క్లాక్ మద్దతును అందిస్తుంది, వారాంతాల్లో మరియు సెలవుల్లో కూడా.",
  ),

  Question(
  questionText: "ఇనీషియల్ పబ్లిక్ ఆఫర్‌ల (ఐపిఓలు) సామర్థ్యాన్ని SEBI ఎలా పెంచింది?",
  options: [
  "కార్పోరేట్ డెట్ మార్కెట్ డెవలప్‌మెంట్ ఫండ్‌ను ప్రవేశపెట్టింది",
  "IPO మూసివేత తర్వాత స్టాక్ ఎక్స్ఛేంజీలలో షేర్లను లిస్టింగ్ చేయడానికి టైమ్‌లైన్ సగానికి తగ్గించబడింది",
  "ప్రధాన ప్రభుత్వ రంగ సంస్థలపై ఆలస్య సమర్పణ రుసుము విధించబడింది",
  "గ్రౌండ్‌బ్రేకింగ్ వీడియో బ్యాంకింగ్ ప్లాట్‌ఫారమ్‌ను ప్రారంభించింది"
  ],
  correctAnswerIndex: 1,
  explanation: "IPO మూసివేత తర్వాత స్టాక్ ఎక్స్ఛేంజీలలో షేర్లను లిస్టింగ్ చేయడానికి టైమ్‌లైన్‌ను సగానికి తగ్గించడం ద్వారా SEBI ప్రారంభ పబ్లిక్ ఆఫర్‌ల (IPOలు) సామర్థ్యాన్ని మెరుగుపరిచింది. ఈ చర్య పెట్టుబడిదారులకు మరియు క్యాపిటల్ మార్కెట్‌లలోని జారీ చేసేవారికి గణనీయమైన ప్రయోజనాలను అందించడం లక్ష్యంగా పెట్టుకుంది.",
  ),

  Question(
  questionText: "నేషనల్ ఇన్‌స్టిట్యూట్ ఆఫ్ పబ్లిక్ ఫైనాన్స్ ప్రకారం, 2023-24 ఆర్థిక సంవత్సరంలో భారతదేశానికి అంచనా వేసిన ఆర్థిక వృద్ధి రేటు ఎంత?మరియు పాలసీ (NIPFP)?",
  options: [
  "7.2%",
  "8.0%",
  "6.0%",
  "6.7%"
  ],
  correctAnswerIndex: 2,
  explanation: "నేషనల్ ఇన్‌స్టిట్యూట్ ఆఫ్ పబ్లిక్ ఫైనాన్స్ అండ్ పాలసీ (NIPFP) యొక్క మధ్య-సంవత్సర స్థూల ఆర్థిక సమీక్ష ప్రకారం, 2023-24 ఆర్థిక సంవత్సరంలో భారతదేశానికి అంచనా వేసిన ఆర్థిక వృద్ధి రేటు 7.2 నుండి 6.0%కి తగ్గుతుందని అంచనా. FY23లో % నమోదైంది. ఈ అంచనా మందగమనం ప్రపంచ ఆర్థిక వ్యవస్థలో ప్రబలంగా ఉన్న ఎదురుగాలి కారణంగా చెప్పబడింది.",
  ),

  Question(
  questionText: "నేషనల్ పేమెంట్స్ కార్పొరేషన్ ఆఫ్ ఇండియా (NPCI) ప్రవేశపెట్టిన UPI సేఫ్టీ అవేర్‌నెస్ క్యాంపెయిన్ యొక్క మూడవ ఎడిషన్ యొక్క థీమ్ ఏమిటి?",
  options: [
  "డిజిటల్ చెల్లింపు స్వీకరణ",
  "UPI యూజింగ్ సౌలభ్యం",
  "UPI యొక్క భద్రత, సౌలభ్యం మరియు స్విఫ్ట్‌నెస్",
  "ఆర్థిక భద్రత మరియు స్థిరమైన ఆదాయం"
  ],
  correctAnswerIndex: 2,
  explanation: "నేషనల్ పేమెంట్స్ కార్పొరేషన్ ఆఫ్ ఇండియా (NPCI) ప్రవేశపెట్టిన UPI సేఫ్టీ అవేర్‌నెస్ క్యాంపెయిన్ యొక్క మూడవ ఎడిషన్ పేరు 'UPI చలేగా.' లావాదేవీల కోసం యూనిఫైడ్ పేమెంట్స్ ఇంటర్‌ఫేస్ (UPI)ని ఉపయోగించడంలో భద్రత, సౌలభ్యం మరియు వేగాన్ని నొక్కి చెప్పడం ఈ ప్రచారం లక్ష్యం.",
  ),

  Question(
  questionText: "ఫ్లోటింగ్ రేట్ హోమ్ లోన్‌లకు సంబంధించి రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) ఏయే సంస్కరణలను ప్రవేశపెట్టింది?",
  options: [
  "కార్పోరేట్ డెట్ మార్కెట్ డెవలప్‌మెంట్ ఫండ్‌ను ప్రవేశపెట్టింది",
  "IPO మూసివేత తర్వాత స్టాక్ ఎక్స్ఛేంజీలలో షేర్లను లిస్టింగ్ చేయడానికి టైమ్‌లైన్ సగానికి తగ్గించబడింది",
  "ఆఫ్‌లైన్ చెల్లింపు లావాదేవీల గరిష్ట పరిమితిని పెంచారు",
  "వడ్డీ రేట్లను రీసెట్ చేసే ప్రక్రియకు మరింత స్పష్టత అందించబడింది మరియు స్థిర వడ్డీ రేట్లకు మారే అవకాశాన్ని అందించింది"
  ],
  correctAnswerIndex: 3,
  explanation: "భారతీయ రిజర్వ్ బ్యాంక్ (RBI) పారదర్శకత మరియు వినియోగదారుల రక్షణను పెంపొందించడానికి ఫ్లోటింగ్ రేటు గృహ రుణాలకు సంబంధించిన సంస్కరణలను ప్రవేశపెట్టింది. ఈ సంస్కరణలు వడ్డీ రేట్లను రీసెట్ చేసే ప్రక్రియకు మరింత స్పష్టతను అందిస్తాయి, రుణగ్రహీతలు స్థిర వడ్డీ రేట్లకు మారే అవకాశాన్ని అందిస్తాయి. , మరియు సరైన సమ్మతి లేకుండా రుణ కాల వ్యవధిని ఏకపక్షంగా మార్చకుండా బ్యాంకులను నిరోధించండి.",
  ),


  Question(
  questionText: "జులై 28, 2023న సెంట్రల్ బోర్డ్ ఆఫ్ పరోక్ష పన్నులు మరియు కస్టమ్స్ (CBIC) వస్తు మరియు సేవల పన్ను (GST) నియమాలలో ఏ ముఖ్యమైన మార్పును ప్రకటించింది?",
  options: [
  "ఆన్‌లైన్ గేమింగ్ బెట్‌లపై 28% పన్ను పరిచయం",
  "B2B లావాదేవీలు లేదా ఎగుమతుల కోసం ఎలక్ట్రానిక్ ఇన్‌వాయిస్‌లను (ఇ-ఇన్‌వాయిస్‌లు) రూపొందించడానికి ₹5 కోట్ల కంటే ఎక్కువ టర్నోవర్ ఉన్న కంపెనీలు",
  "భారత ప్రభుత్వంపై 25.3% ఆర్థిక లోటు విధించడం",
  "ముడి చమురు మరియు డీజిల్‌పై విండ్‌ఫాల్ ప్రాఫిట్ ట్యాక్స్ పెంపుదల"
  ],
  correctAnswerIndex: 1,
  explanation: "₹5 కోట్ల కంటే ఎక్కువ టర్నోవర్ ఉన్న కంపెనీలు తమ బిజినెస్-టు-బిజినెస్ (B2B) లావాదేవీలు లేదా ఎగుమతుల కోసం ఎలక్ట్రానిక్ ఇన్‌వాయిస్‌లను (ఇ-ఇన్‌వాయిస్‌లు) రూపొందించాల్సి ఉంటుందని CBIC ప్రకటించింది.",
  ),

  Question(
  questionText: "కంట్రోలర్ జనరల్ ఆఫ్ అకౌంట్స్ (CGA) ప్రకారం, జూన్ 2023 చివరి నాటికి భారత ప్రభుత్వం యొక్క ఆర్థిక లోటు ఎంత?",
  options: [
  "పూర్తి-సంవత్సర లక్ష్యంలో 25.3%",
  "పూర్తి-సంవత్సర లక్ష్యంలో 20%",
  "పూర్తి-సంవత్సర లక్ష్యంలో 15%",
  "పూర్తి సంవత్సర లక్ష్యంలో 30%"
  ],
  correctAnswerIndex: 0,
  explanation: "కంట్రోలర్ జనరల్ ఆఫ్ అకౌంట్స్ (CGA) విడుదల చేసిన డేటా ప్రకారం, జూన్ 2023 చివరి నాటికి భారత ప్రభుత్వం యొక్క ఆర్థిక లోటు పూర్తి సంవత్సర లక్ష్యంలో 25.3%.",
  ),

  Question(
  questionText: "జులై 2023కి సంబంధించి స్థూల వస్తువులు మరియు సేవల పన్ను (GST) సేకరణ ఎంత, గత సంవత్సరం ఇదే నెలతో పోల్చితే ఎలా ఉంటుంది?",
  options: [
  "రూ. 1.5 లక్షల కోట్లు, గత సంవత్సరం కంటే 10% ఎక్కువ",
  "రూ. 1.65 లక్షల కోట్లు, గత సంవత్సరం కంటే 11% ఎక్కువ",
  "రూ. 1.2 లక్షల కోట్లు, గత సంవత్సరం కంటే 5% ఎక్కువ",
  "రూ. 2 లక్షల కోట్లు, గతేడాది కంటే 15% ఎక్కువ"
  ],
  correctAnswerIndex: 1,
  explanation: "జులై 2023కి స్థూల GST వసూళ్లు రూ. 1.65 లక్షల కోట్ల మార్కును అధిగమించాయి, ఇది గత ఏడాది ఇదే నెల కంటే 11% ఎక్కువ, ఇది దేశ ఆర్థిక వృద్ధిలో సానుకూల ధోరణిని ప్రతిబింబిస్తుంది.",
  ),

  Question(
  questionText: "జూలై 2023లో భారతదేశ తయారీ రంగానికి సంబంధించిన పర్చేజింగ్ మేనేజర్స్ ఇండెక్స్ (PMI) అంటే ఏమిటి మరియు ఇది జూన్ మరియు మే నెలలతో ఎలా పోల్చబడుతుంది?",
  options: [
  "57.7, మేలో 58.7 నుండి తగ్గుదల",
  "57.7, జూన్‌లో 57.8 నుండి తగ్గుదల",
  "58.7, జూన్‌లో 57.8 నుండి పెరుగుదల",
  "57.8, జూన్‌లో 57.7 నుండి పెరుగుదల"
  ],
  correctAnswerIndex: 1,
  explanation: "జులై 2023లో భారతదేశ తయారీ రంగానికి PMI 57.7గా ఉంది, ఇది జూన్‌లో 57.8 నుండి స్వల్ప తగ్గుదలని సూచిస్తుంది. అయినప్పటికీ, ఈ సంఖ్య ఇప్పటికీ రంగంలో విస్తరణను సూచిస్తుంది.",
  ),

  Question(
  questionText: "మార్చి 2023లో భారతదేశ GDPలో ప్రభుత్వ రుణం ఎంత శాతం ఉంది?",
  options: [
  "61.5%",
  "57.1%",
  "50.0%",
  "65.2%"
  ],
  correctAnswerIndex: 1,
  explanation: "మార్చి 2023లో, భారత ప్రభుత్వ రుణం ₹155.6 లక్షల కోట్లుగా ఉంది, ఇది దేశ GDPలో 57.1%గా ఉంది, ఇది 2020-21లో GDPలో 61.5% నుండి తగ్గుదలని సూచిస్తుంది.",
  ),

  Question(
  questionText: "వస్తువులు మరియు సేవల పన్ను (GST) కౌన్సిల్ వేసిన పందాలపై ఏ పన్ను విధించాలని నిర్ణయించిందిఆన్‌లైన్ గేమింగ్‌లో, మరియు ఇది ఎప్పుడు అమలు చేయబడుతుంది?",
  options: [
  "18%, తక్షణం అమలులోకి వస్తుంది",
  "28%, అక్టోబర్ 1 నుండి అమలులోకి వస్తుంది",
  "15%, వచ్చే ఆర్థిక సంవత్సరం నుండి అమలులోకి వస్తుంది",
  "10%, జనవరి 2024 నుండి అమలులోకి వస్తుంది"
  ],
  correctAnswerIndex: 1,
  explanation: "GST కౌన్సిల్ ఆన్‌లైన్ గేమింగ్‌పై ఉంచే పందెం యొక్క పూర్తి ముఖ విలువపై 28% పన్ను విధించాలని నిర్ణయించింది మరియు ఇది అక్టోబర్ 1 నుండి అమలు చేయబడుతుంది.",
  ),

  Question(
  questionText: "జులై 2023లో భారతదేశ సేవల రంగం వృద్ధి రేటు ఎంత, మరియు S&P గ్లోబల్ ఇండియా సర్వీసెస్ పర్చేజింగ్ మేనేజర్స్ ఇండెక్స్ (PMI) ఎంత?",
  options: [
  "60.5% వృద్ధి రేటు, PMI 58.0",
  "62.3% వృద్ధి రేటు, అత్యధిక PMI",
  "55.8% వృద్ధి రేటు, PMI 60.0",
  "58.7% వృద్ధి రేటు, PMI 63.5"
  ],
  correctAnswerIndex: 1,
  explanation: "జూలై 2023లో, భారతదేశ సేవల రంగం 13 సంవత్సరాలలో అత్యధిక వృద్ధితో గణనీయమైన పుంజుకుంది, S&P గ్లోబల్ ఇండియా సర్వీసెస్ PMI 62.3 రికార్డు స్థాయిని సాధించింది.",
  ),

  Question(
  questionText: "2023-24 ఆర్థిక సంవత్సరంలో భారతదేశం యొక్క GDP వృద్ధి రేటు కోసం లుక్ ఫార్వర్డ్: ఇండియాస్ మూమెంట్ ప్రాజెక్ట్ పేరుతో S&P గ్లోబల్ యొక్క నివేదిక ఏమిటి?",
  options: [
  "5.5%",
  "7.0%",
  "6.0%",
  "6.7%"
  ],
  correctAnswerIndex: 2,
  explanation: "S&P గ్లోబల్ యొక్క నివేదిక 2023-24 ఆర్థిక సంవత్సరంలో భారతదేశ GDP వృద్ధి రేటు 6%గా ఉంటుందని అంచనా వేసింది, ఇది భారతదేశం అత్యంత వేగంగా అభివృద్ధి చెందుతున్న పెద్ద ఆర్థిక వ్యవస్థగా మారుతుంది.",
  ),

  Question(
  questionText: "జులై 2023కి భారతదేశంలో రిటైల్ ద్రవ్యోల్బణం రేటు ఎంత, మరియు అది సెంట్రల్ బ్యాంక్ టాలరెన్స్ థ్రెషోల్డ్‌తో ఎలా పోలుస్తుంది?",
  options: [
  "6.5%, 6% టాలరెన్స్ థ్రెషోల్డ్ కంటే తక్కువ",
  "7.44%, 6% టాలరెన్స్ థ్రెషోల్డ్ పైన",
  "5.8%, 6% టాలరెన్స్ థ్రెషోల్డ్ లోపల",
  "8.2%, గణనీయంగా 6% టాలరెన్స్ థ్రెషోల్డ్ కంటే ఎక్కువ"
  ],
  correctAnswerIndex: 1,
  explanation: "జులై 2023లో, భారతదేశంలో రిటైల్ ద్రవ్యోల్బణం 7.44%కి చేరుకుంది, ఇది ఏప్రిల్ 2022 నుండి అత్యధిక రేటును సూచిస్తుంది మరియు సెంట్రల్ బ్యాంక్ యొక్క 6% టాలరెన్స్ థ్రెషోల్డ్‌ను మించిపోయింది.",
  ),

  Question(
  questionText: "జులై 2023లో హోల్‌సేల్ ప్రైస్ ఇండెక్స్ (WPI) ఎలాంటి ట్రెండ్‌ని ప్రదర్శిస్తుంది మరియు ఈ మార్పులో ఆహారం మరియు ప్రాథమిక వస్తువుల ధరలు ఏ పాత్ర పోషించాయి?",
  options: [
  "ద్రవ్యోల్బణ ధోరణులు, ఆహార ధరలలో 2% పెరుగుదల",
  "ద్రవ్యోల్బణ ధోరణులు, ఆహార ధరలలో 7.5% పెరుగుదల",
  "స్తబ్దత, ఆహారం మరియు ప్రాథమిక వస్తువుల ధరలలో క్షీణత",
  "అధిక ద్రవ్యోల్బణం, ఆహార ధరలలో 10% పెరుగుదల"
  ],
  correctAnswerIndex: 1,
  explanation: "జూలై 2023లో, టోకు ధరల సూచిక (WPI) వరుసగా నాలుగో నెలలో ప్రతి ద్రవ్యోల్బణ ధోరణులను ప్రదర్శించింది, అయితే ఆహారం మరియు ప్రాథమిక వస్తువుల ధరలలో 7.5% గణనీయమైన పెరుగుదలతో క్షీణత గణనీయంగా తగ్గించబడింది.",
  ),

  Question(
  questionText: "క్రూడ్ ఆయిల్ మరియు డీజిల్‌పై విండ్‌ఫాల్ ప్రాఫిట్ ట్యాక్స్‌కి సంబంధించి భారత ప్రభుత్వం ఇటీవల ఏ నిర్ణయం తీసుకుంది?",
  options: [
  "పన్ను పూర్తిగా రద్దు",
  "దేశీయంగా ఉత్పత్తి చేయబడిన ముడి చమురు మరియు ఎగుమతి చేయబడిన డీజిల్‌పై పన్నును పెంచింది",
  "ముడి చమురు మరియు డీజిల్‌పై పన్ను రేట్లను తగ్గించారు",
  "పన్ను భారాన్ని ఏవియేషన్ టర్బైన్ ఇంధనం (ATF)కి మార్చింది"
  ],
  correctAnswerIndex: 1,
  explanation: "భారత ప్రభుత్వం ప్రత్యేక అదనపు ఎక్సైజ్ సుంకం (SAED) విధానం ద్వారా విదేశాలకు ఏవియేషన్ టర్బైన్ ఇంధనం (ATF) రవాణాపై పన్నును తిరిగి ప్రవేశపెట్టడంతో పాటు దేశీయంగా ఉత్పత్తి చేయబడిన ముడి చమురు మరియు ఎగుమతి చేయబడిన డీజిల్‌పై విండ్‌ఫాల్ ప్రాఫిట్ ట్యాక్స్‌ని పెంచాలని నిర్ణయించింది. ",
  ),

  Question(
  questionText: "SBI రీసెర్చ్ ఆర్థికవేత్తల అధ్యయనం ప్రకారం, భారతదేశ తలసరి ఆదాయం FY23 నుండి FY47కి ఏ అంశం ద్వారా పెరుగుతుందని అంచనా వేయబడింది?",
  options: [
  "5.0 సార్లు",
  "7.5 సార్లు",
  "10.0 సార్లు",
  "3.5 సార్లు"
  ],
  correctAnswerIndex: 1,
  explanation: "SBI రీసెర్చ్ ఆర్థికవేత్తల అధ్యయనం ప్రకారం, భారతదేశ తలసరి ఆదాయం FY23లో రూ. 2 లక్షల (2,500 డాలర్లు) నుండి FY47 నాటికి సంవత్సరానికి రూ. 14.9 లక్షలకు (డాలర్లు 12,400) 7.5 రెట్లు పెరుగుతుందని అంచనా వేయబడింది.",
  ),

  Question(
  questionText: "క్రిసిల్ ప్రకారం, 2024 ఆర్థిక సంవత్సరంలో భారతదేశానికి GDP వృద్ధి అంచనా ఏమిటి?",
  options: [
  "7.5%",
  "6.0%",
  "8.0%",
  "5.5%"
  ],
  correctAnswerIndex: 1,
  explanation: "2024 ఆర్థిక సంవత్సరంలో భారతదేశ GDP వృద్ధి 6%కి చేరుతుందని క్రిసిల్ అంచనా వేసింది, ఇది 2023 ఆర్థిక సంవత్సరానికి నేషనల్ స్టాటిస్టికల్ ఆర్గనైజేషన్ (NSO) అంచనా వేసిన 7% కంటే తక్కువగా ఉంది.",
  ),

  Question(
  questionText: "ICRA రేటింగ్స్ ప్రకారం, 2023-24 ఆర్థిక సంవత్సరం మొదటి త్రైమాసికంలో భారతదేశానికి అంచనా వేసిన GDP వృద్ధి రేటు ఎంత?",
  options: [
  "6.1%",
  "8.5%",
  "7.0%",
  "5.5%"
  ],
  correctAnswerIndex: 1,
  explanation: "ఏప్రిల్-జూన్ కాలంలో భారతదేశ GDP వృద్ధి 8.5%కి పెరుగుతుందని ICRA రేటింగ్స్ అంచనా వేసింది, ఇది మునుపటి త్రైమాసికంలో (జనవరి-మార్చి) 6.1% వృద్ధి రేటు నుండి గణనీయమైన పెరుగుదల.",
  ),

  Question(
  questionText: "2023-24 ఆర్థిక సంవత్సరం మొదటి త్రైమాసికంలో భారతదేశంలోకి విదేశీ ప్రత్యక్ష పెట్టుబడుల (FDI) ప్రవాహం ఎంత తగ్గింది?",
  options: [
  "15%",
  "25%",
  "34%",
  "10%"
  ],
  correctAnswerIndex: 2,
  explanation: "తాజా ప్రభుత్వ డేటా గమనించదగ్గ విషయాన్ని వెల్లడిస్తోంది2023-24 ఆర్థిక సంవత్సరం మొదటి త్రైమాసికంలో భారతదేశంలోకి విదేశీ ప్రత్యక్ష పెట్టుబడులు (FDI) 34% క్షీణత, గత ఆర్థిక సంవత్సరం ఇదే కాలంలో 16.58 బిలియన్ డాలర్ల నుండి 10.94 బిలియన్లకు క్షీణించింది.",
  ),

  Question(
  questionText: "బోర్డు ఆఫ్ కంట్రోల్ ఫర్ క్రికెట్ ఇన్ ఇండియా (BCCI) యొక్క హోమ్ ఇంటర్నేషనల్ సిరీస్ కోసం మూడు సంవత్సరాల పాటు టైటిల్ హక్కులను ఏ బ్యాంక్ పొందింది మరియు వారు ఒక అంతర్జాతీయ మ్యాచ్‌కు ఎంత అందిస్తారు?",
  options: [
  "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా, రూ. 3 కోట్లు",
  "IDFC ఫస్ట్ బ్యాంక్, రూ. 4.2 కోట్లు",
  "HDFC బ్యాంక్, రూ. 5.5 కోట్లు",
  "ఐసిఐసిఐ బ్యాంక్, రూ. 2.8 కోట్లు"
  ],
  correctAnswerIndex: 1,
  explanation: "ఆగస్టు 25న, IDFC ఫస్ట్ బ్యాంక్ మూడు సంవత్సరాల పాటు BCCI యొక్క హోమ్ ఇంటర్నేషనల్ సిరీస్ టైటిల్ హక్కులను పొందింది మరియు ఒక్కో అంతర్జాతీయ మ్యాచ్‌కు రూ. 4.2 కోట్లు అందిస్తుంది.",
  ),

  Question(
  questionText: "కాశ్మీర్‌లోని శ్రీనగర్‌లోని దాల్ సరస్సులో అమెజాన్ ఇండియా స్టోర్ గురించి చెప్పుకోదగినది ఏమిటి?",
  options: [
  "ఇది ప్రాంతంలో అతిపెద్ద స్టోర్",
  "ఇది మొట్టమొదటి ఫ్లోటింగ్ స్టోర్",
  "ఇది ప్రత్యేకంగా ఫ్యాషన్‌పై దృష్టి పెట్టింది",
  "ఇది నగదు మాత్రమే దుకాణం"
  ],
  correctAnswerIndex: 1,
  explanation: "కశ్మీర్‌లోని శ్రీనగర్‌లోని దాల్ లేక్‌లో అమెజాన్ ఇండియా తన మొట్టమొదటి ఫ్లోటింగ్ స్టోర్‌ను ప్రారంభించింది, వినియోగదారులకు నమ్మకమైన మరియు అనుకూలమైన డెలివరీ సేవలను అందించాలనే దాని నిబద్ధతతో సరిపెట్టుకుంది.",
  ),

  Question(
  questionText: "వాణిజ్యం మరియు పరిశ్రమల మంత్రిత్వ శాఖ ప్రకారం జూన్ 2023లో భారతదేశపు ఎనిమిది ప్రధాన మౌలిక సదుపాయాల రంగాల వృద్ధి రేటు ఎంత?",
  options: [
  "5.5%",
  "8.2%",
  "6.0%",
  "7.8%"
  ],
  correctAnswerIndex: 1,
  explanation: "వాణిజ్యం మరియు పరిశ్రమల మంత్రిత్వ శాఖ ప్రకారం, భారతదేశం యొక్క ఎనిమిది ప్రధాన మౌలిక సదుపాయాల రంగాలు జూన్ 2023లో 8.2% గణనీయమైన వృద్ధి రేటును చూపించాయి, ఇది ఐదు నెలల్లో అత్యధికంగా గుర్తించబడింది.",
  ),

  Question(
  questionText: "ఎయిర్ ఇండియా యొక్క మాతృ సంస్థ అయిన టాటా సన్స్, ఎయిర్‌లైన్ రూపాన్ని మరియు బ్రాండ్ గుర్తింపు కోసం ఏ పెద్ద మార్పును ప్రవేశపెట్టింది?",
  options: [
  "కొత్త మస్కట్ పరిచయం",
  "మహారాజా' అనే మస్కట్ స్థానంలో కొత్త లోగో మరియు డిజైన్",
  "బడ్జెట్ ఎయిర్‌లైన్ మోడల్‌కి మారండి",
  "మరొక విమానయాన సంస్థతో భాగస్వామ్యం"
  ],
  correctAnswerIndex: 1,
  explanation: "ఎయిరిండియా కోసం టాటా సన్స్ కొత్త రూపాన్ని మరియు బ్రాండ్ గుర్తింపును ప్రవేశపెట్టింది, ఇందులో సుప్రసిద్ధ చిహ్నం 'మహారాజా' స్థానంలో కొత్త లోగో మరియు డిజైన్‌తో సహా.",
  ),

  Question(
  questionText: "Viacom18 దాని రెండు ఓవర్-ది-టాప్ (OTT) ప్లాట్‌ఫారమ్‌లు, JioCinema మరియు Vootలను విలీనం చేయడంలో ఏ ముఖ్యమైన పురోగతి సాధించింది?",
  options: [
  "కొత్త స్ట్రీమింగ్ సేవ ప్రారంభం",
  "టెక్నాలజీ బ్యాకెండ్‌ల అమరిక",
  "ప్లాట్‌ఫారమ్‌లలో ఒకదానిని మూసివేయడం",
  "చందా రుసుము తగ్గింపు"
  ],
  correctAnswerIndex: 1,
  explanation: "Viacom18 దాని రెండు ఓవర్-ది-టాప్ (OTT) ప్లాట్‌ఫారమ్‌లను విలీనం చేయడంలో గణనీయమైన పురోగతి సాధించింది, JioCinema మరియు Voot, ఏకీకరణ ప్రక్రియ అధునాతన దశకు చేరుకుంది, సాంకేతికత బ్యాకెండ్‌లను సమలేఖనం చేస్తుంది.",
  ),





  Question(
  questionText: 'చైనాలోని బీజింగ్‌లో చారిత్రాత్మక వర్షపాతానికి కారణమేమిటి?',
  options: [
  'టైఫూన్ డోక్సూరి',
  'తిరుగుబాటు ప్రయత్నం',
  'U.S.తో కొత్త భద్రతా ఒప్పందం',
  'క్రెడిట్ రేటింగ్ డౌన్‌గ్రేడ్'
  ],
  correctAnswerIndex: 0,
  explanation:
  'బీజింగ్‌లో చారిత్రాత్మక వర్షపాతం డోక్సురి తుఫాన్ అవశేషాల వల్ల సంభవించింది, ఫలితంగా తీవ్ర వరదలు మరియు గణనీయమైన నష్టం జరిగింది.'
  ),
  Question(
  questionText: 'జులై 26న నైజర్‌లో జరిగిన తిరుగుబాటు ప్రయత్నంలో ఎవరు తొలగించబడ్డారు?',
  options: [
  'మొహమ్మద్ బజూమ్',
  'బిక్రమ్ కేశరి అరుఖా',
  'షెహబాజ్ షరీఫ్',
  'నెల్సన్ చమీసా'
  ],
  correctAnswerIndex: 0,
  explanation:
  '2021లో అధికారంలోకి వచ్చిన ప్రెసిడెంట్ మొహమ్మద్ బజౌమ్, నైజర్‌లో జరిగిన తిరుగుబాటు ప్రయత్నంలో తిరుగుబాటు చేసిన సైనికులచే తొలగించబడ్డాడు.'
  ),
  Question(
  questionText: 'అమెరికాతో పాకిస్థాన్ ఆమోదించిన కొత్త భద్రతా ఒప్పందం పేరు ఏమిటి?',
  options: [
  'AAA+',
  'BRI',
  'CIS-MOA',
  'AUKUS'
  ],
  correctAnswerIndex: 2,
  explanation: 'U.S.తో మెరుగైన రక్షణ సంబంధాల కోసం కమ్యూనికేషన్ ఇంటర్‌ఆపరబిలిటీ అండ్ సెక్యూరిటీ మెమోరాండం ఆఫ్ అగ్రిమెంట్ (CIS-MOA)ని పాకిస్థాన్ ఆమోదించింది.'
  ),
  Question(
  questionText:
  'యునైటెడ్ స్టేట్స్\' క్రెడిట్ రేటింగ్‌ను ఏ గ్లోబల్ రేటింగ్ ఏజెన్సీ డౌన్‌గ్రేడ్ చేసింది?',
  options: [
  'మూడీస్',
  'S&P గ్లోబల్',
  'ఫిచ్',
  'ప్రామాణిక & పేదలు'
  ],
  correctAnswerIndex: 2,
  explanation:
  'ఫిచ్ యునైటెడ్ స్టేట్స్\' క్రెడిట్ రేటింగ్‌ను AAA నుండి AA+కి తగ్గించింది, దీని వలన దేశం యొక్క రుణాలను తిరిగి చెల్లించే సామర్థ్యంపై ఆందోళనలు తలెత్తాయి.'
  ),
  Question(
  questionText:
  'ప్రజారోగ్య సమస్యగా ట్రాకోమాను తొలగించినందుకు WHOచే ఏ దేశం గుర్తించబడింది?',
  options: [
  'ఇరాక్',
  'కంబోడియా',
  'భారతదేశం',
  'జింబాబ్వే'
  ],
  correctAnswerIndex: 0,
  explanation:
  'ప్రజారోగ్య సమస్యగా ట్రాకోమాను తొలగించిన 18వ దేశంగా ఇరాక్ అధికారికంగా ప్రపంచ ఆరోగ్య సంస్థ (WHO)చే గుర్తించబడింది.'
  ),
  Question(
  questionText:
  'UKలో వేగంగా వ్యాప్తి చెందుతున్న కొత్త కోవిడ్ వేరియంట్ పేరు ఏమిటి?',
  options: [
  'డెల్టా',
  'ఓమిక్రాన్',
  'ఎరిస్ లేదా EG.5.1',
  'ఆల్ఫా'
  ],
  correctAnswerIndex: 2,
  explanation:
  'ఒక కొత్త COVID వేరియంట్, Eris లేదా EG.5.1, UK అంతటా మరియు ప్రపంచవ్యాప్తంగా వేగంగా వ్యాప్తి చెందుతోంది, UKలోని ప్రతి ఏడు COVID-19 కేసులలో ఒకదానికి లింక్ చేస్తోంది.'
  ),
  Question(
  questionText:
  'కంబోడియా రాజు దేశానికి కొత్త నాయకుడిగా ఎవరిని నియమించాడు?',
  options: [
  'హున్ సేన్',
  'కింగ్ నోరోడోమ్ సిహమోని',
  'హన్ మానెట్',
  'కిరియాకోస్ మిత్సోటాకిస్'
  ],
  correctAnswerIndex: 2,
  explanation:
  'కంబోడియా రాజు హున్ మానెట్‌ను ప్రధానమంత్రిగా నియమించాడు, ఇది హున్ సేన్ నుండి అధికారాన్ని అప్పగించడానికి నాంది పలికింది.'
  ),
  Question(
  questionText:
  'నేపాల్‌లోని లుంబినిలో అంతర్జాతీయ బౌద్ధ సమాఖ్య ఏ వేడుకను నిర్వహించింది?',
  options: [
  'ఎన్నికల వేడుక',
  'IICBCH కోసం భూమి పూజ',
  'పట్టాభిషేక వేడుక',
  'వాణిజ్య ఒప్పందంపై సంతకాలు'
  ],
  correctAnswerIndex: 1,
  explanation:
  'నేపాల్‌లోని లుంబినిలో ఇండియా ఇంటర్నేషనల్ సెంటర్ ఫర్ బౌద్ధ సంస్కృతి మరియు వారసత్వం (IICBCH) నిర్మాణానికి అంతర్జాతీయ బౌద్ధ సమాఖ్య భూమి పూజ కార్యక్రమాన్ని నిర్వహించింది.'
  ),
  Question(
  questionText:
  'జులై 2023లో గ్రహం ఎలాంటి భయంకరమైన ధోరణిని ఎదుర్కొంది?',
  options: [
  'ప్రపంచ ఆర్థిక మాంద్యం',
  'ఉష్ణోగ్రతలు పెరుగుదల'
  'దౌత్య సంఘర్షణల పెరుగుదల',
  'పాండమిక్ పునరుజ్జీవనం'
  ],
  correctAnswerIndex: 1,
  explanation:
  'జూలై 2023లో, గ్రహం ఉష్ణోగ్రతలలో అపూర్వమైన పెరుగుదలను చవిచూసింది, ఇది ఇప్పటివరకు నమోదైన అత్యంత వేడి నెలగా గుర్తించబడింది.'
  ),
  Question(
  questionText:
  'ఆగస్టు 2023లో నివేదించినట్లుగా చైనా ఎలాంటి ఆర్థిక సవాలును ఎదుర్కొంటోంది?',
  options: [
  'ద్రవ్యోల్బణం',
  'ఆర్థిక వృద్ధి',
  'వాణిజ్య మిగులు',
  'ప్రతి ద్రవ్యోల్బణం'
  ],
  correctAnswerIndex: 3,
  explanation:
  'చైనా ప్రతి ద్రవ్యోల్బణం ఎదుర్కొంటోంది, దాని ఆర్థిక అవకాశాలు మరియు బీజింగ్ నుండి బలమైన విధాన ప్రతిస్పందనల ఆవశ్యకత గురించి ఆందోళనలను రేకెత్తిస్తోంది.'
  ),
  Question(
  questionText:
  'ఇరాక్ మీడియా రెగ్యులేటరీ బాడీ ఏ పదాన్ని ఉపయోగించడాన్ని నిషేధించింది?',
  options: [
  'ఉగ్రవాదం',
  'లైంగిక విచలనం',
  'సెన్సార్‌షిప్',
  'రాజకీయ ప్రచారం'
  ],
  correctAnswerIndex: 1,
  explanation:
  'ఇరాక్ యొక్క మీడియా నియంత్రణ సంస్థ \'స్వలింగసంపర్కం\' అనే పదాన్ని ఉపయోగించడంపై నిషేధాన్ని జారీ చేసింది, బదులుగా \'లైంగిక విచలనం\'ని ఉపయోగించమని సూచించింది.'
  ),
  Question(
  questionText:
  'పాకిస్తాన్ అధ్యక్షుడు ఆ దేశ పార్లమెంటును ఎందుకు రద్దు చేశారు?',
  options: [
  'ఆర్థిక మాంద్యం',
  'రాజకీయ మరియు ఆర్థిక సవాళ్లు',
  'విదేశీ జోక్యం',
  'సైనిక తిరుగుబాటు'
  ],
  correctAnswerIndex: 1,
  explanation:
  'రాజకీయ మరియు ఆర్థిక సవాళ్ల మధ్య, ప్రధాని షెహబాజ్ షరీఫ్ సిఫార్సు మేరకు పాకిస్థాన్ అధ్యక్షుడు ఆ దేశ పార్లమెంట్‌ను రద్దు చేశారు.'
  ),
  Question(
  questionText:
  'AUKUS (ఆస్ట్రేలియా, యునైటెడ్ కింగ్‌డమ్, యునైటెడ్ స్టేట్స్) ఒప్పందం యొక్క దృష్టి ఏమిటి?',
  options: [
  'వాతావరణ మార్పు',
  'ఆర్థిక అభివృద్ధి',
  'అణుశక్తితో నడిచే జలాంతర్గాములు',
  'ప్రాంతీయ వాణిజ్యం'
  ],
  correctAnswerIndex: 2,
  explanation:
  'ఆస్ట్రేలియాకు అణుశక్తితో నడిచే జలాంతర్గాములను సరఫరా చేయడంపై మొదట దృష్టి సారించిన AUKUS ఒప్పందం, అధునాతన హైపర్‌సోనిక్ మరియు సుదూర శ్రేణి ఖచ్చితత్వ ఆయుధాలను పరీక్షించడంలో దాని సంభావ్య పాత్ర కోసం దృష్టిని ఆకర్షించింది.'
  ),
  Question(
  questionText:
  'చైనా ఆర్థిక అవకాశాల గురించి ఆందోళనలను రేకెత్తించింది ఏమిటి?',
  options: [
  'ద్రవ్యోల్బణం',
  'వాణిజ్య మిగులు',
  'ఆర్థిక వృద్ధి',
  'ప్రతి ద్రవ్యోల్బణం'
  ],
  correctAnswerIndex: 3,
  explanation:
  'చైనాలో ఇటీవలి ప్రతి ద్రవ్యోల్బణం సంభవించడం దాని ఆర్థిక అవకాశాల గురించి ఆందోళనలను రేకెత్తించింది, బీజింగ్ నుండి బలమైన విధాన ప్రతిస్పందనల అవసరాన్ని నొక్కి చెప్పింది.'
  ),
  Question(
  questionText:
  'జులై 26న నైజర్‌లో జరిగిన తిరుగుబాటు తర్వాత ఏ సంస్థ క్లిష్టమైన పరిస్థితిని ఎదుర్కొంటుంది?',
  options: [
  'ఐక్యరాజ్యసమితి',
  'ఐరోపా సంఘము',
  'ఆసియాన్',
  'ఎకోవాస్'
  ],
  correctAnswerIndex: 3,
  explanation:
  'జులై 26న నైజర్‌లో జరిగిన తిరుగుబాటు తరువాత, పశ్చిమ ఆఫ్రికా రాష్ట్రాల ఆర్థిక సంఘం (ECOWAS) ఒక క్లిష్టమైన పరిస్థితిని ఎదుర్కొంటుంది, తిరుగుబాటు నాయకులు తొలగించబడిన అధ్యక్షుడిని తిరిగి నియమించడానికి గడువులను ధిక్కరించారు.'
  ),
  Question(
  questionText:
  'కెనడాలోని అంతర్జాతీయ విద్యార్థుల కోసం అధికారికంగా ఏ ఆంగ్ల భాషా ప్రావీణ్యత పరీక్ష అనుమతించబడింది?',
  options: [
  'టోఫెల్',
  'IELTS',
  'పియర్సన్ PTE అకడమిక్',
  'కేంబ్రిడ్జ్ ఇంగ్లీష్'
  ],
  correctAnswerIndex: 2,
  explanation:"కెనడా యొక్క ఇమ్మిగ్రేషన్, రెఫ్యూజీస్ మరియు సిటిజెన్‌షిప్ కెనడా (IRCC) పియర్సన్ యొక్క PTE అకడమిక్ పరీక్షను అంతర్జాతీయ విద్యార్థుల కోసం ఆంగ్ల భాషా ప్రావీణ్య అంచనాగా ఉపయోగించడాన్ని అధికారికంగా ఆమోదించింది."
  ),
  Question(
  questionText:
  'ఒక దేశానికి తాత్కాలిక ప్రధానమంత్రిగా ఎవరు ప్రమాణం చేశారు?',
  options: [
  'ఎమ్మర్సన్ మ్నంగాగ్వా',
  'హన్ మానెట్',
  'అన్వరుల్ హక్ కకర్',
  'శ్రేష్ఠ తవిసిన్'
  ],
  correctAnswerIndex: 2,
  explanation:
  'ప్రముఖ జాతి పుష్తున్ నాయకుడు అన్వరుల్ హక్ కకర్, రాబోయే సార్వత్రిక ఎన్నికలను పర్యవేక్షించడం మరియు ఆర్థిక సవాళ్లను పరిష్కరించడం వంటి బాధ్యతలతో ఒక దేశానికి తాత్కాలిక ప్రధానమంత్రిగా ప్రమాణం చేశారు.'
  ),
  Question(
  questionText:
  'ఆగస్టు 2023లో నివేదించినట్లుగా ఏ దేశం మాంద్యంలోకి ప్రవేశించింది?',
  options: [
  'జర్మనీ',
  'ఫ్రాన్స్',
  'నేదర్లాండ్స్',
  'ఇటలీ'
  ],
  correctAnswerIndex: 2,
  explanation:
  'డచ్ ఆర్థిక వ్యవస్థ మాంద్యంలోకి ప్రవేశించింది, 2023 రెండవ త్రైమాసికంలో త్రైమాసిక ప్రాతిపదికన 0.3% తగ్గిపోయింది.'
  ),
  Question(
  questionText:
  'చైనా లోపలి మంగోలియా ప్రాంతంలో ఏ అంటు వ్యాధి నివేదించబడింది?',
  options: [
  'COVID-19',
  'బుబోనిక్ ప్లేగు',
  'ఎబోలా',
  'జికా వైరస్'
  ],
  correctAnswerIndex: 1,
  explanation:
  'చైనా యొక్క అంతర్గత మంగోలియా ప్రాంతం బుబోనిక్ ప్లేగు యొక్క రెండు కేసులను నివేదించింది, ఇది ఆందోళనలను కలిగిస్తుంది మరియు అప్రమత్తమైన నియంత్రణ ప్రయత్నాల అవసరాన్ని హైలైట్ చేస్తుంది.'
  ),
  Question(
  questionText:
  'రష్యా ఆర్కిటిక్ ప్రాంతంతో ఏ దేశం సహకారాన్ని పెంచింది?',
  options: [
  'చైనా',
  'భారతదేశం',
  'బ్రెజిల్',
  'దక్షిణ ఆఫ్రికా'
  ],
  correctAnswerIndex: 1,
  explanation:
  'రష్యా ఆర్కిటిక్ ప్రాంతంతో భారతదేశ సహకారం పెరుగుతోంది, మర్మాన్స్క్ నౌకాశ్రయంలో నిర్వహించే కార్గోకు దాని గణనీయమైన సహకారం దీనికి నిదర్శనం.'
  ),
  Question(
  questionText:
  'ఆగస్టు 1 నుంచి భారత ప్రయాణికుల కోసం రష్యా ఏ సౌకర్యాన్ని ప్రారంభించింది?',
  options: [
  'రెగ్యులర్ వీసా సౌకర్యం',
  'అత్యవసర వీసా సౌకర్యం',
  'ఈ-వీసా సౌకర్యం',
  'వర్క్ వీసా సౌకర్యం'
  ],
  correctAnswerIndex: 2,
  explanation:
  'ఆగస్టు 1 నుంచి భారతీయుల కోసం రష్యా ఇ-వీసా సదుపాయాన్ని ప్రారంభించింది, దీని ద్వారా ఆ దేశానికి వెళ్లే ప్రయాణికులు సాధారణ వీసా పొందడంలో ఉన్న ఇబ్బందులను అధిగమించవచ్చు.'
  ),
  Question(
  questionText:
  'అమెజాన్ రెయిన్‌ఫారెస్ట్‌లో పిరిప్‌కురా తెగకు సంబంధించిన అసాధారణ కథ ఏమిటి?',
  options: [
  'కొత్త జాతుల ఆవిష్కరణ',
  'అటవీ సంరక్షణ ప్రయత్నాలు',
  'పిరిప్‌కురా తెగ తిరుగుబాటు',
  'ఆధునిక ఆక్రమణలకు వ్యతిరేకంగా పోరాటం'
  ],
  correctAnswerIndex: 3,
  explanation:
  'అమెజాన్ రెయిన్‌ఫారెస్ట్ గుండె లోతులో పిరిప్‌కురా తెగకు సంబంధించిన ఒక అసాధారణ కథ ఉంది, ఆధునిక ప్రపంచం ఆక్రమణకు వ్యతిరేకంగా వారి అలుపెరగని పోరాటాన్ని హైలైట్ చేస్తుంది.'
  ),
  Question(
  questionText:
  'థాయ్‌లాండ్ కొత్త ప్రధానమంత్రిగా ఎవరు ఎన్నికయ్యారు?',
  options: [
  'ప్రయుత్ చాన్-ఓ-చా',
  'శ్రేష్ఠ తవిసిన్',
  'అన్వర్ ఇబ్రహీం',
  'యింగ్లక్ షినవత్రా'
  ],
  correctAnswerIndex: 1,
  explanation:
  'పార్లమెంటరీ ఓటింగ్‌లో నిర్ణయాత్మక విజయం తర్వాత థాయ్ ఆస్తి వ్యాపారవేత్త స్రెట్టా థావిసిన్ థాయ్‌లాండ్ కొత్త ప్రధానమంత్రిగా ఎన్నికయ్యారు.'
  ),
  Question(
  questionText:
  'శిశువులలో RSV-అనుబంధ LRTD నివారణకు U.S. FDA ఇటీవలి ఏ ఆమోదాన్ని మంజూరు చేసింది?',
  options: [
  'కోవిడ్-19కి టీకా',
  'RSV టీకా',
  'ఫ్లూ వ్యాక్సిన్',
  'మీజిల్స్ వ్యాక్సిన్'
  ],
  correctAnswerIndex: 1,
  explanation:'U.S. ఫుడ్ అండ్ డ్రగ్ అడ్మినిస్ట్రేషన్ (FDA) ఇటీవలే రెస్పిరేటరీ సిన్సిటియల్ వైరస్ (RSV)-అసోసియేటెడ్ లోయర్ రెస్పిరేటరీ ట్రాక్ట్ డిసీజ్ (LRTD) మరియు 6 నెలల వరకు పుట్టిన శిశువులలో తీవ్రమైన కేసులను అరికట్టడానికి రూపొందించిన మొదటి వ్యాక్సిన్‌కు ఆమోదం తెలిపింది.'
  ),
  Question(
  questionText:
  'ఆఫ్రికన్ స్వైన్ ఫీవర్ (ASF) వైరస్ దాని పునరుజ్జీవనం నుండి ఎలాంటి ప్రపంచ ప్రభావాన్ని చూపింది?',
  options: [
  'ఆర్థిక మాంద్యం',
  'పాండమిక్ పునరుజ్జీవనం',
  'వ్యవసాయ ఉత్పాదకత పెరుగుదల',
  'పందుల జనాభా నష్టం'
  ],
  correctAnswerIndex: 3,
  explanation:
  'జనవరి 2021లో తిరిగి పుంజుకున్నప్పటి నుండి, అత్యంత అంటువ్యాధి అయిన ఆఫ్రికన్ స్వైన్ ఫీవర్ (ASF) వైరస్ ప్రపంచవ్యాప్తంగా వ్యాపించింది, ఈ సమయంలో 1.5 మిలియన్లకు పైగా పందుల నష్టాన్ని కలిగించింది.'
  ),
  Question(
  questionText:
  'బ్రిక్స్ కూటమి ఆగస్టు 2023లో ఏ విస్తరణను ప్రకటించింది?',
  options: [
  'ఆర్థిక ఆంక్షలు',
  'సైనిక కూటమి',
  'కొత్త సభ్య దేశాల చేరిక',
  'కూటమి రద్దు'
  ],
  correctAnswerIndex: 2,
  explanation:
  'గణనీయ భౌగోళిక రాజకీయ అభివృద్ధిలో, బ్రిక్స్ కూటమి ఆరు కొత్త సభ్య దేశాల చేరికను ప్రకటించింది, ప్రపంచ సహకారం యొక్క గతిశీలతను పునర్నిర్మించింది.'
  ),
  Question(
  questionText:
  'ఆగస్టు 2023లో ఇరాన్ ఏ అత్యాధునిక మానవరహిత వైమానిక సాంకేతికతను పరిచయం చేసింది?',
  options: [
  'ప్రిడేటర్ డ్రోన్',
  'రీపర్ డ్రోన్',
  'మొహజర్-10 డ్రోన్',
  'గ్లోబల్ హాక్ డ్రోన్'
  ],
  correctAnswerIndex: 2,
  explanation:
  'ఇరానియన్ సీనియర్ అధికారులు హాజరైన ఒక ముఖ్యమైన కార్యక్రమంలో, ఇస్లామిక్ రిపబ్లిక్ మానవరహిత వైమానిక సాంకేతికతలో దాని తాజా విజయాన్ని పరిచయం చేసింది - మొహజెర్-10 డ్రోన్.'
  ),
  Question(
  questionText:
  '40 ఏళ్లలో గ్రీస్‌ను సందర్శించిన తొలి భారత ప్రధాని ఎవరు?',
  options: [
  'ఇందిరా గాంధీ',
  'నరేంద్ర మోదీ'
  'మన్మోహన్ సింగ్'
  'అటల్ బిహారీ వాజ్‌పేయి'
  ],
  correctAnswerIndex: 1,
  explanation:
  'భారత ప్రధాని నరేంద్ర మోదీ గ్రీస్‌లో మైలురాయి పర్యటనను ప్రారంభించారు, 40 ఏళ్లలో దేశంలో అడుగు పెట్టిన మొదటి భారత ప్రధానిగా నిలిచారు.'
  ),

  Question(
  questionText: "స్వాతంత్ర్య దినోత్సవం సందర్భంగా ప్రధాన మంత్రి నరేంద్ర మోడీ ఏ ప్రచారాన్ని ప్రకటించారు?",
  options: [
  "నమోః 108",
  "PM-eBus సేవా",
  "మేరీ మతి మేరా దేశ్",
  "ఉన్మేషా ఇంటర్నేషనల్ లిటరేచర్ ఫెస్టివల్"
  ],
  correctAnswerIndex: 2,
  explanation: "అమరవీరుల గౌరవార్థం స్వాతంత్ర్య దినోత్సవం సందర్భంగా 'మేరీ మతి మేరా దేశ్' ప్రచారాన్ని ప్రారంభిస్తున్నట్లు ప్రధాని నరేంద్ర మోదీ ప్రకటించారు.దేశం యొక్క ధైర్య హృదయులు."
  ),

  Question(
  questionText: "అఖిల భారతీయ శిక్షా సమాగం 2023లో ఏ చొరవ ప్రారంభించబడింది?",
  options: [
  "నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ",
  "రిసోర్స్ ఎఫిషియన్సీ సర్క్యులర్ ఎకానమీ ఇండస్ట్రీ కూటమి",
  "ఉల్లాస్: నవ భారత్ సాక్షరత కార్యక్రమం",
  "భారత్ న్యూ కార్ అసెస్‌మెంట్ ప్రోగ్రామ్"
  ],
  correctAnswerIndex: 2,
  explanation: "ఉల్లాస్: నవ్ భారత్ సాక్షరత కార్యక్రమం అఖిల భారతీయ శిక్షా సమాగం 2023లో ప్రారంభించబడింది, ఇది సమగ్ర అభ్యాస పర్యావరణ వ్యవస్థను సృష్టించడం ద్వారా భారతదేశంలో విద్య మరియు అక్షరాస్యతను విప్లవాత్మకంగా మార్చే లక్ష్యంతో ఉంది."
  ),

  Question(
  questionText: "రిసోర్స్ ఎఫిషియెన్సీ సర్క్యులర్ ఎకానమీ ఇండస్ట్రీ కూటమి (RECEIC)ని ఏ మంత్రిత్వ శాఖ ప్రారంభించింది?",
  options: [
  "హోం వ్యవహారాల మంత్రిత్వ శాఖ",
  "కేంద్ర విద్యా మంత్రిత్వ శాఖ",
  "ఆర్థిక మంత్రిత్వ శాఖ",
  "కేంద్ర మంత్రి భూపేందర్ యాదవ్"
  ],
  correctAnswerIndex: 3,
  explanation: "కేంద్ర మంత్రి భూపేందర్ యాదవ్, భారతదేశం యొక్క G20 ప్రెసిడెన్సీకి అనుగుణంగా, వనరుల సమర్థత మరియు వృత్తాకార ఆర్థిక విధానాలను ప్రోత్సహించడానికి చెన్నైలో రిసోర్స్ ఎఫిషియెన్సీ సర్క్యులర్ ఎకానమీ ఇండస్ట్రీ కోయలిషన్ (RECEIC)ని ప్రారంభించారు."
  ),

  Question(
  questionText: "ఒక ఎమ్మెల్యేకు అత్యధిక సగటు ఆస్తులు మరియు అత్యధిక సంఖ్యలో బిలియనీర్ ఎమ్మెల్యేలతో ఏ రాష్ట్రం ఉద్భవించింది?",
  options: [
  "ఉత్తర ప్రదేశ్",
  "కర్ణాటక",
  "మహారాష్ట్ర",
  "ఢిల్లీ"
  ],
  correctAnswerIndex: 1,
  explanation: "అసోసియేషన్ ఫర్ డెమోక్రటిక్ రిఫార్మ్స్ (ADR) విశ్లేషణ ప్రకారం, ఒక ఎమ్మెల్యేకు అత్యధిక సగటు ఆస్తులు మరియు అత్యధిక సంఖ్యలో బిలియనీర్ ఎమ్మెల్యేలు కలిగిన రాష్ట్రంగా కర్ణాటక ఉద్భవించింది."
  ),

  Question(
  questionText: "గనులు మరియు ఖనిజాలు (అభివృద్ధి మరియు నియంత్రణ) సవరణ బిల్లు, 2023 ఏమి అనుమతిస్తుంది?",
  options: [
  "అన్ని మైనింగ్ కార్యకలాపాల ప్రైవేటీకరణ",
  "అన్ని ఖనిజాల కోసం మైనింగ్ కార్యకలాపాలు",
  "అణు ఖనిజాలు మరియు లోతైన ఖనిజాల కోసం మైనింగ్ కార్యకలాపాలు",
  'మైనింగ్ కార్యకలాపాలపై నిషేధం'
  ],
  correctAnswerIndex: 2,
  explanation: "గనులు మరియు ఖనిజాలు (అభివృద్ధి మరియు నియంత్రణ) సవరణ బిల్లు, 2023, లిథియంతో సహా 12 అణు ఖనిజాలలో ఆరింటికి, అలాగే బంగారం మరియు వెండి వంటి లోతైన ఖనిజాలతో పాటు మైనింగ్ కార్యకలాపాలను ప్రైవేట్ రంగం చేపట్టేందుకు వీలు కల్పిస్తుంది."
  ),

  Question(
  questionText: "ఆగస్టు 2న కేంద్ర విద్యా మంత్రిత్వ శాఖ ఏమి ఏర్పాటు చేసింది?",
  options: [
  "నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ (NDTSP) కన్సార్టియం",
  "వివక్ష వ్యతిరేక మార్గదర్శకాల కోసం నిపుణుల ప్యానెల్",
  "ఉన్మేషా ఇంటర్నేషనల్ లిటరేచర్ ఫెస్టివల్",
  "రాజమార్గయాత్ర మొబైల్ అప్లికేషన్"
  ],
  correctAnswerIndex: 1,
  explanation: "ఉన్నత విద్యా సంస్థల్లో షెడ్యూల్డ్ కులం, ఎస్టీ, ఓబీసీ, వికలాంగులు మరియు ఇతర మైనారిటీలకు సంబంధించి వివక్ష వ్యతిరేక మార్గదర్శకాలను సవరించడానికి కేంద్ర విద్యా మంత్రిత్వ శాఖ ఆగస్టు 2న నిపుణుల ప్యానెల్‌ను ఏర్పాటు చేసింది."
  ),

  Question(
  questionText: "నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ (NDTSP) కన్సార్టియం ద్వారా ఏమి ఆవిష్కరించబడింది?",
  options: [
  "డ్రాఫ్ట్ నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ",
  "రాజమార్గయాత్ర మొబైల్ అప్లికేషన్",
  "గవర్నమెంట్ ఆఫ్ నేషనల్ క్యాపిటల్ టెరిటరీ ఆఫ్ ఢిల్లీ (సవరణ) బిల్లు, 2023",
  "నేషనల్ న్యూ కార్ అసెస్‌మెంట్ ప్రోగ్రామ్ (NCAP)"
  ],
  correctAnswerIndex: 0,
  explanation: "నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ (NDTSP) కన్సార్టియం ఇండియన్ డీప్ టెక్ స్టార్టప్ ఎకోసిస్టమ్‌ను బలోపేతం చేయడానికి ఉద్దేశించి, పబ్లిక్ కన్సల్టేషన్ కోసం నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ డ్రాఫ్ట్‌ను ఆవిష్కరించింది."
  ),

  Question(
  questionText: "భారత రాష్ట్రపతి భోపాల్‌లో ఏ పండుగలు ప్రారంభించారు?",
  options: [
  "హోలీ మరియు దీపావళి పండుగలు",
  "అంతర్జాతీయ సాహిత్య ఉత్సవం మరియు జానపద మరియు గిరిజన ప్రదర్శన కళల ఉత్సవం",
  "నవరాత్రి మరియు దుర్గా పూజ",
  "క్రిస్మస్ మరియు నూతన సంవత్సర వేడుకలు"
  ],
  correctAnswerIndex: 1,
  explanation: "భారత రాష్ట్రపతి 'ఉన్మేషా' ఇంటర్నేషనల్ లిటరేచర్ ఫెస్టివల్ మరియు 'ఉత్కర్ష్' ఫెస్టివల్ ఆఫ్ జానపద మరియు గిరిజన ప్రదర్శన కళలను మధ్యప్రదేశ్‌లోని భోపాల్‌లో ప్రారంభించారు, వీటిని వరుసగా సాహిత్య అకాడమీ మరియు సంగీత నాటక అకాడమీ నిర్వహించాయి."
  ),

  Question(
  questionText: "హైవే యూజర్ అనుభవాన్ని మెరుగుపరచడానికి నేషనల్ హైవేస్ అథారిటీ ఆఫ్ ఇండియా (NHAI) ఏ ముఖ్యమైన చర్య తీసుకుంది?",
  options: [
  "రాజమార్గ్యత్ర' మొబైల్ అప్లికేషన్ పరిచయం",
  "జాతీయ రహదారుల ప్రైవేటీకరణ",
  "కొత్త రహదారుల నిర్మాణం",
  "హైవే ప్రయాణంపై నిషేధం"
  ],
  correctAnswerIndex: 0,
  explanation: "భారతీయ జాతీయ రహదారుల అథారిటీ (NHAI) జాతీయ రహదారి వినియోగదారుల కోసం సమగ్ర సమాచారం మరియు సమర్థవంతమైన ఫిర్యాదు పరిష్కారాన్ని అందించడానికి 'రాజ్‌మార్గయాత్ర' మొబైల్ అప్లికేషన్‌ను ప్రవేశపెట్టింది, ప్రయాణాన్ని సురక్షితంగా మరియు మరింత సౌకర్యవంతంగా చేయాలనే లక్ష్యంతో."
  ),

  Question(
  questionText: "ఢిల్లీలో సేవల నియంత్రణకు సంబంధించి లోక్‌సభ ఏ బిల్లును ఆమోదించింది?",
  options: [
  "గవర్నమెంట్ ఆఫ్ నేషనల్ క్యాపిటల్ టెరిటరీ ఆఫ్ ఢిల్లీ (సవరణ) బిల్లు, 2023",
  "గనులు మరియు ఖనిజాలు (అభివృద్ధి మరియు నియంత్రణ) సవరణ బిల్లు, 2023",
  "వివక్ష నిరోధక మార్గదర్శకాల బిల్లు",
  "డీప్ టెక్ స్టార్టప్ పాలసీ బిల్లు"
  ],
  correctAnswerIndex: 0,
  explanation: "లోక్‌సభ ఆమోదించిందిఢిల్లీలోని ప్రభుత్వ సేవల నియంత్రణపై ఆర్డినెన్స్‌ను భర్తీ చేస్తూ నేషనల్ క్యాపిటల్ టెరిటరీ ఆఫ్ ఢిల్లీ (సవరణ) బిల్లు, 2023, దీనిని నిరసనలు మరియు కొన్ని ప్రతిపక్ష పార్టీలు వాకౌట్ చేశాయి."
  ),

  Question(
  questionText: "ఏ రెండు చమురు రంగ కంపెనీలు మహారత్న మరియు నవరత్న వర్గాలకు ఎలివేట్ చేయబడ్డాయి?",
  options: [
  "ONGC మరియు ఇండియన్ ఆయిల్ కార్పొరేషన్",
  "ఆయిల్ ఇండియా మరియు ONGC విదేశీ",
  "రిలయన్స్ ఇండస్ట్రీస్ మరియు BPCL",
  "HPCL మరియు GAIL"
  ],
  correctAnswerIndex: 1,
  explanation: "భారత ఆర్థిక మంత్రిత్వ శాఖ ఆయిల్ ఇండియాను గౌరవనీయమైన మహారత్న కేటగిరీకి మరియు ONGC విదేశ్‌ను నవరత్న కేటగిరీకి ఎలివేట్ చేసింది, పెట్టుబడి, జాయింట్ వెంచర్ స్థాపన మరియు ఇతర ఆర్థిక నిర్ణయాలకు స్వయంప్రతిపత్తిని పెంచింది."
  ),

  Question(
  questionText: "ఆయుష్ సిస్టమ్స్ కింద చికిత్స పొందే విదేశీ పౌరుల కోసం హోం వ్యవహారాల మంత్రిత్వ శాఖ ఏ కొత్త వీసా కేటగిరీని ప్రవేశపెట్టింది?",
  options: [
  "మెడికల్ వీసా",
  "పర్యాటక వీసా",
  "వ్యాపార ఆధారిత ప్రవేశ ముద్రితము",
  "ఆయుష్ (AY) వీసా"
  ],
  correctAnswerIndex: 3,
  explanation: "ఆయుష్ సిస్టమ్స్/ఇండియన్ సిస్టమ్స్ ఆఫ్ మెడిసిన్ ఆఫ్ థెరప్యూటిక్ కేర్, వెల్‌నెస్ మరియు యోగా కింద చికిత్స పొందుతున్న విదేశీ పౌరుల కోసం హోం వ్యవహారాల మంత్రిత్వ శాఖ కొత్త ఆయుష్ (AY) వీసాను ప్రవేశపెట్టింది."
  ),

  Question(
  questionText: "2016లో ప్రారంభించినప్పటి నుండి స్టార్టప్ ఇండియా చొరవ కింద ఎన్ని సంస్థలు గుర్తించబడ్డాయి?",
  options: [
  "50,000 ఎంటిటీలు",
  "78,234 ఎంటిటీలు",
  "98,911 ఎంటిటీలు",
  "120,000 సంస్థలు"
  ],
  correctAnswerIndex: 2,
  explanation: "డిపార్ట్‌మెంట్ ఫర్ ప్రమోషన్ ఆఫ్ ఇండస్ట్రీ అండ్ ఇంటర్నల్ ట్రేడ్ (DPIIT) జనవరి 16, 2016న ప్రారంభించినప్పటి నుండి స్టార్టప్ ఇండియా చొరవ కింద 98,911 ఎంటిటీలను గుర్తించింది."
  ),

  Question(
  questionText: "డైరెక్టరేట్ జనరల్ ఆఫ్ ఫారిన్ ట్రేడ్ (DGFT) ఏ దిగుమతి పరిమితులను వాయిదా వేసింది?",
  options: [
  "లగ్జరీ వస్తువుల దిగుమతి",
  "వ్యవసాయ ఉత్పత్తుల దిగుమతి",
  "ల్యాప్‌టాప్‌లు, టాబ్లెట్‌లు మరియు వ్యక్తిగత కంప్యూటర్‌ల దిగుమతి",
  "ఆటోమొబైల్స్ దిగుమతి"
  ],
  correctAnswerIndex: 2,
  explanation: "భద్రతా సమస్యలు మరియు దేశీయ తయారీని పెంచడం కోసం భారతదేశంలోని ల్యాప్‌టాప్‌లు, టాబ్లెట్‌లు మరియు వ్యక్తిగత కంప్యూటర్‌ల దిగుమతికి లైసెన్సింగ్ ఆదేశాన్ని నవంబర్ 1, 2023 వరకు వాయిదా వేస్తున్నట్లు DGFT ప్రకటించింది."
  ),

  Question(
  questionText: "చైల్డ్ కేర్ ఇన్‌స్టిట్యూషన్‌ల నిజ-సమయ పర్యవేక్షణ కోసం నేషనల్ కమీషన్ ఫర్ ప్రొటెక్షన్ ఆఫ్ చైల్డ్ రైట్స్ (NCPCR) ఏ అప్లికేషన్‌ను అభివృద్ధి చేసింది?",
  options: [
  "MASI",
  "ఫ్లడ్ వాచ్",
  "రాజమార్గయాత్ర",
  "సుస్వగతం"
  ],
  correctAnswerIndex: 0,
  explanation: "NCPCR దేశవ్యాప్తంగా చైల్డ్ కేర్ ఇన్‌స్టిట్యూషన్‌ల (CCIలు) నిజ-సమయ పర్యవేక్షణ మరియు వాటి తనిఖీ ప్రక్రియ కోసం 'MASI' అప్లికేషన్‌ను అభివృద్ధి చేసింది."
  ),

  Question(
  questionText: "జమ్మూ కాశ్మీర్‌లో ఆర్టికల్ 370 రద్దు చేసి ఎన్ని సంవత్సరాలు గడిచాయి?",
  options: [
  "1 సంవత్సరం",
  "2 సంవత్సరాలు",
  "3 సంవత్సరాల",
  "4 సంవత్సరాలు"
  ],
  correctAnswerIndex: 3,
  explanation: "ఆగస్టు 5, 2023 నాటికి, జమ్మూ మరియు కాశ్మీర్‌లో ఆర్టికల్ 370 రద్దు చేసి నాలుగు సంవత్సరాలు అయ్యింది."
  ),

  Question(
  questionText: "అటల్ పెన్షన్ యోజన (APY) పథకం ఏ మైలురాయిని సాధించింది?",
  options: [
  "3 సంవత్సరాల అమలు",
  "5 కోట్ల మంది చందాదారులు",
  "10 సంవత్సరాల అమలు",
  "రూ. 1.39 లక్షల కోట్ల బడ్జెట్"
  ],
  correctAnswerIndex: 1,
  explanation: "అటల్ పెన్షన్ యోజన (APY) పథకం ఎనిమిదేళ్ల విజయవంతమైన అమలును పూర్తి చేయడంతో విశేషమైన మైలురాయిని చేరుకుంది, 5.25 కోట్ల మంది చందాదారుల ఆకట్టుకునే నమోదును సేకరించింది."
  ),

  Question(
  questionText: "వార్షిక నేషన్‌వైడ్ మాస్ డ్రగ్ అడ్మినిస్ట్రేషన్ (MDA) రెండవ దశ ప్రారంభోత్సవం సందర్భంగా కేంద్ర ఆరోగ్య & కుటుంబ సంక్షేమ మంత్రి మన్సుఖ్ మాండవియా ఏ ప్రకటన చేశారు?",
  options: [
  "2027 నాటికి లింఫాటిక్ ఫైలేరియాసిస్ తొలగింపు",
  "కొత్త ఆరోగ్య సంరక్షణ కార్యక్రమం ప్రారంభం",
  "కొత్త వ్యాక్సిన్ పరిచయం",
  "వైద్య సౌకర్యాల విస్తరణ"
  ],
  correctAnswerIndex: 0,
  explanation: "కేంద్ర ఆరోగ్య & కుటుంబ సంక్షేమ మంత్రి, మన్సుఖ్ మాండవియా, వార్షిక నేషన్‌వైడ్ మాస్ డ్రగ్ అడ్మినిస్ట్రేషన్ (MDA) రెండవ దశ ప్రారంభోత్సవం సందర్భంగా 2027 నాటికి శోషరస ఫైలేరియాసిస్‌ను నిర్మూలించే లక్ష్యాన్ని ప్రకటించారు."
  ),

  Question(
  questionText: "భారత ప్రధాన న్యాయమూర్తి (CJI) D.Y చంద్రచూడ్ న్యాయాన్ని ఆధునీకరించడానికి మరియు క్రమబద్ధీకరించడానికి ఏమి ఆవిష్కరించారు?",
  options: [
  "రాజమార్గయాత్ర మొబైల్ అప్లికేషన్",
  "MASI అప్లికేషన్",
  "ఫ్లడ్‌వాచ్ మొబైల్ అప్లికేషన్",
  "సుస్వాగతం పోర్టల్"
  ],
  correctAnswerIndex: 3,
  explanation: "భారత ప్రధాన న్యాయమూర్తి (CJI) D.Y చంద్రచూడ్ న్యాయవాదులు, న్యాయవాదులు మరియు పౌరులకు QR కోడ్ ఆధారిత ఈపాస్‌లను పొందేందుకు అనుకూలమైన మార్గాన్ని అందించడానికి 'సుస్వాగతం' పోర్టల్‌ను ఆవిష్కరించారు, వారికి సుప్రీం కోర్టులోని గౌరవనీయమైన హాల్‌లకు ప్రవేశం కల్పించారు. "
  ),

  Question(
  questionText: "ఆర్థిక గణాంకాలకు సంబంధించి స్టాటిస్టిక్స్ అండ్ ప్రోగ్రామ్ ఇంప్లిమెంటేషన్ మంత్రిత్వ శాఖ (MoSPI) ఏ ముఖ్యమైన చర్య తీసుకుంది?",
  options: [
  "వివక్ష వ్యతిరేక మార్గదర్శకాల పరిచయం","కొత్త ఆర్థిక సర్వే ప్రారంభం",
  "స్టాండింగ్ కమిటీ ఆన్ ఎకనామిక్ స్టాటిస్టిక్స్ స్థానంలో స్టాండింగ్ కమిటీ ఆన్ స్టాటిస్టిక్స్",
  "నేషనల్ డీప్ టెక్ స్టార్టప్ పాలసీ పరిచయం"
  ],
  correctAnswerIndex: 2,
  explanation: "గణాంకాలు మరియు ప్రోగ్రామ్ అమలు మంత్రిత్వ శాఖ (MoSPI) ప్రస్తుతం ఉన్న ఆర్థిక గణాంకాలపై స్టాండింగ్ కమిటీ (SCES) స్థానంలో స్టాండింగ్ కమిటీ ఆన్ స్టాటిస్టిక్స్ (SCoS) అనే మరింత సమగ్రమైన సంస్థను ఏర్పాటు చేసి, అన్ని సర్వేల ఫ్రేమ్‌వర్క్ మరియు ఫలితాలను సమీక్షించింది. నేషనల్ స్టాటిస్టికల్ ఆఫీస్ (NSO)."
  ),

  Question(
  questionText: "హర్ ఘర్ తిరంగా' మోటార్ సైకిల్ ర్యాలీని ఎవరు ఫ్లాగ్ చేశారు?",
  options: [
  "ప్రధాని నరేంద్ర మోడీ",
  "ప్రెసిడెంట్ ద్రౌపది ముర్ము",
  "కేంద్ర హోం మంత్రి అమిత్ షా",
  "వైస్ ప్రెసిడెంట్ జగదీప్ ధంఖర్"
  ],
  correctAnswerIndex: 3,
  explanation: "ఆజాదీ కా అమృత్ మహోత్సవ్ (AKAM) చొరవలో భాగంగా ఢిల్లీలోని ప్రగతి మైదాన్‌లో 'హర్ ఘర్ తిరంగ' మోటార్‌సైకిల్ ర్యాలీని వైస్ ప్రెసిడెంట్ జగదీప్ ధన్‌ఖర్ జెండా ఊపి ప్రారంభించారు, వ్యక్తులు తమ నివాసాలలో జాతీయ జెండాను సగర్వంగా ప్రదర్శించేలా ప్రేరేపించడం."
  ),

  Question(
  questionText: "భారతదేశం దాని శక్తి మిశ్రమంలో సహజ వాయువు యొక్క ప్రస్తుత వాటా ఏమిటి మరియు 2030కి ప్రభుత్వ లక్ష్యం ఏమిటి?",
  options: [
  "ప్రస్తుతం: 10%, లక్ష్యం: 20%",
  "ప్రస్తుతం: 15%, లక్ష్యం: 25%",
  "ప్రస్తుతం: 6%, లక్ష్యం: 15%",
  "ప్రస్తుతం: 5%, లక్ష్యం: 10%"
  ],
  correctAnswerIndex: 2,
  explanation: "భారతదేశం తన శక్తి మిశ్రమంలో ప్రస్తుతం ఉన్న 6% సహజవాయువు వాటాను 2030 నాటికి బలమైన 15%కి పెంచడానికి ప్రయాణాన్ని ప్రారంభించింది, అని పెట్రోలియం మరియు సహజ మంత్రిత్వ శాఖలోని రాష్ట్ర మంత్రి రామేశ్వర్ తేలీ ప్రకటించారు. గ్యాస్."
  ),

  Question(
  questionText: "కేంద్ర హోం మంత్రి అమిత్ షా ఏ మూడు కొత్త బిల్లులను లోక్‌సభలో ప్రవేశపెట్టారు?",
  options: [
  "వివక్ష నిరోధక బిల్లు, మెడికల్ వీసా బిల్లు, డైరెక్ట్ బెనిఫిట్ ట్రాన్స్‌ఫర్ (DBT) బిల్లు",
  "భారతీయ సాక్ష్యా బిల్లు, డీప్ టెక్ స్టార్టప్ పాలసీ బిల్లు, డైరెక్ట్ బెనిఫిట్ ట్రాన్స్‌ఫర్ (DBT) బిల్లు",
  "గవర్నమెంట్ ఆఫ్ నేషనల్ క్యాపిటల్ టెరిటరీ ఆఫ్ ఢిల్లీ (సవరణ) బిల్లు, భారతీయ సాక్ష్యా బిల్లు, డైరెక్ట్ బెనిఫిట్ ట్రాన్స్‌ఫర్ (DBT) బిల్లు",
  "భారతీయ సాక్ష్యా బిల్లు, భారతీయ సాక్ష్యాధారాల చట్టం (సంస్కరణ) బిల్లు, ప్రత్యక్ష ప్రయోజన బదిలీ (DBT) బిల్లు"
  ],
  correctAnswerIndex: 2,
  explanation: "కేంద్ర హోం మంత్రి అమిత్ షా లోక్‌సభలో మూడు కొత్త బిల్లులను ప్రవేశపెట్టారు, ఇందులో భారతీయ సాక్ష్యం బిల్లు కూడా ఉంది, ఇది 1872 నాటి భారతీయ సాక్ష్యాధారాల చట్టం స్థానంలో ఉంది."
  ),

  Question(
  questionText: "మహారాష్ట్ర ప్రభుత్వం ద్వారా మొదటి మహారాష్ట్ర ఉద్యోగ రత్న అవార్డు ఎవరికి ఇవ్వబడుతుంది?",
  options: [
  "రతన్ టాటా",
  "ఉదయ్ సమంత్",
  "యోగి ఆదిత్యనాథ్",
  "ఎం.కె. స్టాలిన్"
  ],
  correctAnswerIndex: 0,
  explanation: "టాటా గ్రూప్ ఛైర్మన్ రతన్ టాటాకు మహారాష్ట్ర ప్రభుత్వం మొదటి మహారాష్ట్ర ఉద్యోగ రత్న అవార్డును ప్రదానం చేస్తుంది, రాష్ట్ర పరిశ్రమల మంత్రి ఉదయ్ సమంత్ ప్రకటించారు."
  ),

  Question(
  questionText: "ప్రభుత్వ పథకాలు అందేలా చేయడానికి ఉత్తరప్రదేశ్ సిఎం యోగి ఆదిత్యనాథ్ ఏ చొరవ ప్రారంభించారు?",
  options: [
  "అమృత్ బృక్ష్య ఆందోళన్",
  "ముఖ్యమంత్రి సోలార్ మిషన్",
  "కమాండ్ సెంటర్ మరియు CM డాష్‌బోర్డ్",
  "రైనో టాస్క్ ఫోర్స్"
  ],
  correctAnswerIndex: 2,
  explanation: "ఉత్తరప్రదేశ్ సిఎం యోగి ఆదిత్యనాథ్ కమాండ్ సెంటర్ మరియు సిఎం డ్యాష్‌బోర్డ్‌ను ప్రారంభించి, అవసరమైనవారు మరియు అర్హులైనవారు ప్రభుత్వ పథకాలు మరియు సేవల ప్రయోజనాలను పొందేలా చూస్తారు."
  ),

  Question(
  questionText: "తమిళనాడులో తయారీ కేంద్రాన్ని నెలకొల్పేందుకు ₹1,600 కోట్ల పెట్టుబడులు పెడతానని ఏ తైవాన్ కంపెనీ హామీ ఇచ్చింది?",
  options: [
  "ఫాక్స్‌కాన్ టెక్నాలజీ గ్రూప్",
  "యాపిల్ ఇంక్.",
  "M.K. స్టాలిన్",
  "ముఖ్యమంత్రి భూపేంద్ర పటేల్"
  ],
  correctAnswerIndex: 0,
  explanation: "Foxconn Technology Group, Apple Inc.కి కీలకమైన సరఫరాదారు, ముఖ్యమంత్రి M.K. స్టాలిన్ సమక్షంలో తమిళనాడులోని కాంచీపురం జిల్లాలో తయారీ కేంద్రాన్ని నెలకొల్పేందుకు ₹1,600 కోట్ల పెట్టుబడి పెట్టేందుకు హామీ ఇచ్చారు."
  ),

  Question(
  questionText: "అసోం ప్రభుత్వం తన అటవీ విస్తీర్ణాన్ని పెంచడానికి ప్రకటించిన ప్రతిష్టాత్మక కార్యక్రమం పేరు ఏమిటి?",
  options: [
  "అమృత్ బృక్ష్య ఆందోళన్",
  "సిన్హ్ సుచ్నా",
  "రైనో టాస్క్ ఫోర్స్",
  "మాయెమ్ గ్రామం యొక్క జీవవైవిధ్య అట్లాస్"
  ],
  correctAnswerIndex: 0,
  explanation: "అస్సాం ప్రభుత్వం 'అమృత్ బృక్ష్య ఆందోళన్'ను ప్రకటించింది, సెప్టెంబర్‌లో ఒకే రోజు 1 కోటి మొక్కలు నాటడానికి ప్రతిష్టాత్మక కార్యక్రమం, దాని అటవీ విస్తీర్ణాన్ని పెంచడానికి మరియు వాతావరణ మార్పులను ఎదుర్కోవడానికి దోహదపడింది."
  ),

  Question(
  questionText: "బీహార్‌లో కుల ఆధారిత సర్వేను పునఃప్రారంభించాలని ఏ హైకోర్టు ఆదేశించింది?",
  options: [
  "పాట్నా హైకోర్టు",
  "ఢిల్లీ హైకోర్టు",
  "బాంబే హైకోర్టు",
  "మద్రాసు హైకోర్టు"
  ],
  correctAnswerIndex: 0,
  explanation: "బీహార్‌లో కుల ఆధారిత సర్వేను పునఃప్రారంభించాలని పాట్నా హైకోర్టు ఆదేశించింది, దీనిని మొదట పాట్నా DM చంద్రశేఖర్ వార్డ్ 10, ఫుల్వారిషరీఫ్, పాట్నాలో ప్రారంభించారు."
  ),

  Question(
  questionText: "రుతుపవనాలను పురస్కరించుకుని తమిళ సాంస్కృతిక సంఘం ఏ పండుగను ఒక శుభ సందర్భం గా జరుపుకుంటుందిఈజన్ మరియు నేల సంతానోత్పత్తి?",
  options: [
  "దీపావళి",
  "నవరాత్రి",
  "ఆది పెరుక్కు",
  "పొంగల్"
  ],
  correctAnswerIndex: 2,
  explanation: "తమిళ సాంస్కృతిక సంఘం 'ఆది పెరుక్కు'ను పతినెట్టం పెరుక్కు అని కూడా పిలుస్తారు, ఇది వర్షాకాలం మరియు నేల యొక్క సారవంతతను గౌరవించే ఒక పవిత్రమైన పండుగగా జరుపుకుంటారు."
  ),

  Question(
  questionText: "సామాజిక భద్రతా పథకం యొక్క కవరేజీని మరో 50 మంది అసంఘటిత కార్మికులకు ఏ రాష్ట్రం విస్తరించింది?",
  options: [
  "గోవా",
  "మహారాష్ట్ర",
  "ఒడిషా",
  "ఉత్తర ప్రదేశ్"
  ],
  correctAnswerIndex: 0,
  explanation: "ఒడిశా ప్రభుత్వం సామాజిక భద్రతా పథకం యొక్క కవరేజీని డెలివరీ బాయ్‌లు, బోట్‌మెన్‌లు మరియు ఫోటోగ్రాఫర్‌లతో సహా మరో 50 మంది అసంఘటిత కార్మికులకు విస్తరించింది."
  ),

  Question(
  questionText: "2023-24 ఆర్థిక సంవత్సరానికి రూరల్ ఇన్‌ఫ్రాస్ట్రక్చర్ డెవలప్‌మెంట్ ఫండ్ (RIDF) కింద రాజస్థాన్ ప్రభుత్వానికి NABARD ఎంత మొత్తాన్ని మంజూరు చేసింది?",
  options: [
  "రూ. 1,000 కోట్లు",
  "రూ. 1,500 కోట్లు",
  "రూ. 1,750 కోట్లు",
  "రూ. 1,974.07 కోట్లు"
  ],
  correctAnswerIndex: 3,
  explanation: "నాబార్డ్ 2023-24 ఆర్థిక సంవత్సరానికి రూరల్ ఇన్‌ఫ్రాస్ట్రక్చర్ డెవలప్‌మెంట్ ఫండ్ (RIDF) కింద రాజస్థాన్ ప్రభుత్వానికి రూ. 1,974.07 కోట్లను మంజూరు చేసింది, గ్రామీణ వర్గాల జీవన స్థితిగతులను మెరుగుపరచడం మరియు ఆర్థిక వృద్ధిని పెంచడం లక్ష్యంగా పెట్టుకుంది."
  ),

  Question(
  questionText: "తిరువళ్లూరు జిల్లాలోని అదానీ గ్రూప్‌కు చెందిన కట్టుపల్లి పోర్టుకు సంబంధించి TNPCB నిర్వహించనున్న పబ్లిక్ హియరింగ్ యొక్క ఉద్దేశ్యం ఏమిటి?",
  options: [
  "కొత్త ఆర్థిక సర్వే పరిచయం",
  "కట్టుపల్లి పోర్టు విస్తరణ",
  "నేషనల్ న్యూ కార్ అసెస్‌మెంట్ ప్రోగ్రామ్ (NCAP)",
  "కట్టుపల్లి ఓడరేవు ప్రతిపాదిత విస్తరణ"
  ],
  correctAnswerIndex: 3,
  explanation: "తమిళనాడు కాలుష్య నియంత్రణ మండలి (TNPCB) తిరువళ్లూరు జిల్లాలో అదానీ గ్రూప్‌కు చెందిన కట్టుపల్లి పోర్ట్ ప్రతిపాదిత విస్తరణపై బహిరంగ విచారణను నిర్వహించనుంది."
  ),

  Question(
  questionText: "ఖడ్గమృగాల సంరక్షణ పథకాన్ని తిరిగి ప్రవేశపెట్టడానికి చర్యలు సూచించడానికి బీహార్ ప్రభుత్వం ఏ టాస్క్‌ఫోర్స్‌ను ఏర్పాటు చేస్తుంది?",
  options: [
  "రైనో కన్జర్వేషన్ టాస్క్ ఫోర్స్",
  "వైల్డ్ లైఫ్ ప్రొటెక్షన్ టాస్క్ ఫోర్స్",
  "బయోడైవర్సిటీ టాస్క్ ఫోర్స్",
  "రైనో టాస్క్ ఫోర్స్"
  ],
  correctAnswerIndex: 3,
  explanation: "పశ్చిమ చంపారన్ జిల్లాలోని 'వాల్మీకి టైగర్ రిజర్వ్'లో ఖడ్గమృగాల సంరక్షణ పథకాన్ని పునఃప్రారంభించేందుకు చర్యలు సూచించేందుకు బీహార్ ప్రభుత్వం 'రైనో టాస్క్ ఫోర్స్'ని ఏర్పాటు చేస్తుంది."
  ),

  Question(
  questionText: "నాలెడ్జ్ భాగస్వామ్యాన్ని ఏర్పరచడానికి ఏ థింక్ ట్యాంక్ మరియు ప్రభుత్వం మెమోరాండం ఆఫ్ అండర్స్టాండింగ్ (MOU) కుదుర్చుకున్నాయి?",
  options: [
  "భారతి ఇన్స్టిట్యూట్ ఆఫ్ పబ్లిక్ పాలసీ మరియు కర్ణాటక ప్రభుత్వం",
  "టాటా ఇన్స్టిట్యూట్ ఆఫ్ సోషల్ సైన్సెస్ (TISS) మరియు మహారాష్ట్ర ప్రభుత్వం",
  "ఇండియన్ స్కూల్ ఆఫ్ బిజినెస్ (ISB) మరియు గోవా ప్రభుత్వం",
  "అబ్జర్వర్ రీసెర్చ్ ఫౌండేషన్ (ORF) మరియు మధ్యప్రదేశ్ ప్రభుత్వం"
  ],
  correctAnswerIndex: 2,
  explanation: "సాక్ష్యం-ఆధారిత విధాన రూపకల్పనను ముందుకు తీసుకెళ్లడానికి జ్ఞాన భాగస్వామ్యాన్ని ఏర్పరచడానికి భారతి ఇన్స్టిట్యూట్ ఆఫ్ పబ్లిక్ పాలసీ, ఇండియన్ స్కూల్ ఆఫ్ బిజినెస్ (ISB) కింద థింక్ ట్యాంక్ మరియు గోవా ప్రభుత్వం ఒక అవగాహన ఒప్పందం (MOU) కుదుర్చుకున్నాయి. మరియు ప్రభావవంతమైన పాలనను ప్రోత్సహించడం."
  ),

  Question(
  questionText: "ఆసియన్ ఎలిఫెంట్ పాపులేషన్ అండ్ డెమోగ్రఫీ రిపోర్ట్ 2023 ప్రకారం, ఏనుగుల జనాభాలో భారతదేశంలోని ఏ రాష్ట్రం గణనీయమైన పెరుగుదలను సాధించింది?",
  options: [
  "కేరళ",
  "కర్ణాటక",
  "అస్సాం",
  "మహారాష్ట్ర"
  ],
  correctAnswerIndex: 1,
  explanation: "ఆసియా ఏనుగుల జనాభా మరియు జనాభా నివేదిక 2023 ప్రకారం, కర్ణాటక ఏనుగుల జనాభాలో గణనీయమైన పెరుగుదలను చూసింది, ఇది 2017లో అంచనా వేయబడిన 6,049 నుండి 6,395కి పెరిగింది, ఇది దేశంలో అత్యధిక ఏనుగులు ఉన్న ప్రాంతంగా మారింది."
  ),

  Question(
  questionText: "కేరళ శాసనసభ రాష్ట్రం పేరుకు సంబంధించి ఏ తీర్మానాన్ని ఆమోదించింది?",
  options: [
  "కేరళ నామకరణం రిజల్యూషన్",
  "కేరళ ఐడెంటిటీ రిజల్యూషన్",
  "కేరళం నామకరణ రిజల్యూషన్",
  "కేరళ పేరు మార్పు రిజల్యూషన్"
  ],
  correctAnswerIndex: 2,
  explanation: "కేరళ శాసనసభ దాని సాంస్కృతిక మరియు భాషా వారసత్వాన్ని స్వీకరించే లక్ష్యంతో రాష్ట్రం పేరును 'కేరళ' నుండి 'కేరళం'గా మార్చాలని కేంద్ర ప్రభుత్వాన్ని అభ్యర్థిస్తూ ఒక తీర్మానాన్ని ఆమోదించింది."
  ),

  Question(
  questionText: "ప్రపంచ సింహాల దినోత్సవాన్ని పురస్కరించుకుని గుజరాత్ ముఖ్యమంత్రి భూపేంద్ర పటేల్ ఏ మొబైల్ అప్లికేషన్‌ను ప్రవేశపెట్టారు?",
  options: [
  "సిన్హ్ సుచ్నా",
  "డిజి యాత్ర",
  "ముఖ్యమంత్రి సోలార్ మిషన్",
  "నా బెంగాల్, వ్యసనం-రహిత బెంగాల్"
  ],
  correctAnswerIndex: 0,
  explanation: "ప్రపంచ సింహాల దినోత్సవాన్ని పురస్కరించుకుని గుజరాత్ ముఖ్యమంత్రి భూపేంద్ర పటేల్ 'సిన్హ్ సుచ్నా' అనే కొత్త మొబైల్ అప్లికేషన్‌ను ప్రవేశపెట్టారు. ఈ యాప్ ఆధునిక వన్యప్రాణుల సంరక్షణకు ఒక ముఖ్యమైన అడుగు, సింహాల కదలికలపై సమర్థవంతమైన పర్యవేక్షణను అనుమతిస్తుంది."
  ),

  Question(
  questionText: "భారతదేశంలో అత్యధికంగా క్యాన్సర్ కేసులు నమోదయ్యాయిs, ఇండియన్ కౌన్సిల్ ఆఫ్ మెడికల్ రీసెర్చ్ క్యాన్సర్ రిజిస్ట్రీ డేటా ప్రకారం?",
  options: [
  "మహారాష్ట్ర",
  "ఉత్తర ప్రదేశ్",
  "గుజరాత్",
  "మధ్యప్రదేశ్"
  ],
  correctAnswerIndex: 1,
  explanation: "ఇండియన్ కౌన్సిల్ ఆఫ్ మెడికల్ రీసెర్చ్ క్యాన్సర్ రిజిస్ట్రీ డేటా ప్రకారం, ఉత్తరప్రదేశ్ 2022 సంవత్సరంలో భారతదేశంలో అత్యధిక క్యాన్సర్ కేసులను నమోదు చేసింది, ఆశ్చర్యపరిచే విధంగా 210,000 కొత్త కేసులు నమోదు చేయబడ్డాయి."
  ),

  Question(
  questionText: "పునరుత్పాదక శక్తిని వినియోగించుకోవడానికి మేఘాలయ ముఖ్యమంత్రి కాన్రాడ్ కె సంగ్మా ఏ చొరవను ప్రారంభించారు?",
  options: [
  "మేఘాలయ గ్రీన్ ఎనర్జీ ఇనిషియేటివ్",
  "ముఖ్యమంత్రి సోలార్ మిషన్",
  "పునరుత్పాదక మేఘాలయ ప్రచారం",
  "మేఘాలయ క్లీన్ ఎనర్జీ ప్రాజెక్ట్"
  ],
  correctAnswerIndex: 1,
  explanation: "మేఘాలయ ముఖ్యమంత్రి కాన్రాడ్ కె సంగ్మా ముఖ్యమంత్రి సోలార్ మిషన్‌ను ప్రారంభించారు, ఇది ఈశాన్య కొండ రాష్ట్రానికి పచ్చని పురోగతి యొక్క కొత్త శకాన్ని ప్రారంభించే లక్ష్యంతో ఒక మార్గదర్శక చొరవ."
  ),

  Question(
  questionText: "గోవా ముఖ్యమంత్రి ప్రమోద్ సావంత్ గోవా మెడికల్ కాలేజీలో ఏ సంచలనాత్మక కార్యక్రమాన్ని ప్రారంభించారు?",
  options: [
  "ఉచిత ఆరోగ్య పరీక్ష కార్యక్రమం",
  "ఉచిత ఇన్ విట్రో ఫెర్టిలైజేషన్ (IVF) చికిత్స",
  "చైల్డ్ కేర్ సర్వీసెస్ ఎన్‌హాన్స్‌మెంట్ ప్రాజెక్ట్",
  "మెడికల్ కాలేజీ విస్తరణ ప్రాజెక్ట్"
  ],
  correctAnswerIndex: 1,
  explanation: "గోవా ముఖ్యమంత్రి ప్రమోద్ సావంత్ గోవా మెడికల్ కాలేజ్ (GMC)లో సహాయ పునరుత్పత్తి సాంకేతికత (ART) మరియు ఇంట్రాయూటరైన్ ఇన్సెమినేషన్ (IUI)తో పాటు ఉచిత ఇన్ విట్రో ఫెర్టిలైజేషన్ (IVF) చికిత్సను ప్రవేశపెట్టే సంచలనాత్మక చొరవను ప్రారంభించారు."
  ),

  Question(
  questionText: "తమిళనాడు డిఫెన్స్ ఇండస్ట్రియల్ కారిడార్ (TNDIC) కింద తమిళనాడు ఇండస్ట్రియల్ డెవలప్‌మెంట్ కార్పొరేషన్ (TIDCO) ద్వారా ఏమి స్థాపించబడుతుంది?",
  options: [
  "రోబోటిక్స్ రీసెర్చ్ సెంటర్",
  "భారతదేశం యొక్క మొట్టమొదటి మానవరహిత ఏరియల్ సిస్టమ్స్ (డ్రోన్) కామన్ టెస్టింగ్ సెంటర్",
  "న్యూక్లియర్ రీసెర్చ్ ఫెసిలిటీ",
  "స్పేస్ ఎక్స్‌ప్లోరేషన్ హబ్"
  ],
  correctAnswerIndex: 1,
  explanation: "తమిళనాడు డిఫెన్స్ ఇండస్ట్రియల్ కారిడార్ (TNDIC)ని పర్యవేక్షిస్తున్న తమిళనాడు ఇండస్ట్రియల్ డెవలప్‌మెంట్ కార్పొరేషన్ (TIDCO), భారతదేశపు మొట్టమొదటి మానవరహిత వైమానిక వ్యవస్థల (డ్రోన్) కామన్ టెస్టింగ్ సెంటర్‌ను రూ. 45 కోట్లతో ఏర్పాటు చేయనుంది."
  ),

  Question(
  questionText: "మేఘాలయలో బాల్య అభివృద్ధి మరియు ప్రసూతి మానసిక ఆరోగ్యం కోసం ఆసియా అభివృద్ధి బ్యాంకు (ADB) ఎంత మొత్తాన్ని రుణంగా మంజూరు చేసింది?",
  options: [
  "USD 20 మిలియన్లు",
  "USD 30 మిలియన్లు",
  "USD 40.5 మిలియన్లు",
  "USD 50 మిలియన్లు"
  ],
  correctAnswerIndex: 2,
  explanation: "ఆసియన్ డెవలప్‌మెంట్ బ్యాంక్ (ADB) ఈశాన్య భారత రాష్ట్రమైన మేఘాలయ కోసం USD 40.5 మిలియన్ల రుణాన్ని మంజూరు చేసింది, అంగన్‌వాడీ కేంద్రాలుగా పిలువబడే డేకేర్ సెంటర్‌ల స్థాపన మరియు పెంపుదల ద్వారా గృహ ఆధారిత మరియు కేంద్ర ఆధారిత పిల్లల సంరక్షణ సేవలను బలోపేతం చేయాలనే లక్ష్యంతో ఉంది. ."
  ),

  Question(
  questionText: "భారతదేశం యొక్క గొప్ప సామాజిక-సాంస్కృతిక వారసత్వాన్ని జరుపుకోవడానికి గోవా ముఖ్యమంత్రి ప్రమోద్ సావంత్ ఏ సంచలనాత్మక చొరవను ఆవిష్కరించారు?",
  options: [
  "మాయెమ్ విలేజ్ యొక్క జీవవైవిధ్య అట్లాస్",
  "డిజిటల్ ఇండియా ప్రచారం",
  "హెరిటేజ్ కన్జర్వేషన్ ఫండ్",
  "సాంస్కృతిక పరిరక్షణ ప్రాజెక్ట్"
  ],
  correctAnswerIndex: 0,
  explanation: "గోవా ముఖ్యమంత్రి ప్రమోద్ సావంత్ 'మాయెమ్ విలేజ్ బయోడైవర్సిటీ అట్లాస్'ను భారతదేశం యొక్క గొప్ప సామాజిక-సాంస్కృతిక వారసత్వాన్ని సంరక్షించడానికి మరియు జరుపుకోవడానికి ఒక ముఖ్యమైన దశగా ఆవిష్కరించారు."
  ),

  Question(
  questionText: "యువతలో మాదకద్రవ్యాల వినియోగం సమస్యను పరిష్కరించడానికి రాష్ట్రపతి ద్రౌపది ముర్ము రాజ్ భవన్‌లో ఏ ప్రచారాన్ని ప్రారంభించారు?",
  options: [
  "మాదక ద్రవ్యాలకు నో చెప్పండి",
  "డ్రగ్-ఫ్రీ బెంగాల్",
  "నా బెంగాల్, వ్యసనం-రహిత బెంగాల్",
  "యాంటీ డ్రగ్ డ్రైవ్"
  ],
  correctAnswerIndex: 2,
  explanation: "యువతలో మాదకద్రవ్యాల వినియోగం యొక్క ప్రబలమైన సమస్యను పరిష్కరించడానికి బ్రహ్మ కుమారీలు నిర్వహించిన 'మై బెంగాల్, వ్యసనం-రహిత బెంగాల్' ప్రచారాన్ని అధ్యక్షుడు ద్రౌపది ముర్ము ప్రారంభించారు."
  ),

  Question(
  questionText: "భారతదేశంలోని ఈశాన్య ప్రాంతంలో 'డిజి యాత్ర' సౌకర్యాన్ని ప్రవేశపెట్టిన మొదటి విమానాశ్రయం ఏది?",
  options: [
  "గౌహతి విమానాశ్రయం",
  "ఇంఫాల్ విమానాశ్రయం",
  "అగర్తలా విమానాశ్రయం",
  "లోకప్రియా గోపీనాథ్ బోర్డోలోయ్ అంతర్జాతీయ విమానాశ్రయం (LBBI)"
  ],
  correctAnswerIndex: 3,
  explanation: "గౌహతిలోని లోక్‌ప్రియ గోపీనాథ్ బోర్డోలోయ్ అంతర్జాతీయ విమానాశ్రయం (LBBI) భారతదేశంలోని ఈశాన్య ప్రాంతంలో 'డిజి యాత్ర' సౌకర్యాన్ని ప్రవేశపెట్టిన మొదటి విమానాశ్రయంగా మారింది, ఇది విమాన ప్రయాణ అనుభవాన్ని విప్లవాత్మకంగా మారుస్తుంది."
  ),

  Question(
  questionText: "చెన్నై నగరంలో నీటి సంక్షోభాన్ని పరిష్కరించడానికి తమిళనాడు ముఖ్యమంత్రి ఎం కె స్టాలిన్ ఏ ముఖ్యమైన ప్రాజెక్టుకు పునాది రాయి వేశారు?",
  options: [
  "చెన్నై నీటి పునరుజ్జీవన ప్రాజెక్ట్",
  "సౌత్ ఈస్ట్ ఆసియాస్ లార్జెస్ట్ వాటర్ డీశాలినేషన్ ప్రాజెక్ట్",
  "చెన్నై వాటర్ కనెక్టివిటీ స్కీమ్",
  "తమిళనాడు వాటర్ ఇన్నోవేషన్ ఇనిషియేటివ్"
  ],
  correctAnswerIndex: 1,
  explanation: "ఆగ్నేయాసియాలో అతిపెద్ద నీటి డీశాలినేషన్ ప్రాజెక్ట్‌గా అవతరించేందుకు తమిళనాడు ముఖ్యమంత్రి ఎంకె స్టాలిన్ శంకుస్థాపన చేశారు, ఇది నీటి సమస్యను పరిష్కరించే దిశగా ఒక ముఖ్యమైన అడుగు.చెన్నై నగరంలో పెరుగుదల."
  ),

  Question(
  questionText: "మహాబలి రాజు తిరిగి వచ్చిన జ్ఞాపకార్థం ఆగస్టు 20 నుండి ఆగస్టు 31 వరకు కేరళలో ఏ సాంస్కృతిక వేడుక జరిగింది?",
  options: [
  "నవరాత్రి",
  "ఓనం",
  "దీపావళి",
  "పొంగల్"
  ],
  correctAnswerIndex: 1,
  explanation: "కేరళ రాష్ట్రంలో ఒక ముఖ్యమైన సాంస్కృతిక వేడుక అయిన ఓనం యొక్క మంత్రముగ్ధులను చేసే ఉత్సవాలు ఈ సంవత్సరం ఆగస్టు 20 నుండి ఆగస్టు 31 వరకు క్యాలెండర్‌ను అలంకరించాయి. తిరు-ఓణం లేదా తిరువోణం వేడుకలు మావేలి అని కూడా పిలువబడే గౌరవనీయమైన రాజు మహాబలి తిరిగి వచ్చిన జ్ఞాపకార్థం. ."
  ),

  Question(
  questionText: "FY 2022-23లో ప్రధాన మంత్రి ముద్ర యోజన (PMMY) ఏ మైలురాయిని సాధించింది?",
  options: [
  "5 కోట్లకు పైగా రుణాలు మంజూరు",
  "6 కోట్లకు పైగా రుణాలు మంజూరు",
  "7 కోట్లకు పైగా రుణాలు మంజూరు",
  '8 కోట్లకు పైగా రుణాల మంజూరు'
  ],
  correctAnswerIndex: 1,
  explanation: "ఆర్థిక సంవత్సరం (FY) 2022-23లో, ప్రధాన మంత్రి ముద్ర యోజన (PMMY) 6.23 కోట్ల రుణాలను మంజూరు చేయడంలో ముఖ్యమైన మైలురాయిని సాధించింది, కేంద్ర ఆర్థిక శాఖ సహాయ మంత్రి డాక్టర్ భగవత్ కిసన్‌రావ్ కరద్ ప్రకటించారు. లోక్ సభ సెషన్."
  ),

  Question(
  questionText: "సాంస్కృతిక మంత్రిత్వ శాఖ ప్రారంభించిన నేషనల్ మిషన్ ఆన్ లైబ్రరీస్ యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
  options: [
  "సాంస్కృతిక వారసత్వ ప్రదేశాల ఆధునీకరణ",
  "లైబ్రరీల డిజిటల్ ఇంటర్‌కనెక్షన్",
  "సాంప్రదాయ కళారూపాల ప్రచారం",
  "పురావస్తు ప్రదేశాల పరిరక్షణ"
  ],
  correctAnswerIndex: 1,
  explanation: "నేషనల్ మిషన్ ఆన్ లైబ్రరీస్, సాంస్కృతిక మంత్రిత్వ శాఖ చొరవ, భారతదేశం అంతటా దాదాపు 9,000 లైబ్రరీల ఆధునీకరణ మరియు డిజిటల్ ఇంటర్‌కనెక్ట్‌ను లక్ష్యంగా పెట్టుకుంది. పాఠకులకు విస్తారమైన పుస్తకాలు మరియు సమాచారం, క్యాటరింగ్‌ను సులభంగా యాక్సెస్ చేయడం ప్రధాన లక్ష్యం. విభిన్న ప్రేక్షకులకు."
  ),

  Question(
  questionText: "ప్రాజెక్ట్ టైగర్ మరియు ప్రాజెక్ట్ ఎలిఫెంట్ ఏ కొత్త డివిజన్ కింద విలీనం చేయబడ్డాయి?",
  options: [
  "వన్యప్రాణి సంరక్షణ విభాగం",
  "జీవవైవిధ్యం మరియు పరిరక్షణ విభాగం",
  "ప్రాజెక్ట్ టైగర్ అండ్ ఎలిఫెంట్ డివిజన్",
  "ఎకో ప్రిజర్వేషన్ డివిజన్"
  ],
  correctAnswerIndex: 2,
  explanation: "కేంద్ర పర్యావరణ, అటవీ మరియు వాతావరణ మార్పుల మంత్రిత్వ శాఖ (MoEFCC) ప్రాజెక్ట్ టైగర్ మరియు ప్రాజెక్ట్ ఎలిఫెంట్‌లను 'ప్రాజెక్ట్ టైగర్ అండ్ ఎలిఫెంట్ డివిజన్' అనే కొత్త విభాగం కింద విలీనం చేసింది. పరిరక్షణ ప్రయత్నాలను క్రమబద్ధీకరించడానికి మరియు మెరుగుపరచడానికి ఈ చర్య తీసుకోబడింది మరియు ప్రాజెక్ట్ టైగర్ యొక్క 50వ వార్షికోత్సవం సందర్భంగా దీనిని ప్రధానమంత్రి ప్రశంసించారు."
  ),

  Question(
  questionText: "నేషనల్ టెస్టింగ్ ఏజెన్సీ (NTA) ద్వారా YASASVI పథకం కింద ప్రారంభించబడిన స్కాలర్‌షిప్ ప్రోగ్రామ్ ఏమిటి?",
  options: [
  "ప్రధానమంత్రి స్కాలర్‌షిప్ పథకం",
  "నేషనల్ మెరిట్ స్కాలర్‌షిప్ స్కీమ్",
  "PM యంగ్ అచీవర్స్ స్కాలర్‌షిప్ అవార్డు పథకం",
  "ఎన్టీఏ స్కాలర్‌షిప్ ఫర్ ఎక్సలెన్స్"
  ],
  correctAnswerIndex: 2,
  explanation: "PM యంగ్ అచీవర్స్ స్కాలర్‌షిప్ అవార్డ్ స్కీమ్ ఫర్ వైబ్రంట్ ఇండియా (YASASVI) పథకం కింద ప్రారంభించబడిన స్కాలర్‌షిప్ ప్రవేశ పరీక్ష 2023 కోసం NTA రిజిస్ట్రేషన్ విధానాన్ని ప్రారంభించింది. అర్హత గల దరఖాస్తుదారులు NTA వెబ్‌సైట్ ద్వారా ఈ స్కాలర్‌షిప్ ప్రోగ్రామ్ కోసం దరఖాస్తు చేసుకోవచ్చు."
  ),

  Question(
  questionText: "దీక్ష యొక్క ఆధునీకరణ కోసం విద్యా మంత్రిత్వ శాఖ ఏ సాంకేతిక వేదికను ఎంపిక చేసింది?",
  options: [
  "మైక్రోసాఫ్ట్ అజూర్",
  "Google క్లౌడ్ ప్లాట్‌ఫారమ్",
  "ఒరాకిల్ క్లౌడ్ ఇన్‌ఫ్రాస్ట్రక్చర్",
  "అమెజాన్ వెబ్ సర్వీసెస్"
  ],
  correctAnswerIndex: 2,
  explanation: "జాతీయ విద్యా సాంకేతిక వేదిక డిజిటల్ ఇన్‌ఫ్రాస్ట్రక్చర్ ఫర్ నాలెడ్జ్ షేరింగ్ (DIKSHA)ను ఆధునీకరించడానికి విద్యా మంత్రిత్వ శాఖ ఒరాకిల్ క్లౌడ్ ఇన్‌ఫ్రాస్ట్రక్చర్ (OCI)ని ఎంపిక చేసింది. ఈ వలసలు DIKSHAను మరింత అందుబాటులోకి తీసుకురావడం మరియు దాని IT ఖర్చులను తగ్గించడం, లక్షలాది మంది విద్యార్థులకు ప్రయోజనం చేకూర్చడం లక్ష్యంగా పెట్టుకుంది. దేశవ్యాప్తంగా ఉపాధ్యాయులు మరియు సహకారులు."
  ),

  Question(
  questionText: "వివాద్ సే విశ్వాస్ 2.0, ఇటీవల ఖర్చుల విభాగం ద్వారా ప్రారంభించబడింది?",
  options: [
  "పన్ను మినహాయింపు పథకం",
  "వివాద పరిష్కార పథకం",
  "పన్ను ఎగవేత విచారణ పథకం",
  "కాంట్రాక్ట్ వివాదాల పథకం"
  ],
  correctAnswerIndex: 3,
  explanation: "ఆర్థిక మంత్రిత్వ శాఖ ఆధ్వర్యంలోని వ్యయ విభాగం వివాదం సే విశ్వాస్ 2.0ని ప్రారంభించింది, దీనిని కాంట్రాక్టు వివాదాల పథకం అని కూడా పిలుస్తారు. ఈ పథకం ప్రభుత్వం మరియు ప్రభుత్వ సంస్థలతో ముడిపడి ఉన్న దీర్ఘకాలిక ఒప్పంద వివాదాలను పరిష్కరించడం లక్ష్యంగా పెట్టుకుంది. వివాదాలు."
  ),

  Question(
  questionText: "భారతదేశం అంతటా 508 రైల్వే స్టేషన్‌ల పునరాభివృద్ధి ఏ పథకం కింద జరుగుతోంది?",
  options: [
  "స్మార్ట్ సిటీస్ మిషన్",
  "అమృత్ భారత్ పథకం",
  "స్వచ్ఛ భారత్ అభియాన్",
  "మేక్ ఇన్ ఇండియా ఇనిషియేటివ్"
  ],
  correctAnswerIndex: 1,
  explanation: "ప్రధాని నరేంద్ర మోడీ భారతదేశం అంతటా 508 రైల్వే స్టేషన్ల పునరాభివృద్ధికి వాస్తవంగా ఆగస్టు 6న పునాది వేయనున్నారు. ఈ ప్రతిష్టాత్మక ప్రాజెక్ట్ అమృత్ భారత్ పథకం కింద అమలు చేయబడింది, ప్రయాణీకుల సౌకర్యాలను మెరుగుపరచడం మరియు రైల్వే మౌలిక సదుపాయాలను మెరుగుపరచడం లక్ష్యంగా ఉంది. అంచనా వ్యయం ₹24,470 కోట్లు."
  ),Question(
  questionText: "కేరళ రాష్ట్ర ప్రభుత్వం ప్రారంభించిన 'శుభయాత్ర' పథకం లక్ష్యం ఏమిటి?",
  options: [
  "పర్యాటక ప్రమోషన్",
  "రైతులకు ఆర్థిక మద్దతు",
  "విదేశీ వలసదారులకు ఆర్థిక మద్దతు",
  "రవాణా మౌలిక సదుపాయాల అభివృద్ధి"
  ],
  correctAnswerIndex: 2,
  explanation: "కేరళ రాష్ట్ర ప్రభుత్వం 'శుభయాత్ర' పథకాన్ని ప్రారంభించింది, కేరళ నుండి మొదటిసారిగా విదేశాలకు వలస వచ్చిన వారికి చాలా అవసరమైన ఆర్థిక సహాయాన్ని అందించడం లక్ష్యంగా పెట్టుకుంది. ఈ పథకం రూ. 2 లక్షల వరకు ఆర్థిక సహాయాన్ని అందిస్తుంది, ఆరుగురికి పన్ను సెలవు. నెలలు, మరియు అర్హత కలిగిన అభ్యర్థులు విదేశీ ఉపాధికి సంబంధించిన యాదృచ్ఛిక ఖర్చులను కవర్ చేయడంలో సహాయపడటానికి ఆకర్షణీయమైన వడ్డీ రాయితీ."
  ),

  Question(
  questionText: "మైనారిటీ వర్గాలకు సహాయం చేయడానికి మంత్రిత్వ శాఖ అమలు చేసిన 'నయా సవేరా' పథకం ఏమిటి?",
  options: [
  "స్కాలర్‌షిప్ పథకం",
  "నైపుణ్య అభివృద్ధి పథకం",
  "ఉచిత కోచింగ్ మరియు అనుబంధ పథకం",
  "ఆర్థిక చేరిక పథకం"
  ],
  correctAnswerIndex: 2,
  explanation: "సిక్కు, జైన్, ముస్లిం, క్రిస్టియన్, బౌద్ధ మరియు పార్సీ అనే ఆరు మైనారిటీ కమ్యూనిటీలకు చెందిన విద్యార్థులు/అభ్యర్థులకు సహాయం చేసేందుకు మంత్రిత్వ శాఖ 'నయా సవేరా' పథకాన్ని 'ఉచిత కోచింగ్ అండ్ అలైడ్' అని కూడా పిలుస్తారు. ఈ పథకం అర్హత పరీక్షలకు ప్రత్యేక కోచింగ్‌ను అందిస్తుంది, విద్యా ఆకాంక్షలకు మద్దతు ఇస్తుంది."
  ),

  Question(
  questionText: "మణిపూర్‌లో హింసాకాండను పరిష్కరించేందుకు భారత ప్రధాన న్యాయమూర్తి డి.వై. చంద్రచూడ్ ప్రకటించిన మొత్తం మహిళా ప్యానెల్‌కు ఎవరు నాయకత్వం వహిస్తారు?",
  options: [
  "జస్టిస్ గీతా మిట్టల్",
  "జస్టిస్ ఇందు మల్హోత్రా",
  "జస్టిస్ ఆర్. బానుమతి",
  "జస్టిస్ ఎస్. రవీంద్ర భట్"
  ],
  correctAnswerIndex: 0,
  explanation: "మణిపూర్‌లో హింసాకాండతో అతలాకుతలమైన ప్రాంతానికి స్వస్థత చేకూర్చేందుకు, ఉపశమనం కలిగించేందుకు మొత్తం మహిళలతో కూడిన ప్యానెల్‌ను ఏర్పాటు చేస్తున్నట్లు భారత ప్రధాన న్యాయమూర్తి డి.వై. చంద్రచూడ్ ప్రకటించారు. ఈ ప్యానెల్‌లో ముగ్గురు మాజీ హైకోర్టు న్యాయమూర్తులు, జస్టిస్ గీతా మిట్టల్ సభ్యులుగా ఉంటారు. దాని తల."
  ),

  Question(
  questionText: "పశువుల పెంపకందారులు, మహిళా స్వయం సహాయక సంఘాలు మరియు 'గౌతన్' కమిటీలకు మద్దతుగా ఛత్తీస్‌గఢ్ ప్రభుత్వం ప్రారంభించిన ఫ్లాగ్‌షిప్ చొరవ ఏమిటి?",
  options: [
  "గోధన్ న్యాయ్ యోజన (GNY)",
  "ప్రధాన్ మంత్రి ఫసల్ బీమా యోజన (PMFBY)",
  "స్వచ్ఛ భారత్ అభియాన్",
  "మేక్ ఇన్ ఛత్తీస్‌గఢ్ ఇనిషియేటివ్"
  ],
  correctAnswerIndex: 0,
  explanation: "ఛత్తీస్‌గఢ్ ప్రభుత్వం ప్రారంభించిన ఫ్లాగ్‌షిప్ గోధన్ న్యాయ్ యోజన (జిఎన్‌వై)లో భాగంగా, ముఖ్యమంత్రి భూపేష్ బఘెల్ పశువుల పెంపకందారులు, మహిళా స్వయం సహాయక బృందాలు (ఎస్‌హెచ్‌జిలు) మరియు 'గౌతన్' కమిటీలకు మద్దతుగా రూ. 15 కోట్లకు పైగా ఆన్‌లైన్ బదిలీలు నిర్వహించారు. ."
  ),

  Question(
  questionText: "ఇటీవల భారతదేశంలో ప్రారంభించబడిన 'భూ-విజన్' (క్రిషి-రాస్తా సాయిల్ టెస్టింగ్ సిస్టమ్) అంటే ఏమిటి?",
  options: [
  "స్మార్ట్ అగ్రికల్చర్ ప్లాట్‌ఫాం",
  "వ్యవసాయ సబ్సిడీ పథకం",
  "సాయిల్ హెల్త్ మానిటరింగ్ సిస్టమ్",
  "పంటల బీమా చొరవ"
  ],
  correctAnswerIndex: 2,
  explanation: "Bhu-Vision, KRISHI-RASTAA సాయిల్ టెస్టింగ్ సిస్టమ్ అని కూడా పిలుస్తారు, ఇది ఇటీవల భారతదేశంలో ప్రారంభించబడిన ఒక విప్లవాత్మక IoT-ఆధారిత ఆటోమేటెడ్ సాయిల్ టెస్టింగ్ మరియు అగ్రోనమీ అడ్వైజరీ ప్లాట్‌ఫారమ్. ICAR-IIRR మరియు KrishiTantra చే అభివృద్ధి చేయబడింది, ఈ వ్యవస్థ స్మార్ట్, వేగవంతమైనది అందిస్తుంది. , మట్టి పరీక్ష మరియు వ్యవసాయ శాస్త్రానికి సులభమైన, సరసమైన మరియు అందుబాటులో ఉండే పరిష్కారం."
  ),

  Question(
  questionText: "ప్రధాన్ మంత్రి ఫసల్ బీమా యోజన (PMFBY) కింద పెండింగ్‌లో ఉన్న పంటల బీమా క్లెయిమ్‌లలో ఏ ముఖ్యమైన బకాయిలు వెల్లడయ్యాయి?",
  options: [
  "రూ. 1,500 కోట్లు",
  "రూ. 2,000 కోట్లు",
  "రూ. 2,500 కోట్లు",
  "రూ. 2,716.10 కోట్లు"
  ],
  correctAnswerIndex: 3,
  explanation: "ఇటీవలి డేటా ప్రకారం, ప్రధాన మంత్రి ఫసల్ బీమా యోజన (PMFBY) కింద 2021-22 వరకు సుమారు రూ. 2,716.10 కోట్ల పంట బీమా క్లెయిమ్‌లు పెండింగ్‌లో ఉన్నాయి. తరువాత మహారాష్ట్ర మరియు గుజరాత్ ఉన్నాయి."
  ),

  Question(
  questionText: "రాజస్థాన్ ముఖ్యమంత్రి అశోక్ గెహ్లాట్ ప్రారంభించిన 'ఇందిరా గాంధీ ఉచిత స్మార్ట్‌ఫోన్ యోజన 2023' ఏమిటి?",
  options: [
  "డిజిటల్ అక్షరాస్యత కార్యక్రమం",
  "ఉచిత స్మార్ట్‌ఫోన్ పంపిణీ పథకం",
  "మహిళా సాధికారత చొరవ",
  "యూత్ స్కిల్ డెవలప్మెంట్ ప్రోగ్రామ్"
  ],
  correctAnswerIndex: 1,
  explanation: "రాజస్థాన్ ముఖ్యమంత్రి అశోక్ గెహ్లాట్ 'ఇందిరా గాంధీ ఉచిత స్మార్ట్‌ఫోన్ యోజన 2023'ని ప్రారంభించారు. ఈ కార్యక్రమం రాష్ట్రంలోని మహిళలకు ఉచిత మొబైల్ ఫోన్‌లు, ఇంటర్నెట్ మరియు వాయిస్ కాల్ సేవలను అందిస్తుంది, ఆగస్టు 10 నుండి ఆగస్టు 30, 2023 వరకు స్మార్ట్‌ఫోన్‌ల పంపిణీ జరుగుతుంది, వితంతువులు మరియు విడాకులు పొందిన మహిళలకు ప్రాధాన్యత ఇస్తోంది."
  ),

  Question(
  questionText: "పాఠ్యపుస్తకాల సవరణ కోసం NCERT ఏర్పాటు చేసిన 19 మంది సభ్యుల కమిటీ లక్ష్యం ఏమిటి?",
  options: [
  "సాంస్కృతిక వారసత్వ విద్యను పెంపొందించడం",
  "జాతీయ కరికులం ఫ్రేమ్‌వర్క్‌తో సిలబస్‌లను సమలేఖనం చేయడం",
  "వృత్తి విద్యను ప్రోత్సహించడం",
  "ఉపాధ్యాయ శిక్షణ కార్యక్రమాలను మెరుగుపరచడం"
  ],
  correctAnswerIndex: 1,
  explanation: "నేషనల్ కౌన్సిల్ ఆఫ్ ఎడ్యుకేషనల్ రీసెర్చ్ అండ్ ట్రైనింగ్ (NCERT) 19 మంది సభ్యులతో కూడిన కమిటీని స్కూల్ సిల్‌ను సమలేఖనం చేయడానికి బాధ్యత వహించింది.జాతీయ కరికులం ఫ్రేమ్‌వర్క్ (NCF)తో abi, పాఠ్యపుస్తకాలు, బోధనా సామగ్రి మరియు అభ్యాస వనరులు. కమిటీ యొక్క ఆదేశం 3 నుండి 12 తరగతులకు వర్తిస్తుంది, 1 మరియు 2 తరగతుల నుండి తదుపరి గ్రేడ్‌లకు అతుకులు లేని మార్పును లక్ష్యంగా చేసుకుంది."
  ),

  Question(
  questionText: "ప్రధాన మంత్రి నరేంద్ర మోడీ ప్రకటించిన ఏ పథకం, సాంప్రదాయ కళాకారులు మరియు చేతివృత్తుల వారి జీవనోపాధి అవకాశాలను పెంపొందించే లక్ష్యంతో ఉంది?",
  options: [
  "స్కిల్ ఇండియా మిషన్",
  "విశ్వకర్మ యోజన",
  "మేక్ ఇన్ ఇండియా ఇనిషియేటివ్",
  "క్రాఫ్ట్స్ రివైవల్ స్కీమ్"
  ],
  correctAnswerIndex: 1,
  explanation: "ప్రధాన మంత్రి నరేంద్ర మోడీ విశ్వకర్మ యోజన ప్రకటన సంప్రదాయ కళాకారులు మరియు చేతివృత్తుల వారి జీవనోపాధి అవకాశాలను పెంపొందించే లక్ష్యంతో ఒక కొత్త పథకానికి మార్గం సుగమం చేసింది. కేంద్ర మంత్రివర్గం ఈ పథకానికి త్వరితగతిన ఆమోదం తెలిపింది, సంప్రదాయ నైపుణ్యాలను ప్రోత్సహించడం మరియు సంరక్షించడం మరియు చేతిపనులు."
  ),

  Question(
  questionText: "విద్యా మంత్రిత్వ శాఖ ప్రవేశపెట్టిన ప్రధాన మంత్రి ఉచ్ఛతర్ శిక్షా అభియాన్ (PM-USHA) దేనిని లక్ష్యంగా చేసుకుంది?",
  options: [
  "ప్రాథమిక విద్యను పెంపొందించడం",
  "యువతకు నైపుణ్యాభివృద్ధి",
  "ఉన్నత విద్యను మెరుగుపరచడం",
  "విద్యార్థులకు ఆర్థిక చేరిక"
  ],
  correctAnswerIndex: 2,
  explanation: "విద్యా మంత్రిత్వ శాఖ ప్రధాన్ మంత్రి ఉచ్ఛతర్ శిక్షా అభియాన్ (PM-USHA), రాష్ట్రాలు మరియు కేంద్ర పాలిత ప్రాంతాలలో ఉన్నత విద్యలో ప్రవేశం, సమానత్వం మరియు శ్రేష్ఠతను పెంపొందించే లక్ష్యంతో ఒక కేంద్ర పథకాన్ని ప్రవేశపెట్టింది. అయితే, జాతీయ అమలు కోసం ఆవశ్యకత విద్యా విధానం (NEP) 2020 మరియు నిధులను పొందేందుకు కొన్ని విద్యా ప్రమాణాలను అనుసరించడం వివాదానికి దారితీసింది."
  ),

  Question(
  questionText: "విమానయాన రంగంలో లింగ సమానత్వాన్ని ప్రోత్సహించే దిశగా డైరెక్టరేట్ జనరల్ ఆఫ్ సివిల్ ఏవియేషన్ (DGCA) ఏ చురుకైన చర్య తీసుకుంది?",
  options: [
  "లింగ కోటాల పరిచయం",
  "మహిళా విభాగం స్థాపన",
  "లింగ సమానత్వం కోసం ఒక కమిటీ ఏర్పాటు",
  'మహిళా పైలట్లకు ప్రోత్సాహక పథకం'
  ],
  correctAnswerIndex: 2,
  explanation: "భారతదేశంలోని DGCA దేశం యొక్క విమానయాన రంగంలో లింగ సమానత్వాన్ని ప్రోత్సహించే దిశగా చురుకైన చర్య తీసుకుంది. ఆగష్టు 10, 2023న, DGCA లింగ సమానత్వాన్ని సాధించే లక్ష్యంతో వ్యూహాలు మరియు సిఫార్సులను రూపొందించడానికి సీనియర్ అధికారులతో కూడిన నలుగురు సభ్యుల కమిటీని ఏర్పాటు చేసింది. పరిశ్రమలో, విమానయాన రంగంలో లింగ సమానత్వాన్ని పెంపొందించడానికి DGCA అమలు చేయగల చర్యలను ప్రతిపాదించడమే కమిటీ లక్ష్యం."
  ),

  Question(
  questionText: "కేబినెట్ ప్రకటించిన డిజిటల్ ఇండియా ప్రాజెక్ట్ కోసం పొడిగించిన బడ్జెట్ కేటాయింపు ఎంత?",
  options: [
  "₹10,000 కోట్లు",
  "₹12,345 కోట్లు",
  "₹14,903 కోట్లు",
  "₹20,000 కోట్లు"
  ],
  correctAnswerIndex: 2,
  explanation: "ముఖ్యమైన చర్యగా, డిజిటల్ ఇండియా ప్రాజెక్ట్ యొక్క పొడిగింపుకు క్యాబినెట్ ఆమోదం తెలిపింది, గణనీయమైన బడ్జెట్ ₹ 14,903 కోట్లను కేటాయించింది. కేంద్ర మంత్రి అశ్విని వైష్ణవ్ ఈ నిర్ణయాన్ని ప్రకటించారు, విస్తారిత చొరవ సాధించిన విజయాలపై ఆధారపడి ఉంటుంది. దాని మునుపటి పునరావృతం."
  ),

  Question(
  questionText: "భారత ప్రభుత్వం ప్రకటించిన 'లఖపతి దీదీ' పథకం ఏమిటి?",
  options: [
  "మహిళల కోసం ఆర్థిక చేరిక పథకం",
  "మహిళలకు నైపుణ్య శిక్షణ కార్యక్రమం",
  "మహిళలకు సార్వత్రిక ప్రాథమిక ఆదాయం",
  "మహిళలకు ఆర్థిక సాధికారత పథకం"
  ],
  correctAnswerIndex: 1,
  explanation: "మహిళల సాధికారత మరియు ఆర్థిక వృద్ధిని పెంపొందించే ఒక ముఖ్యమైన చర్యలో, భారత ప్రభుత్వం 'లఖపతి దీదీ' పథకాన్ని ప్రకటించింది. ఈ పథకం దేశవ్యాప్తంగా రెండు కోట్ల మంది మహిళలకు నైపుణ్య శిక్షణను అందించడం, దాని పరిధిని మరియు జాతీయంపై ప్రభావాన్ని విస్తరించడం లక్ష్యంగా పెట్టుకుంది. స్థాయి."
  ),

  Question(
  questionText: "మహారాష్ట్ర ప్రభుత్వం ప్రారంభించిన భగవాన్ బిర్సా ముండా జోడరాస్తే పథకం లక్ష్యం ఏమిటి?",
  options: [
  "గిరిజన కళ మరియు సంస్కృతిని ప్రోత్సహించడం",
  "ఆరోగ్య సంరక్షణ సేవలను మెరుగుపరచడం",
  "గిరిజన ప్రాంతాల్లో విద్యను మెరుగుపరచడం",
  'గిరిజన గ్రామాలకు కనెక్టివిటీ పెంపు'
  ],
  correctAnswerIndex: 3,
  explanation: "రాష్ట్రంలో కనెక్టివిటీని పెంపొందించడానికి మరియు గిరిజన సంఘాల జీవితాలను మెరుగుపరచడానికి మహారాష్ట్ర ప్రభుత్వం ఒక ముఖ్యమైన అడుగు వేసింది. భగవాన్ బిర్సా ముండా జోడరాస్తే పథకం అన్ని గిరిజన గ్రామాలను అనుసంధానించే లక్ష్యంతో ఉంది"
  ),
  Question(
  questionText: "ఏ రాష్ట్రం దాని మొదటి AI పాఠశాలను ప్రారంభించింది మరియు ఎవరు ప్రారంభించారు?",
  options: [
  "తెలంగాణ - కె. చంద్రశేఖర రావు",
  "కేరళ - రామ్ నాథ్ కోవింద్",
  "మహారాష్ట్ర - ఉద్ధవ్ థాకరే",
  "అస్సాం - హిమంత బిస్వా శర్మ"
  ],
  correctAnswerIndex: 1,
  explanation: "కేరళ రాష్ట్రం తిరువనంతపురంలోని శాంతిగిరి విద్యాభవన్‌లో తన మొట్టమొదటి AI పాఠశాలను ప్రవేశపెట్టింది. దీనిని భారత మాజీ రాష్ట్రపతి రామ్ నాథ్ కోవింద్ ప్రారంభించారు. ఈ ప్రారంభ వేడుక విద్యా రంగంలో ఒక కొత్త శకానికి నాంది పలికింది. వినూత్న సాంకేతికత మరియు ముందుకు చూసే బోధనా పద్ధతులు."
  ),

  Question(
  questionText: "నేషనల్ హెల్త్ అథారిటీ ఆఫ్ ఇండియా (NHA) '100 మైక్రోసైట్స్' చొరవ కింద ఏ చొరవను ప్రారంభించింది?",options: [
  "నేషనల్ డిజిటల్ హెల్త్ మిషన్ (NDHM)",
  "ఆయుష్మాన్ భారత్ డిజిటల్ మిషన్ (ABDM)",
  "స్వస్త్య సురక్ష యోజన (SSY)",
  "ప్రధాన్ మంత్రి జన్ ఆరోగ్య యోజన (PMJAY)"
  ],
  correctAnswerIndex: 1,
  explanation: "100 మైక్రోసైట్స్' చొరవ కింద, భారతదేశం యొక్క నేషనల్ హెల్త్ అథారిటీ (NHA) మిజోరాం రాజధాని నగరంలో మొట్టమొదటి ఆయుష్మాన్ భారత్ డిజిటల్ మిషన్ (ABDM) మైక్రోసైట్‌ను ఆవిష్కరించింది. ఈ కార్యక్రమం యొక్క ప్రయోజనాలను ఉపయోగించుకోవడం ద్వారా ఆరోగ్య సంరక్షణ రంగాన్ని మార్చడానికి ఏర్పాటు చేయబడింది. డిజిటలైజేషన్."
  ),

  Question(
  questionText: "ఆర్టిఫిషియల్ ఇంటెలిజెన్స్ సిస్టమ్స్‌లో AI యొక్క నీతిని నింపడానికి ఏ సంస్థలు సహకరించాయి?",
  options: [
  "ఇండియన్ కౌన్సిల్ ఫర్ కల్చరల్ రిలేషన్స్ (ICCR) మరియు మినిస్ట్రీ ఆఫ్ ఎలక్ట్రానిక్స్ అండ్ ఇన్ఫర్మేషన్ టెక్నాలజీ",
  "యునైటెడ్ నేషన్స్ ఎడ్యుకేషనల్, సైంటిఫిక్ అండ్ కల్చరల్ ఆర్గనైజేషన్ (UNESCO) మరియు ఇన్ఫర్మేషన్ టెక్నాలజీ, ఎలక్ట్రానిక్స్ అండ్ కమ్యూనికేషన్స్ డిపార్ట్‌మెంట్ ఆఫ్ తెలంగాణ",
  "నేషనల్ ఇన్స్టిట్యూషన్ ఫర్ ట్రాన్స్‌ఫార్మింగ్ ఇండియా (NITI ఆయోగ్) మరియు మినిస్ట్రీ ఆఫ్ సైన్స్ అండ్ టెక్నాలజీ",
  "భారత అంతరిక్ష పరిశోధనా సంస్థ (ఇస్రో) మరియు పర్యావరణ, అటవీ మరియు వాతావరణ మార్పు మంత్రిత్వ శాఖ"
  ],
  correctAnswerIndex: 1,
  explanation: "యునైటెడ్ నేషన్స్ ఎడ్యుకేషనల్, సైంటిఫిక్ అండ్ కల్చరల్ ఆర్గనైజేషన్ (యునెస్కో) మరియు తెలంగాణ ప్రభుత్వంలోని ఇన్ఫర్మేషన్ టెక్నాలజీ, ఎలక్ట్రానిక్స్ అండ్ కమ్యూనికేషన్స్ (ITE&C) డిపార్ట్‌మెంట్ కృత్రిమ మేధస్సు వ్యవస్థల యొక్క సారాంశంలో AI యొక్క నీతిని నింపడానికి ఒక మార్గదర్శక భాగస్వామ్యాన్ని ఏర్పరచుకున్నాయి. ."
  ),

  Question(
  questionText: "పర్యావరణ పరిరక్షణ దిశగా అస్సాం పర్యావరణం మరియు అటవీ శాఖ ఏ ముఖ్యమైన చర్య తీసుకుంది?",
  options: [
  "ఒకేసారి ఉపయోగించే ప్లాస్టిక్‌పై నిషేధం",
  "ప్లాస్టిక్ సంచులపై నిషేధం",
  "1000 ml కెపాసిటీ కంటే ఎక్కువ ప్లాస్టిక్ వాటర్ బాటిళ్లపై నిషేధం",
  "ప్లాస్టిక్ ప్యాకేజింగ్ పై నిషేధం"
  ],
  correctAnswerIndex: 2,
  explanation: "అస్సాం పర్యావరణ మరియు అటవీ శాఖ రాష్ట్రంలో 1000 ml కెపాసిటీ కంటే తక్కువ ప్లాస్టిక్ వాటర్ బాటిళ్ల వాడకం మరియు ఉత్పత్తిపై నిషేధాన్ని ప్రకటించింది. ఈ పరివర్తన కార్యక్రమం, అక్టోబర్ 2, 2023 నుండి అమలు చేయబడుతోంది, ప్లాస్టిక్‌ను ఎదుర్కోవడంలో అస్సాం యొక్క నిబద్ధతను ప్రతిబింబిస్తుంది. కాలుష్యం మరియు స్థిరమైన పద్ధతులను ప్రోత్సహించడం."
  ),

  Question(
  questionText: "ముఖ్యమంత్రి యోగి ఆదిత్యనాథ్ నాయకత్వంలో ఉత్తరప్రదేశ్ క్యాబినెట్ ఏ ప్రతిపాదనలను ఆమోదించింది?",
  options: [
  "మౌలిక సదుపాయాల అభివృద్ధి ప్రాజెక్టులు",
  "యువ సాధికారత కార్యక్రమాలు",
  "విద్యకు సంబంధించిన ప్రతిపాదనలు",
  "ఆరోగ్య సంరక్షణ సంస్కరణలు"
  ],
  correctAnswerIndex: 2,
  explanation: "ముఖ్యమంత్రి యోగి ఆదిత్యనాథ్ నేతృత్వంలోని ఉత్తరప్రదేశ్ క్యాబినెట్, విద్య మరియు యువత సాధికారత పట్ల ప్రభుత్వ నిబద్ధతను ఎత్తిచూపుతూ అనేక ముఖ్యమైన ప్రతిపాదనలకు పచ్చజెండా ఊపింది."
  ),

  Question(
  questionText: "ఇండియన్ ఇన్‌స్టిట్యూట్ ఆఫ్ ట్రాపికల్ మెటియోరాలజీ (IITM) అభివృద్ధి చేసిన ఎయిర్ క్వాలిటీ ఎర్లీ వార్నింగ్ సిస్టమ్ (AQEWS)ని భారతదేశంలోని ఏ నగరం ఆమోదించింది?",
  options: [
  "ఢిల్లీ",
  "ముంబయి",
  "చెన్నై",
  "కోల్‌కతా"
  ],
  correctAnswerIndex: 3,
  explanation: "భారతీయ నగరం కోల్‌కతా పూణేలో ఉన్న ఇండియన్ ఇన్‌స్టిట్యూట్ ఆఫ్ ట్రాపికల్ మెటియోరాలజీ (IITM) అభివృద్ధి చేసిన ఎయిర్ క్వాలిటీ ఎర్లీ వార్నింగ్ సిస్టమ్ (AQEWS)ని అనుసరించడం ద్వారా ఒక ముఖ్యమైన ముందడుగు వేసింది. ఈ వ్యవస్థ వాస్తవ-సమయ వాయు కాలుష్యం రెండింటినీ అందిస్తుంది నగరం లోపల పెరుగుతున్న వాయు కాలుష్య స్థాయిలను పరిష్కరించడానికి సంసిద్ధతను మెరుగుపరచడానికి మరియు చర్యలను సులభతరం చేయడానికి డేటా మరియు అంచనాలు."
  ),

  Question(
  questionText: "గవర్నెన్స్ మరియు లైన్ డిపార్ట్‌మెంట్ కన్వర్జెన్స్ దిశగా అస్సాం క్యాబినెట్ ఎలాంటి సాహసోపేతమైన చర్య తీసుకుంది?",
  options: [
  "కొత్త మంత్రిత్వ శాఖల సృష్టి",
  "కొన్ని విభాగాల రద్దు",
  "నాలుగు కొత్త జిల్లాల ఏర్పాటు",
  "పరిపాలన అధికారాల వికేంద్రీకరణ"
  ],
  correctAnswerIndex: 2,
  explanation: "పరిపాలన యొక్క వికేంద్రీకరణను పెంపొందించడం మరియు లైన్ డిపార్ట్‌మెంట్ల కలయికను మెరుగుపరచడం కోసం, అస్సాం క్యాబినెట్ నాలుగు కొత్త జిల్లాలను రూపొందించింది, వీటిని గతంలో డిసెంబర్‌లో రద్దు చేశారు. కొత్తగా ఏర్పడిన జిల్లాలు హోజాయ్, బిస్వనాథ్, తముల్‌పూర్ మరియు బజాలీ. ."
  ),

  Question(
  questionText: "భారత ప్రభుత్వం ప్రవేశపెట్టిన ఖనన్ ప్రహరీ యాప్ యొక్క ప్రయోజనం ఏమిటి?",
  options: [
  "వన్యప్రాణి సంరక్షణ నివేదిక",
  "అక్రమ మైనింగ్ రిపోర్టింగ్",
  "వాయు కాలుష్య పర్యవేక్షణ",
  "సైబర్‌ సెక్యూరిటీ అవగాహన"
  ],
  correctAnswerIndex: 1,
  explanation: "చట్టవిరుద్ధమైన బొగ్గు తవ్వకం భారతదేశ పర్యావరణం మరియు ఆర్థిక వ్యవస్థ రెండింటికీ గణనీయమైన ప్రమాదాన్ని కలిగిస్తుంది. ఈ సమస్యకు ప్రతిస్పందనగా, ప్రభుత్వం ఖనన్ ప్రహరీ యాప్‌ను ప్రవేశపెట్టింది. ఈ మొబైల్ అప్లికేషన్ పౌరులు బొగ్గు తవ్వకాలకు సంబంధించిన ఏవైనా అనుమానాస్పద కార్యకలాపాలను నివేదించడానికి అనుమతిస్తుంది. వారి సమీపంలో, ఈ చట్టవిరుద్ధమైన ఆచారానికి వ్యతిరేకంగా పోరాటానికి దోహదపడింది."
  ),

  Question(
  questionText: "లాడ్లీ బెహనా పథకానికి సంబంధించి మధ్యప్రదేశ్ ముఖ్యమంత్రి శివరాజ్ సింగ్ చౌహాన్ ఏ ప్రకటనలు చేశారు?",
  options: [
  "ఆర్థిక సహాయం మరియు ఉద్యోగ రిజర్వేషన్లలో పెంపుదల",
  "ఆర్థిక సహాయం మరియు వంట గ్యాస్ సబ్సిడీల పెంపు",
  "ప్రభుత్వ ఉద్యోగాలు, వంటల్లో 35 శాతం రిజర్వేషన్లుగ్యాస్ సబ్సిడీలు",
  "ప్రభుత్వ ఉద్యోగాలలో 35 శాతం రిజర్వేషన్లు మరియు ఆర్థిక సహాయం పెంపు"
  ],
  correctAnswerIndex: 2,
  explanation: "మధ్యప్రదేశ్ ముఖ్యమంత్రి శివరాజ్ సింగ్ చౌహాన్ లాడ్లీ బెహనా పథకంలో మహిళలకు అందించే ఆర్థిక సహాయాన్ని నెలకు ₹ 1,000 నుండి ₹ 1,250 కు పెంచారు. అదనంగా, అతను ప్రభుత్వ ఉద్యోగాల్లో మహిళలకు 35 శాతం రిజర్వేషన్లు ప్రకటించాడు మరియు వంట గ్యాస్ సిలిండర్లు ఇస్తామని చెప్పాడు. 'సావన్' గుర్తుగా ఆగస్టులో మహిళలకు ₹450కి అందించబడింది."
  ),

  Question(
  questionText: "2023-24 ఆర్థిక సంవత్సరం మొదటి త్రైమాసికంలో విదేశీ ప్రత్యక్ష పెట్టుబడులను (FDI) ఆకర్షించడంలో ఏ రాష్ట్రం ముందు వరుసలో నిలిచింది?",
  options: [
  "తెలంగాణ",
  "కర్ణాటక",
  "ఢిల్లీ",
  "మహారాష్ట్ర"
  ],
  correctAnswerIndex: 3,
  explanation: "2023-24 ఆర్థిక సంవత్సరం మొదటి త్రైమాసికంలో, విదేశీ ప్రత్యక్ష పెట్టుబడులను (ఎఫ్‌డిఐ) ఆకర్షించడంలో మహారాష్ట్ర ముందు వరుసలో నిలిచింది. ఎఫ్‌డిఐ మొత్తాన్ని ఆకర్షించడం ద్వారా రాష్ట్రం అగ్రస్థానంలో ఉందని ఉప ముఖ్యమంత్రి దేవేంద్ర ఫడ్నవిస్ గర్వంగా ప్రకటించారు. 36,634 కోట్లకు చేరుకుంది. ఈ చెప్పుకోదగ్గ విజయం ఢిల్లీ, కర్ణాటక మరియు తెలంగాణ వంటి ఇతర ప్రముఖ రాష్ట్రాల కంటే మహారాష్ట్రను ముందంజలో ఉంచింది, దీని సంచిత FDI విలువలు వెనుకబడి ఉన్నాయి."
  ),
  Question(
  questionText: "ప్రధాన్ మంత్రి జన్ ధన్ యోజన (PMJDY) ఏ ముఖ్యమైన విజయాన్ని సాధించింది?",
  options: [
  "విజయవంతమైన అమలులో 9 సంవత్సరాలు దాటింది",
  "9 సంవత్సరాల లోపు 50 కోట్ల జన్ ధన్ ఖాతాలకు చేరుకుంది",
  "సమగ్ర ఆర్థిక చేరిక కార్యక్రమాన్ని ప్రారంభించింది",
  "ఒక ఆర్థిక సంవత్సరంలో 50 కోట్ల లావాదేవీలు పూర్తయ్యాయి"
  ],
  correctAnswerIndex: 1,
  explanation: "ఆకట్టుకునే విజయంలో, భారతదేశంలోని మొత్తం జన్ ధన్ ఖాతాల సంఖ్య 9 సంవత్సరాల కంటే తక్కువ వ్యవధిలో గణనీయమైన 50 కోట్ల మార్కును దాటింది. ఈ విజయవంతమైన చొరవ దేశ ఆర్థిక రంగంలో గణనీయమైన మార్పులను తీసుకువచ్చింది. ఆర్థిక మంత్రిత్వ శాఖ నుండి అధికారిక ప్రకటన."
  ),

  Question(
  questionText: "2022-2023 నుండి 2025-2026 వరకు ఈశాన్య ప్రత్యేక మౌలిక సదుపాయాల అభివృద్ధి పథకం (NESIDS) కొనసాగింపు కోసం ఆమోదించబడిన బడ్జెట్ ఏమిటి?",
  options: [
  "రూ. 5000 కోట్లు",
  "రూ. 6000 కోట్లు",
  "రూ. 7000 కోట్లు",
  "రూ. 8139.50 కోట్లు"
  ],
  correctAnswerIndex: 3,
  explanation: "ఆగస్టు 21, 2023న, ఈశాన్య ప్రాంత అభివృద్ధి మంత్రిత్వ శాఖ 2022-2023 నుండి 2025-2026 కాలానికి రూ. 8139.50 కోట్ల ఆమోదిత బడ్జెట్‌తో నార్త్ ఈస్ట్ స్పెషల్ ఇన్‌ఫ్రాస్ట్రక్చర్ డెవలప్‌మెంట్ స్కీమ్ (NESIDS) కొనసాగింపును ప్రకటించింది. . ఈ చొరవ ఈశాన్య రాష్ట్రాలలో ముఖ్యంగా కనెక్టివిటీ మరియు సామాజిక రంగాలలో మౌలిక సదుపాయాల అభివృద్ధిని పెంపొందించడం లక్ష్యంగా పెట్టుకుంది."
  ),

  Question(
  questionText: "డిఫెన్స్ రీసెర్చ్ అండ్ డెవలప్‌మెంట్ ఆర్గనైజేషన్ (DRDO)కి సంబంధించి భారతదేశంలోని రక్షణ మంత్రిత్వ శాఖ ఏ ముఖ్యమైన నిర్ణయం తీసుకుంది?",
  options: [
  "క్షిపణి కార్యక్రమాలకు నిధుల పెంపు",
  "DRDO కోసం కొత్త టెక్నాలజీ పార్క్‌ను ప్రారంభించింది",
  "క్షిపణి కార్యక్రమం కంటే DRDO యొక్క సమగ్ర పునరుద్ధరణ",
  "కొత్త పరిశోధనా సంస్థను స్థాపించారు"
  ],
  correctAnswerIndex: 2,
  explanation: "డిఫెన్స్ రీసెర్చ్ అండ్ డెవలప్‌మెంట్ ఆర్గనైజేషన్ (DRDO) యొక్క సమగ్ర పునరుద్ధరణను చేపట్టేందుకు భారతదేశంలోని రక్షణ మంత్రిత్వ శాఖ ఒక ముఖ్యమైన నిర్ణయం తీసుకుంది. దాని ఆలస్యమైన ప్రాజెక్ట్‌లు మరియు వ్యయ ఓవర్‌రన్‌లకు దీర్ఘకాలంగా గుర్తింపు పొందిన DRDO ఇప్పుడు పరివర్తనకు గురికానుంది. క్షిపణి కార్యక్రమం కంటే దాని సాంకేతిక పురోగతిని మెరుగుపరుస్తుంది."
  ),

  Question(
  questionText: "ఫిస్కల్ రెస్పాన్సిబిలిటీ మరియు అకౌంటబిలిటీని ప్రోత్సహించడానికి భారత ప్రభుత్వం సెప్టెంబర్ 1 నుండి ఏ మార్గదర్శక పథకాన్ని ప్రారంభించబోతోంది?",
  options: [
  "డిజిటల్ ఇండియా ప్రాజెక్ట్",
  "ఆయుష్మాన్ భారత్ డిజిటల్ మిషన్",
  "మేరా బిల్ మేరా అధికార్ ఇన్‌వాయిస్ ప్రోత్సాహక పథకం",
  "స్వచ్ఛ భారత్ అభియాన్"
  ],
  correctAnswerIndex: 2,
  explanation: "ఆర్థిక లావాదేవీలలో పారదర్శకతను పెంపొందించడం మరియు వినియోగదారులకు సాధికారత కల్పించడం కోసం ఒక ముఖ్యమైన చర్యలో, భారత ప్రభుత్వం 'మేరా బిల్ మేరా అధికార్' ఇన్‌వాయిస్ ప్రోత్సాహక పథకాన్ని ప్రారంభించనుంది. ఈ మార్గదర్శక పథకం, సెప్టెంబర్ 1 నుండి ప్రారంభం కానున్నది. కొనుగోళ్ల సమయంలో బిల్లులను అభ్యర్థించే అలవాటు, తద్వారా ఆర్థిక బాధ్యత మరియు జవాబుదారీ సంస్కృతిని పెంపొందించడం."
  ),

  Question(
  questionText: "ప్రధాన్ మంత్రి జన్ ధన్ యోజన (PMJDY) ఎప్పుడు ప్రారంభించబడింది మరియు ఇది ఇటీవల ఏ మైలురాయిని సాధించింది?",
  options: [
  "ఆగస్టు 15, 2014న ప్రారంభించబడింది మరియు 10 సంవత్సరాలు పూర్తయింది",
  "ఆగస్టు 28, 2014న ప్రారంభించబడింది మరియు 9 సంవత్సరాలలోపు 50 కోట్ల జన్ ధన్ ఖాతాలను దాటింది",
  "సెప్టెంబర్ 1, 2014న ప్రారంభించబడింది మరియు 9 సంవత్సరాలు పూర్తయింది",
  "ఆగస్టు 28, 2013న ప్రారంభించబడింది మరియు 10 సంవత్సరాలలో 40 కోట్ల జన్ ధన్ ఖాతాలకు చేరుకుంది"
  ],
  correctAnswerIndex: 1,
  explanation: "ప్రధాన్ మంత్రి జన్ ధన్ యోజన (PMJDY) - నేషనల్ మిషన్ ఫర్ ఫైనాన్షియల్ ఇన్‌క్లూజన్ - విజయవంతంగా అమలులోకి వచ్చి తొమ్మిదేళ్లు పూర్తి చేసుకుంది. ఆగస్టు 28, 2014న ప్రధాన మంత్రి శ్రీ నరేంద్ర మోదీ ద్వారా ప్రారంభించబడిన PMJDY అత్యంత విస్తృతమైన వాటిలో ఒకటిగా నిలుస్తుంది. ప్రపంచవ్యాప్తంగా ఆర్థిక చేరిక కార్యక్రమాలు, విముక్తి లక్ష్యంగాపేదరికం యొక్క చక్రం నుండి ఆర్థికంగా అట్టడుగున ఉన్నవారు."
  ),

  Question(
  questionText: "వ్యవసాయం & రైతు సంక్షేమ శాఖ సహాయ మంత్రి సుశ్రీ శోభా కరంద్లాజే మరియు మోల్డోవా ఉప ప్రధాన మంత్రి మరియు వ్యవసాయం & ఆహార పరిశ్రమల మంత్రి మిస్టర్ వ్లాదిమిర్ బోలియా మధ్య ఎలాంటి సహకారం జరిగింది?",
  options: [
  "ద్వైపాక్షిక వాణిజ్య ఒప్పందం",
  "వ్యవసాయ సాంకేతిక మార్పిడి కార్యక్రమం",
  "వాతావరణ మార్పుపై ఉమ్మడి పరిశోధన చొరవ",
  "ప్రపంచ ఆహార భద్రతపై చర్చించేందుకు సమావేశం"
  ],
  correctAnswerIndex: 0,
  explanation: "జూలై 31, 2023న, వ్యవసాయం & రైతు సంక్షేమ శాఖ సహాయ మంత్రి సుశ్రీ శోభా కరంద్లాజే మరియు మోల్డోవా ఉప ప్రధాన మంత్రి మరియు వ్యవసాయం & ఆహార పరిశ్రమల మంత్రి మిస్టర్ వ్లాదిమిర్ బోలియా మధ్య కృషిలో సమావేశం జరిగింది. న్యూఢిల్లీలోని భవన్."
  ),

  Question(
  questionText: "రైల్వే మంత్రిత్వ శాఖ మరియు ఇండియన్ ఇన్‌స్టిట్యూట్ ఆఫ్ టెక్నాలజీ మద్రాస్ (IIT మద్రాస్) మధ్య సంతకం చేసిన అవగాహన ఒప్పందం (MOU) యొక్క దృష్టి ఏమిటి?",
  options: [
  "రైల్వే విశ్వవిద్యాలయం స్థాపన",
  "హై-స్పీడ్ రైలు ప్రాజెక్టుల అమలు",
  "గ్రామీణ ప్రాంతాల్లో రైల్వే మౌలిక సదుపాయాల అభివృద్ధి",
  "భారతీయ రైల్వేల కోసం ఇండియా 5G టెస్ట్‌బెడ్ ఏర్పాటు"
  ],
  correctAnswerIndex: 3,
  explanation: "రైల్వే మంత్రిత్వ శాఖ మరియు ఇండియన్ ఇన్స్టిట్యూట్ ఆఫ్ టెక్నాలజీ మద్రాస్ (IIT మద్రాస్) సికింద్రాబాద్‌లోని ఇండియన్ రైల్వే ఇన్‌స్టిట్యూట్ ఆఫ్ సిగ్నల్ ఇంజనీరింగ్ అండ్ టెలికమ్యూనికేషన్స్ (IRISET)లో ఇండియా 5G టెస్ట్‌బెడ్‌ను స్థాపించడానికి అవగాహన ఒప్పందం ((MoU)పై సంతకం చేశాయి. భారతీయ రైల్వేల కోసం 5G వినియోగ కేసుల పరీక్ష మరియు అభివృద్ధికి ఈ సౌకర్యం అంకితం చేయబడుతుంది."
  ),

  Question(
  questionText: "పెట్రోలియం మరియు సహజ వాయువు నియంత్రణ మండలి (PNGRB) మరియు ప్రపంచ బ్యాంకు మధ్య ఏ సహకారం జరిగింది?",
  options: [
  "సహజ వాయువు మౌలిక సదుపాయాల అభివృద్ధి",
  "సహజ వాయువులో హైడ్రోజన్ మిశ్రమం పరిచయం",
  "కొత్త చమురు నిల్వల అన్వేషణ",
  "చమురు పైపులైన్ల నిర్మాణం"
  ],
  correctAnswerIndex: 1,
  explanation: "పెట్రోలియం మరియు సహజ వాయువు నియంత్రణ మండలి (PNGRB) మరియు ప్రపంచ బ్యాంకు సహజ వాయువులో హైడ్రోజన్‌ను ఏకీకృతం చేయడానికి మరియు దేశంలో గ్యాస్ పైప్‌లైన్‌ల ద్వారా వాటి ప్రసారం కోసం మౌలిక సదుపాయాలను ఏర్పాటు చేయడానికి సమగ్ర రోడ్‌మ్యాప్‌ను రూపొందించడానికి దళాలు చేరాయి."
  ),

  Question(
  questionText: "ట్రావెల్ కంపెనీ MakeMyTrip మరియు పర్యాటక మంత్రిత్వ శాఖ మధ్య ఏ భాగస్వామ్యం ప్రకటించబడింది?",
  options: [
  "దేశీయ పర్యాటక ప్రమోషన్",
  "కొత్త వీసా వ్యవస్థ పరిచయం",
  "కొత్త విమానాశ్రయాల అభివృద్ధి",
  "600 పైగా ప్రత్యేక ప్రయాణ గమ్యస్థానాల పరిచయం"
  ],
  correctAnswerIndex: 3,
  explanation: "ప్రయాణ సంస్థ MakeMyTrip 600కు పైగా ప్రత్యేకమైన మరియు అసాధారణమైన ప్రయాణ గమ్యస్థానాలను పరిచయం చేయడానికి పర్యాటక మంత్రిత్వ శాఖతో ఒక సహకారాన్ని ప్రకటించింది. ఈ చొరవను సులభతరం చేయడానికి కంపెనీ 'ట్రావెలర్స్ మ్యాప్ ఆఫ్ ఇండియా' పేరుతో ఒక ప్రత్యేక మైక్రోసైట్‌ను ప్రవేశపెట్టింది."
  ),

  Question(
  questionText: "ఆల్ ఇండియా కౌన్సిల్ ఫర్ టెక్నికల్ ఎడ్యుకేషన్ (AICTE) మరియు Jio ఇన్స్టిట్యూట్ మధ్య సహకారం యొక్క లక్ష్యం ఏమిటి?",
  options: [
  "విద్యా సంస్థలలో సైబర్ భద్రతను పెంపొందించడం",
  "కొత్త ఇంజనీరింగ్ కోర్సులను అభివృద్ధి చేయడం",
  "ఆర్టిఫిషియల్ ఇంటెలిజెన్స్ (AI) మరియు డేటా సైన్స్ (DS)పై అవగాహనతో ఫ్యాకల్టీ సభ్యులను సన్నద్ధం చేయడం",
  "విద్యా సంస్థల భౌతిక మౌలిక సదుపాయాలను మెరుగుపరచడం"
  ],
  correctAnswerIndex: 2,
  explanation: "విద్యా రంగంలో ఆర్టిఫిషియల్ ఇంటెలిజెన్స్ (AI) మరియు డేటా సైన్స్ (DS) ఏకీకరణను ముందుకు తీసుకెళ్లే దిశగా ఆల్ ఇండియా కౌన్సిల్ ఫర్ టెక్నికల్ ఎడ్యుకేషన్ (AICTE) ఒక ముఖ్యమైన అడుగు వేసింది. ప్రఖ్యాత జియో ఇన్‌స్టిట్యూట్‌తో భాగస్వామ్యంతో AICTE ఆవిష్కరించింది. AI మరియు DS గురించి లోతైన అవగాహనతో అకడమిక్ లీడర్‌లు మరియు సీనియర్ ఫ్యాకల్టీ సభ్యులను సన్నద్ధం చేయడానికి ఉద్దేశించిన సమగ్ర ఫ్యాకల్టీ డెవలప్‌మెంట్ ప్రోగ్రామ్."
  ),

  Question(
  questionText: "ఇండియా స్టాక్ టెక్నాలజీని పంచుకోవడానికి ఏ రెండు సంస్థలు ముఖ్యమైన భాగస్వామ్యంలోకి ప్రవేశించాయి?",
  options: [
  "భారతదేశం మరియు యునైటెడ్ స్టేట్స్",
  "భారతదేశం మరియు ఆస్ట్రేలియా",
  "ఇండియా మరియు ట్రినిడాడ్ మరియు టొబాగో",
  "భారతదేశం మరియు దక్షిణాఫ్రికా"
  ],
  correctAnswerIndex: 2,
  explanation: "ప్రఖ్యాత INDIA STACK సాంకేతికతను పంచుకోవడానికి భారతదేశం మరియు ట్రినిడాడ్ మరియు టొబాగో ఇటీవల ఒక అవగాహన ఒప్పందం (MOU)పై సంతకం చేయడం ద్వారా ఒక ముఖ్యమైన భాగస్వామ్యాన్ని నమోదు చేశాయి. ఈ ఓపెన్ APIలు మరియు డిజిటల్ పబ్లిక్ వస్తువుల సేకరణ, భారతదేశం ముందుండి, మెరుగుపరచడానికి రూపొందించబడింది. గుర్తింపు, డేటా మరియు చెల్లింపు సేవలు పెద్ద ఎత్తున. ఈ చర్య సహకారం మరియు సాంకేతికత భాగస్వామ్యం ద్వారా దేశాల డిజిటల్ పరివర్తనకు సహాయం చేయడానికి భారతదేశం యొక్క నిబద్ధతను ప్రతిబింబిస్తుంది."
  ),

  Question(
  questionText: "భారతదేశం మరియు ఆసియాన్ దేశాల మధ్య ఒప్పందం యొక్క దృష్టి ఏమిటి?",
  options: [
  "అంతరిక్ష సహకారం యొక్క అన్వేషణ",
  "వస్తువుల కోసం ఇప్పటికే ఉన్న స్వేచ్ఛా వాణిజ్య ఒప్పందం యొక్క సమీక్ష",
  "నూతన వ్యవసాయ పద్ధతుల అభివృద్ధి",
  "వాతావరణ మార్పుపై ఉమ్మడి పరిశోధన"
  ],
  correctAnswerIndex: 1,
  explanation: "ఒక ముఖ్యమైన చర్యలో, భారతదేశంమరియు ASEAN దేశాలు వస్తువుల కోసం తమ ప్రస్తుత స్వేచ్ఛా వాణిజ్య ఒప్పందాన్ని పునఃపరిశీలించడానికి ఒక ఒప్పందానికి వచ్చాయి. రెండు పార్టీల మధ్య ప్రస్తుతం ఉన్న వాణిజ్య అసమానతలు మరియు అసమానతలను పరిష్కరించడం ఈ సమీక్ష లక్ష్యం. ద్వైపాక్షిక వాణిజ్య సంబంధాలను పెంపొందించుకోవడానికి నిబద్ధతను సూచిస్తూ వాణిజ్య మంత్రిత్వ శాఖ ఈ ప్రకటన చేసింది."
  ),

  Question(
  questionText: "రాబోయే ICC పురుషుల క్రికెట్ ప్రపంచ కప్ 2023 కోసం అంతర్జాతీయ క్రికెట్ కౌన్సిల్ (ICC) ఎలాంటి ఉత్తేజకరమైన సహకారాన్ని అందించింది?",
  options: [
  "స్పోర్ట్స్ పరికరాల తయారీదారుతో భాగస్వామ్యం",
  "ప్రముఖ సాంకేతిక సంస్థతో సహకారం",
  "మాస్టర్‌కార్డ్‌తో గ్లోబల్ పార్టనర్‌షిప్",
  "మీడియా నెట్‌వర్క్‌తో ప్రత్యేక ప్రసార హక్కులు"
  ],
  correctAnswerIndex: 2,
  explanation: "ఇంటర్నేషనల్ క్రికెట్ కౌన్సిల్ (ICC) ఒక ముఖ్యమైన ప్రకటన చేసింది, ఇది మాస్టర్ కార్డ్‌తో థ్రిల్లింగ్ సహకారాన్ని వెల్లడించింది, ఇది రాబోయే ICC పురుషుల క్రికెట్ ప్రపంచ కప్ 2023కి గ్లోబల్ పార్టనర్‌గా మారనుంది. అక్టోబర్ 5 నుండి భారతదేశంలో జరగనుంది. నవంబర్ 19, 2023 వరకు, మాస్టర్ కార్డ్ మరియు ICC మధ్య భాగస్వామ్యం ప్రపంచవ్యాప్తంగా ఉన్న అభిమానులకు క్రికెట్ అనుభవాన్ని మెరుగుపరచడానికి సిద్ధంగా ఉంది."
  ),

  Question(
  questionText: "మహారాష్ట్ర రాష్ట్ర ప్రభుత్వం మరియు జర్మన్ ప్రొఫెషనల్ ఫుట్‌బాల్ లీగ్ బుండెస్లిగా మధ్య ఏ సహకారం జరిగింది?",
  options: [
  "యువ అభివృద్ధి కార్యక్రమం",
  "అంతర్జాతీయ ఫుట్‌బాల్ టోర్నమెంట్ యొక్క ఉమ్మడి హోస్టింగ్",
  "కొత్త ఫుట్‌బాల్ లీగ్ పరిచయం",
  "మహారాష్ట్రలో ఫుట్‌బాల్ స్థాయిని పెంచడానికి అవగాహన ఒప్పందం (MOU)"
  ],
  correctAnswerIndex: 3,
  explanation: "మహారాష్ట్రలో ఫుట్‌బాల్ స్థాయిని పెంచే దిశగా ఒక ముఖ్యమైన అడుగులో, రాష్ట్ర ప్రభుత్వం ప్రఖ్యాత జర్మన్ ప్రొఫెషనల్ ఫుట్‌బాల్ లీగ్ బుండెస్లిగాతో అవగాహన ఒప్పందం (MOU) కుదుర్చుకుంది."
  ),

  Question(
  questionText: "గోవా షిప్‌యార్డ్ లిమిటెడ్ (GSL) మరియు కెన్యా షిప్‌యార్డ్స్ లిమిటెడ్ (KSL) మధ్య సంతకం చేసిన అవగాహన ఒప్పందం (MOU) యొక్క లక్ష్యం ఏమిటి?",
  options: [
  "జాయింట్ షిప్ తయారీ సౌకర్యాల స్థాపన",
  "సముద్ర భద్రతా సహకారాన్ని బలోపేతం చేయడం",
  "కొత్త షిప్పింగ్ మార్గాల అభివృద్ధి",
  "హిందూ మహాసముద్ర ప్రాంతం (IOR)లో కొత్త చమురు నిల్వల అన్వేషణ"
  ],
  correctAnswerIndex: 1,
  explanation: "హిందూ మహాసముద్ర ప్రాంతం (IOR), ముఖ్యంగా ఆఫ్రికా తూర్పు తీరంలో భద్రతను పెంపొందించే దాని ప్రయత్నాలతో, గోవా షిప్‌యార్డ్ లిమిటెడ్ (GSL) మరియు కెన్యా షిప్‌యార్డ్స్ లిమిటెడ్ (KSL) మధ్య ఒక అవగాహన ఒప్పందం (MOU) సంతకం చేయబడింది రెండు దేశాల మధ్య సముద్ర భద్రతా సహకారాన్ని బలోపేతం చేయండి."
  ),

  Question(
  questionText: "నేషనల్ ఇన్స్టిట్యూషన్ ఫర్ ట్రాన్స్‌ఫార్మింగ్ ఇండియా (NITI ఆయోగ్) మరియు యునైటెడ్ నేషన్స్ డెవలప్‌మెంట్ ప్రోగ్రామ్ (UNDP) మధ్య సంతకం చేసిన మెమోరాండం ఆఫ్ అండర్స్టాండింగ్ (MOU) యొక్క దృష్టి ఏమిటి?",
  options: [
  "డిజిటల్ విద్యా కార్యక్రమాల అమలు",
  "స్థిరమైన మరియు సమ్మిళిత అభివృద్ధిని ప్రోత్సహించడం",
  "పునరుత్పాదక ఇంధన వనరుల అన్వేషణ",
  "నూతన వ్యవసాయ పద్ధతుల అభివృద్ధి"
  ],
  correctAnswerIndex: 1,
  explanation: "నేషనల్ ఇన్స్టిట్యూషన్ ఫర్ ట్రాన్స్‌ఫార్మింగ్ ఇండియా (NITI ఆయోగ్), సస్టైనబుల్ డెవలప్‌మెంట్ గోల్స్ (SDGలు) దిశగా భారతదేశం యొక్క పురోగతిని పర్యవేక్షించే బాధ్యత కలిగిన సెంట్రల్ థింక్ ట్యాంక్ మరియు యునైటెడ్ నేషన్స్ డెవలప్‌మెంట్ ప్రోగ్రామ్ (UNDP) ముఖ్యమైన అవగాహనా ఒప్పందం (MOU)పై సంతకం చేశాయి. దాని SDGలను సాధించే దిశగా భారతదేశ ప్రయాణాన్ని వేగవంతం చేయడం లక్ష్యంగా పెట్టుకుంది. ఈ సహకారం దేశంలో స్థిరమైన మరియు సమ్మిళిత అభివృద్ధిని నడపడానికి నిబద్ధతను నొక్కి చెబుతుంది."
  ),
  Question(
  questionText: "ఒరిస్సా హైకోర్టు 33వ ప్రధాన న్యాయమూర్తిగా ఎవరు నియమితులయ్యారు?",
  options: [
  "జస్టిస్ సుభాసిస్ తలపత్ర",
  "జస్టిస్ ఎన్.వి. రమణ",
  "జస్టిస్ ప్రకాష్ శ్రీవాస్తవ",
  "జస్టిస్ సంజయ్ కుమార్ అగర్వాల్"
  ],
  correctAnswerIndex: 0,
  explanation: "ఒరిస్సా హైకోర్టు 33వ ప్రధాన న్యాయమూర్తిగా జస్టిస్ సుభాసిస్ తలపత్రా నియమితులయ్యారు."
  ),

  Question(
  questionText: "సెంట్రల్ బోర్డ్ ఆఫ్ పరోక్ష పన్నులు మరియు కస్టమ్స్ (CBIC) ఛైర్మన్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "IRS అధికారి సంజయ్ కుమార్ అగర్వాల్",
  "జస్టిస్ సుభాసిస్ తలపత్ర",
  "ప్రకాష్ శ్రీవాస్తవ",
  "గీతికా శ్రీవాస్తవ"
  ],
  correctAnswerIndex: 0,
  explanation: "IRS అధికారి సంజయ్ కుమార్ అగర్వాల్ సెంట్రల్ బోర్డ్ ఆఫ్ పరోక్ష పన్నులు మరియు కస్టమ్స్ (CBIC) ఛైర్మన్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "నేషనల్ గ్రీన్ ట్రిబ్యునల్ (NGT) చైర్‌పర్సన్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "జస్టిస్ సంజయ్ కుమార్ అగర్వాల్",
  "గీతికా శ్రీవాస్తవ",
  "ప్రకాష్ శ్రీవాస్తవ",
  "జస్టిస్ సుభాసిస్ తలపత్ర"
  ],
  correctAnswerIndex: 2,
  explanation: "నేషనల్ గ్రీన్ ట్రిబ్యునల్ (NGT) చైర్‌పర్సన్‌గా ప్రకాష్ శ్రీవాస్తవ నియమితులయ్యారు."
  ),

  Question(
  questionText: "పాకిస్తాన్‌లోని ఇస్లామాబాద్‌లోని హైకమిషన్‌లో భారతదేశం యొక్క కొత్త ఛార్జ్ డి'అఫైర్స్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "జస్టిస్ సంజయ్ కుమార్ అగర్వాల్",
  "గీతికా శ్రీవాస్తవ",
  "ప్రకాష్ శ్రీవాస్తవ",
  "జస్టిస్ సుభాసిస్ తలపత్ర"
  ],
  correctAnswerIndex: 1,explanation: "పాకిస్తాన్‌లోని ఇస్లామాబాద్‌లోని హైకమిషన్‌లో గీతికా శ్రీవాస్తవ భారతదేశం యొక్క కొత్త ఛార్జ్ డి'అఫైర్స్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "సింగపూర్ ఇంటర్నేషనల్ మీడియేషన్ సెంటర్ (SIMC) యొక్క ఇంటర్నేషనల్ మధ్యవర్తి ప్యానెల్ సభ్యులుగా ఎవరు నియమితులయ్యారు?",
  options: [
  "జస్టిస్ సుభాసిస్ తలపత్ర",
  "జస్టిస్ ఎన్.వి. రమణ",
  "రాహుల్ ద్రవిడ్",
  "గీతికా శ్రీవాస్తవ"
  ],
  correctAnswerIndex: 1,
  explanation: "జస్టిస్ N.V. రమణ సింగపూర్ ఇంటర్నేషనల్ మీడియేషన్ సెంటర్ (SIMC) యొక్క అంతర్జాతీయ మధ్యవర్తి ప్యానెల్ సభ్యునిగా నియమితులయ్యారు."
  ),

  Question(
  questionText: "భారత్ పెట్రోలియం కార్పొరేషన్ లిమిటెడ్ (BPCL) బ్రాండ్ అంబాసిడర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "రాహుల్ ద్రవిడ్",
  "నీలకాంత్ మిశ్రా",
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్"
  ],
  correctAnswerIndex: 0,
  explanation: "రాహుల్ ద్రవిడ్ భారత్ పెట్రోలియం కార్పొరేషన్ లిమిటెడ్ (BPCL) బ్రాండ్ అంబాసిడర్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "యూనిక్ ఐడెంటిఫికేషన్ అథారిటీ ఆఫ్ ఇండియా పార్ట్ టైమ్ చైర్‌పర్సన్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "నీలకాంత్ మిశ్రా",
  "అమిత్ జింగ్రాన్",
  "వైభవ్ తనేజా",
  "రాహుల్ ద్రవిడ్"
  ],
  correctAnswerIndex: 0,
  explanation: "నీల్‌కాంత్ మిశ్రా యూనిక్ ఐడెంటిఫికేషన్ అథారిటీ ఆఫ్ ఇండియా పార్ట్ టైమ్ చైర్‌పర్సన్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "టెస్లా కొత్త చీఫ్ ఫైనాన్షియల్ ఆఫీసర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్",
  "రాహుల్ ద్రవిడ్",
  "నీలకంఠ మిశ్రా"
  ],
  correctAnswerIndex: 0,
  explanation: "టెస్లా కొత్త చీఫ్ ఫైనాన్షియల్ ఆఫీసర్‌గా వైభవ్ తనేజా నియమితులయ్యారు."
  ),

  Question(
  questionText: "SBI లైఫ్ ఇన్సూరెన్స్ కంపెనీ లిమిటెడ్‌కి మేనేజింగ్ డైరెక్టర్ మరియు చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్",
  "కరీనా కపూర్ ఖాన్",
  "ఆర్. దొరైస్వామి"
  ],
  correctAnswerIndex: 1,
  explanation: "SBI లైఫ్ ఇన్సూరెన్స్ కంపెనీ లిమిటెడ్‌కి మేనేజింగ్ డైరెక్టర్ మరియు చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్‌గా అమిత్ జింగ్రాన్ నియమితులయ్యారు."
  ),

  Question(
  questionText: "ప్లక్ బ్రాండ్ అంబాసిడర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "కరీనా కపూర్ ఖాన్",
  "వైభవ్ తనేజా",
  "ఆర్. దొరైస్వామి",
  "అమిత్ జింగ్రాన్"
  ],
  correctAnswerIndex: 0,
  explanation: "ప్లక్ బ్రాండ్ అంబాసిడర్‌గా కరీనా కపూర్ ఖాన్ నియమితులయ్యారు."
  ),

  Question(
  questionText: "లైఫ్ ఇన్సూరెన్స్ కార్పొరేషన్ ఆఫ్ ఇండియా (LIC) మేనేజింగ్ డైరెక్టర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "ఆర్. దొరైస్వామి",
  "అమిత్ జింగ్రాన్",
  "కరీనా కపూర్ ఖాన్"
  ],
  correctAnswerIndex: 1,
  explanation: "R. దొరైస్వామి లైఫ్ ఇన్సూరెన్స్ కార్పొరేషన్ ఆఫ్ ఇండియా (LIC) మేనేజింగ్ డైరెక్టర్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "కొత్తగా నియమించబడిన SEBI హోల్-టైమ్ సభ్యులు ఎవరు?",
  options: [
  "వైభవ్ తనేజా మరియు కరీనా కపూర్ ఖాన్",
  "కమలేష్ వర్ష్నీ మరియు అమర్జీత్ సింగ్",
  "రాహుల్ ద్రవిడ్ మరియు N.V. రమణ",
  "అమిత్ జింగ్రాన్ మరియు నీలకంత్ మిశ్రా"
  ],
  correctAnswerIndex: 1,
  explanation: "కొత్తగా నియమించబడిన SEBI హోల్-టైమ్ సభ్యులు కమలేష్ వర్ష్నే మరియు అమర్జీత్ సింగ్."
  ),

  Question(
  questionText: "పవర్ ఫైనాన్స్ కార్పొరేషన్ (PFC) ఛైర్మన్ మరియు మేనేజింగ్ డైరెక్టర్ (CMD)గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "పర్మీందర్ చోప్రా",
  "అమిత్ జింగ్రాన్",
  "ఆర్. దొరైస్వామి"
  ],
  correctAnswerIndex: 1,
  explanation: "పవర్ ఫైనాన్స్ కార్పొరేషన్ (PFC) ఛైర్మన్ మరియు మేనేజింగ్ డైరెక్టర్ (CMD)గా పర్మీందర్ చోప్రా నియమితులయ్యారు."
  ),

  Question(
  questionText: "సౌత్ ఇండియన్ బ్యాంక్ మేనేజింగ్ డైరెక్టర్ & CEO గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్",
  "పిఆర్ శేషాద్రి",
  "రాహుల్ ద్రవిడ్"
  ],
  correctAnswerIndex: 2,
  explanation: "PR శేషాద్రి సౌత్ ఇండియన్ బ్యాంక్ మేనేజింగ్ డైరెక్టర్ & CEO గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "Viacom18 యొక్క కొత్త CEO గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "కిరణ్ మణి",
  "ఆర్. దొరైస్వామి",
  "అమిత్ జింగ్రాన్"
  ],
  correctAnswerIndex: 1,
  explanation: "కిరణ్ మణి Viacom18 యొక్క కొత్త CEO గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) నియమించిన నలుగురు డైరెక్టర్లు ఎవరు?",
  options: [
  "వైభవ్ తనేజా, కరీనా కపూర్ ఖాన్, ఆర్. దొరైస్వామి, మరియు కమలేష్ వర్షిణి",
  "కేతన్ శివ్జీ వికాంసే, మృగాంక్ మధుకర్ పరాంజపే, రాజేష్ కుమార్ దూబే, మరియు ధర్మేంద్ర సింగ్ షెకావత్",
  "అమిత్ ఝింగ్రాన్, నీలకంత్ మిశ్రా, రాహుల్ ద్రవిడ్ మరియు పర్మీందర్ చోప్రా",
  "కిరణ్ మణి, పిఆర్ శేషాద్రి, గీతిక శ్రీవాస్తవ, మరియు సంజయ్ కుమార్ అగర్వాల్"
  ],
  correctAnswerIndex: 1,
  explanation: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) నలుగురు డైరెక్టర్లను నియమించింది: కేతన్ శివ్జీ వికామ్సే, మృగాంక్ మధుకర్ పరాంజపే, రాజేష్ కుమార్ దూబే మరియు ధర్మేంద్ర సింగ్ షెకావత్."
  ),

  Question(
  questionText: "ఎలక్షన్ కమిషన్ (EC) యొక్క \"జాతీయ చిహ్నం\"గా ఎవరు నియమితులయ్యారు?",
  options: [
  "రాహుల్ ద్రవిడ్",
  "కరీనా కపూర్ ఖాన్",
  "సచిన్ టెండూల్కర్",
  "గీతికా శ్రీవాస్తవ"
  ],
  correctAnswerIndex: 2,
  explanation: "సచిన్ టెండూల్కర్‌గా నియమితులయ్యారుఎన్నికల సంఘం (EC) \"జాతీయ చిహ్నం\"."
  ),

  Question(
  questionText: "ఇన్ఫోసిస్ బ్రాండ్ అంబాసిడర్‌లు ఎవరు?",
  options: [
  "కరీనా కపూర్ ఖాన్ మరియు సచిన్ టెండూల్కర్",
  "రాహుల్ ద్రవిడ్ మరియు N.V. రమణ",
  "వైభవ్ తనేజా మరియు కమలేష్ వర్ష్నే",
  "రాఫెల్ నాదల్ మరియు ఇగా స్విటెక్"
  ],
  correctAnswerIndex: 3,
  explanation: "రాఫెల్ నాదల్ మరియు ఇగా స్విటెక్ ఇన్ఫోసిస్ బ్రాండ్ అంబాసిడర్‌లు."
  ),

  Question(
  questionText: "ఫైనాన్స్ ఇండస్ట్రీ డెవలప్‌మెంట్ కౌన్సిల్ (FIDC) కొత్త ఛైర్మన్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "ఉమేష్ రేవంకర్",
  "అమిత్ జింగ్రాన్",
  "పర్మీందర్ చోప్రా",
  "వైభవ్ తనేజా"
  ],
  correctAnswerIndex: 0,
  explanation: "మిస్టర్ ఉమేష్ రేవంకర్ ఫైనాన్స్ ఇండస్ట్రీ డెవలప్‌మెంట్ కౌన్సిల్ (FIDC) కొత్త ఛైర్మన్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "టెస్లా కొత్త చీఫ్ ఫైనాన్షియల్ ఆఫీసర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్",
  "రాహుల్ ద్రవిడ్",
  "నీలకంఠ మిశ్రా"
  ],
  correctAnswerIndex: 0,
  explanation: "టెస్లా కొత్త చీఫ్ ఫైనాన్షియల్ ఆఫీసర్‌గా వైభవ్ తనేజా నియమితులయ్యారు."
  ),

  Question(
  questionText: "SBI లైఫ్ ఇన్సూరెన్స్ కంపెనీ లిమిటెడ్‌కి మేనేజింగ్ డైరెక్టర్ మరియు చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్",
  "కరీనా కపూర్ ఖాన్",
  "ఆర్. దొరైస్వామి"
  ],
  correctAnswerIndex: 1,
  explanation: "SBI లైఫ్ ఇన్సూరెన్స్ కంపెనీ లిమిటెడ్‌కి మేనేజింగ్ డైరెక్టర్ మరియు చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్‌గా అమిత్ జింగ్రాన్ నియమితులయ్యారు."
  ),

  Question(
  questionText: "ప్లక్ బ్రాండ్ అంబాసిడర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "కరీనా కపూర్ ఖాన్",
  "వైభవ్ తనేజా",
  "ఆర్. దొరైస్వామి",
  "అమిత్ జింగ్రాన్"
  ],
  correctAnswerIndex: 0,
  explanation: "ప్లక్ బ్రాండ్ అంబాసిడర్‌గా కరీనా కపూర్ ఖాన్ నియమితులయ్యారు."
  ),

  Question(
  questionText: "లైఫ్ ఇన్సూరెన్స్ కార్పొరేషన్ ఆఫ్ ఇండియా (LIC) మేనేజింగ్ డైరెక్టర్‌గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "ఆర్. దొరైస్వామి",
  "అమిత్ జింగ్రాన్",
  "కరీనా కపూర్ ఖాన్"
  ],
  correctAnswerIndex: 1,
  explanation: "R. దొరైస్వామి లైఫ్ ఇన్సూరెన్స్ కార్పొరేషన్ ఆఫ్ ఇండియా (LIC) మేనేజింగ్ డైరెక్టర్‌గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "కొత్తగా నియమించబడిన SEBI హోల్-టైమ్ సభ్యులు ఎవరు?",
  options: [
  "వైభవ్ తనేజా మరియు కరీనా కపూర్ ఖాన్",
  "కమలేష్ వర్ష్నీ మరియు అమర్జీత్ సింగ్",
  "రాహుల్ ద్రవిడ్ మరియు N.V. రమణ",
  "అమిత్ జింగ్రాన్ మరియు నీలకంత్ మిశ్రా"
  ],
  correctAnswerIndex: 1,
  explanation: "కొత్తగా నియమించబడిన SEBI హోల్-టైమ్ సభ్యులు కమలేష్ వర్ష్నే మరియు అమర్జీత్ సింగ్."
  ),

  Question(
  questionText: "పవర్ ఫైనాన్స్ కార్పొరేషన్ (PFC) ఛైర్మన్ మరియు మేనేజింగ్ డైరెక్టర్ (CMD)గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "పర్మీందర్ చోప్రా",
  "అమిత్ జింగ్రాన్",
  "ఆర్. దొరైస్వామి"
  ],
  correctAnswerIndex: 1,
  explanation: "పవర్ ఫైనాన్స్ కార్పొరేషన్ (PFC) ఛైర్మన్ మరియు మేనేజింగ్ డైరెక్టర్ (CMD)గా పర్మీందర్ చోప్రా నియమితులయ్యారు."
  ),

  Question(
  questionText: "సౌత్ ఇండియన్ బ్యాంక్ మేనేజింగ్ డైరెక్టర్ & CEO గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "అమిత్ జింగ్రాన్",
  "పిఆర్ శేషాద్రి",
  "రాహుల్ ద్రవిడ్"
  ],
  correctAnswerIndex: 2,
  explanation: "PR శేషాద్రి సౌత్ ఇండియన్ బ్యాంక్ మేనేజింగ్ డైరెక్టర్ & CEO గా నియమితులయ్యారు."
  ),

  Question(
  questionText: "Viacom18 యొక్క కొత్త CEO గా ఎవరు నియమితులయ్యారు?",
  options: [
  "వైభవ్ తనేజా",
  "కిరణ్ మణి",
  "ఆర్. దొరైస్వామి",
  "అమిత్ జింగ్రాన్"
  ],
  correctAnswerIndex: 1,
  explanation: "కిరణ్ మణి Viacom18 యొక్క కొత్త CEO గా నియమితులయ్యారు."
  ),


  Question(
  questionText: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) ద్వారా డైరెక్టర్లుగా ఎవరు నియమితులయ్యారు?",
  options: ["కేతన్ శివ్జీ వికాంసే", "మృగాంక్ మధుకర్ పరాంజపే", "రాజేష్ కుమార్ దూబే", "ధర్మేంద్ర సింగ్ షెకావత్","అన్నీ"],
  correctAnswerIndex: 4,
  explanation: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) నలుగురు డైరెక్టర్లను నియమించింది: కేతన్ శివ్జీ వికామ్సే, మృగాంక్ మధుకర్ పరాంజపే, రాజేష్ కుమార్ దూబే మరియు ధర్మేంద్ర సింగ్ షెకావత్."
  ),
  Question(
  questionText: "ఎన్నికల సంఘం (EC) యొక్క 'నేషనల్ ఐకాన్' ఎవరు?",
  options: ["విరాట్ కోహ్లీ", "సచిన్ టెండూల్కర్", "MS ధోని", "రోహిత్ శర్మ"],
  correctAnswerIndex: 1,
  explanation: "సచిన్ టెండూల్కర్ ఎన్నికల సంఘం (EC) యొక్క 'నేషనల్ ఐకాన్'."
  ),
  Question(
  questionText: "ఇన్ఫోసిస్‌కు బ్రాండ్ అంబాసిడర్‌లు ఎవరు?",
  options: ["రాఫెల్ నాదల్", "ఇగా స్వియాటెక్", "రాఫెల్ నాదల్ మరియు ఇగా స్వియాటెక్ ఇద్దరూ", "పైన ఏదీ కాదు"],
  correctAnswerIndex: 2,
  explanation: "రాఫెల్ నాదల్ మరియు ఇగా స్విటెక్ ఇన్ఫోసిస్‌కు బ్రాండ్ అంబాసిడర్‌లు."
  ),
  Question(
  questionText: "ఫైనాన్స్ ఇండస్ట్రీ డెవలప్‌మెంట్ కౌన్సిల్ (FIDC) కొత్త ఛైర్మన్ ఎవరు?",
  options: ["ఉమేష్ రేవంకర్", "రాహుల్ ఖుల్లార్", "హర్ష్ కుమార్ భన్వాలా", "అరవింద్ మాయారామ్"],
  correctAnswerIndex: 0,
  explanation: "మిస్టర్ ఉమేష్ రేవంకర్ ఫైనాన్స్ ఇండస్ట్రీ డెవలప్‌మెంట్ కౌన్సిల్ (FIDC)కి కొత్త ఛైర్మన్."
  ),
  Question(
  questionText: "జులైలో FAO ఆల్ రైస్ ప్రైస్ ఇండెక్స్ ఎంత శాతం పెరుగుదలను సాధించింది?",
  options: ["2.8%", "5.2%", "1.5%", "3.7%"],
  correctAnswerIndex: 0,
  explanation: "FAO ఆల్ రైస్ ప్రైస్ ఇండెక్స్ గత నెలతో పోలిస్తే జూలైలో 2.8 శాతం పెరిగింది."
  ),
  Question(
  questionText: "ఇంటర్నెట్ రెసిలెన్స్ ఇండెక్స్ (IRI)లో, భారతదేశం మొత్తంగా ఎంత స్కోర్ సాధించింది?",
  options: ["35%", "43%", "50%", "28%"],
  correctAnswerIndex: 1,
  explanation: "ఇంటర్నెట్ రెసిలెన్స్ ఇండెక్స్ (IRI)లో భారతదేశం మొత్తం స్కోర్ 43 శాతం సాధించింది, దక్షిణాసియా ప్రాంతంలో ఆరవ ర్యాంక్ దేశంగా నిలిచింది."
  ),
  Question(
  questionText: "జల్ జీవన్ సర్వేక్షణ్ (JJS-2023) కింద అత్యధిక పనితీరు కనబరిచిన జిల్లా ఏది?",
  options: ["శ్రీనగర్", "ఇండోర్", "లక్నో", "భోపాల్"],
  correctAnswerIndex: 0,
  explanation: "శ్రీనగర్ జిల్లా జల్ జీవన్ సర్వేక్షన్ (JJS-2023) కింద అత్యధిక పనితీరు కనబరిచిన జిల్లాగా అవతరించింది, భారతదేశం అంతటా 114 హర్ ఘర్ జల్ సర్టిఫైడ్ గ్రామాలను మించిపోయింది."
  ),
  Question(
  questionText: "10 లక్షల జనాభా దాటిన నగరాల్లో స్వచ్ఛ వాయు సర్వేక్షణ్ -2023లో ఏ నగరం అగ్రస్థానంలో నిలిచింది?",
  options: ["భోపాల్", "ఇండోర్", "జైపూర్", "చండీగఢ్"],
  correctAnswerIndex: 1,
  explanation: "కేంద్ర కాలుష్య నియంత్రణ మండలి నిర్వహించిన స్వచ్ఛ వాయు సర్వేక్షణ్ -2023లో 10 లక్షల జనాభా దాటిన నగరాల విభాగంలో ఇండోర్ నగరం అగ్రస్థానంలో నిలిచింది."
  ),


  Question(
  questionText: "ప్రస్తుతం జరుగుతున్న యాషెస్ సిరీస్ తర్వాత క్రికెట్‌కు రిటైర్మెంట్ ప్రకటించిందెవరు?",
  options: ["జేమ్స్ ఆండర్సన్", "జో రూట్", "స్టువర్ట్ బ్రాడ్", "జోఫ్రా ఆర్చర్"],
  correctAnswerIndex: 2,
  explanation: "ఇంగ్లాండ్ పేసర్ స్టువర్ట్ బ్రాడ్ ప్రస్తుతం జరుగుతున్న యాషెస్ సిరీస్ తర్వాత క్రికెట్‌కు రిటైర్మెంట్ ప్రకటించాడు. అతను 167 టెస్టు మ్యాచ్‌లు ఆడి 602 వికెట్లు తీశాడు."
  ),
  Question(
  questionText: "ఇగా స్వియాటెక్ సంవత్సరంలో ఎన్ని WTA టైటిళ్లను పొందింది?",
  options: ["రెండు", "మూడు", "నాలుగు", "ఐదు"],
  correctAnswerIndex: 2,
  explanation: "ఇగా స్వియాటెక్ తన సొంత గడ్డపై మొట్టమొదటిసారిగా గెలుపొందడం ద్వారా సంవత్సరంలో తన నాల్గవ WTA టైటిల్‌ను సాధించింది."
  ),
  Question(
  questionText: "టోర్నియో డెల్ సెంటర్నారియో 2023 టైటిల్‌ను గెలుచుకోవడానికి భారత మహిళల హాకీ జట్టు ఏ జట్టును ఓడించింది?",
  options: ["జర్మనీ", "స్పెయిన్", "నెదర్లాండ్స్", "ఆస్ట్రేలియా"],
  correctAnswerIndex: 1,
  explanation: "భారత మహిళల హాకీ జట్టు బార్సిలోనాలోని టెర్రస్సాలో ఆతిథ్య స్పెయిన్‌ను 3-0తో ఓడించి టోర్నియో డెల్ సెంటర్నారియో 2023 టైటిల్‌ను గెలుచుకుంది."
  ),
  Question(
  questionText: "ఫార్ములా వన్‌లో బెల్జియన్ గ్రాండ్ ప్రిక్స్‌ను ఎవరు గెలుచుకున్నారు?",
  options: ["లూయిస్ హామిల్టన్", "సెబాస్టియన్ వెటెల్", "మాక్స్ వెర్స్టాపెన్", "సెర్గియో పెరెజ్"],
  correctAnswerIndex: 2,
  explanation: "డిఫెండింగ్ ఫార్ములా వన్ ఛాంపియన్ మాక్స్ వెర్స్టాపెన్ బెల్జియన్ గ్రాండ్ ప్రిక్స్‌ను గెలుచుకున్నాడు, తద్వారా సీజన్‌లో అతని ఎనిమిదో వరుస విజయాన్ని మరియు 10వ స్థానంలో నిలిచాడు."
  ),
  Question(
  questionText: "ఏ మాజీ ఉరుగ్వే డిఫెండర్ ఇటీవల ప్రొఫెషనల్ సాకర్ నుండి రిటైర్ అయ్యాడు?",
  options: ["లూయిస్ సువారెజ్", "డియెగో గాడిన్", "ఎడిన్సన్ కావని", "ఫెర్నాండో ముస్లేరా"],
  correctAnswerIndex: 1,
  explanation: "మాజీ ఉరుగ్వే డిఫెండర్ డియెగో గాడిన్ 37 సంవత్సరాల వయస్సులో ప్రొఫెషనల్ సాకర్ నుండి రిటైర్ అయ్యాడు, 20 ఏళ్ల కెరీర్‌ను ముగించాడు."
  ),
  Question(
  questionText: "భారతదేశం యొక్క టాప్-ర్యాంక్ చెస్ ప్లేయర్‌గా గ్రాండ్‌మాస్టర్ విశ్వనాథన్ ఆనంద్‌ను ఎవరు తొలగించారు?",
  options: ["ఆర్. ప్రజ్ఞానంద", "డి. గుకేష్", "పి. హరికృష్ణ", "ఎస్. విదిత్"],
  correctAnswerIndex: 1,
  explanation: "17 ఏళ్ల చెస్ ప్రాడిజీ, డి. గుకేష్, గ్రాండ్‌మాస్టర్ విశ్వనాథన్ ఆనంద్‌ను 2755.9 లైవ్ రేటింగ్‌ను సాధించి, క్లాసిక్ ఓపెన్ కేటగిరీలో 9వ స్థానానికి చేరుకోవడం ద్వారా భారతదేశపు టాప్-ర్యాంక్ చెస్ ప్లేయర్‌గా అవతరించాడు."
  ),
  Question(
  questionText: "T20 ప్రపంచ కప్ విజేతగా సంతకం చేస్తూ అంతర్జాతీయ క్రికెట్‌కు రిటైర్మెంట్‌ను ఎవరు ప్రకటించారు?",
  options: ["జోస్ బట్లర్", "జానీ బెయిర్‌స్టో", "అలెక్స్ హేల్స్", "బెన్ స్టోక్స్"],
  correctAnswerIndex: 2,
  explanation: "T20 ప్రపంచ కప్ విజేతగా సంతకం చేస్తూ అలెక్స్ హేల్స్ అంతర్జాతీయ క్రికెట్ నుండి రిటైర్మెంట్ ప్రకటించాడు."
  ),
  Question(
  questionText: "బెర్లిన్‌లో జరిగిన ప్రపంచ ఆర్చరీ ఛాంపియన్‌షిప్‌లో బంగారు పతకాన్ని గెలుచుకోవడం ద్వారా ఏ భారత జట్టు చరిత్ర సృష్టించింది?",
  options: ["భారత పురుషుల సమ్మేళనం విలువిద్య జట్టు", "భారత మహిళల సమ్మేళనం ఆర్చరీ జట్టు", "భారత పురుషుల రికర్వ్ ఆర్చరీ జట్టు", "భారత మహిళల రికర్వ్ ఆర్చరీ జట్టు"],
  correctAnswerIndex: 1,
  explanation: "జర్మనీలోని బెర్లిన్‌లో జరిగిన ప్రపంచ ఆర్చరీ ఛాంపియన్‌షిప్‌లో భారత మహిళల కాంపౌండ్ ఆర్చరీ జట్టు బంగారు పతకాన్ని సాధించడం ద్వారా చరిత్రలో వారి పేర్లను లిఖించుకుంది."
  ),
  Question(
  questionText: "స్పోర్ట్స్ అథారిటీ ఆఫ్ ఇండియా (SAI) ఏ ప్రచారం కింద 'హల్లా బోల్' అనే షార్ట్ మూవీ సిరీస్‌ను ప్రారంభించింది?",
  options: ["ఖేలో ఇండియా", "Play4India", "Cheer4India", "Sports4All"],
  correctAnswerIndex: 2,
  explanation: "స్పోర్ట్స్ అథారిటీ ఆఫ్ ఇండియా (SAI) అంబ్రెల్లా క్యాంపెయిన్ 'చీర్4ఇండియా' కింద ఆసియా క్రీడలకు వెళ్లిన అథ్లెట్ల ప్రయాణంపై 'హల్లా బోల్' అనే షార్ట్ మూవీ సిరీస్‌ను ప్రారంభించింది."
  ),
  Question(
  questionText: "ఇస్తాంబుల్‌లో జరిగిన 2023 ప్రపంచ క్యాడెట్ రెజ్లింగ్ ఛాంపియన్‌షిప్‌లో భారత్ స్వర్ణంతో సహా ఎన్ని పతకాలు సాధించింది?",
  options: ["7", "9", "11", "13"],
  correctAnswerIndex: 2,explanation: "భారతదేశం వారి 2023 ప్రపంచ క్యాడెట్ రెజ్లింగ్ ఛాంపియన్‌షిప్‌లను టర్కీలోని ఇస్తాంబుల్‌లో ఒక స్వర్ణంతో సహా మొత్తం 11 పతకాలతో ముగించింది."
  ),
  Question(
  questionText: "పారిస్ సెయింట్-జర్మైన్ (PSG) నుండి సౌదీ అరేబియా యొక్క అల్-హిలాల్‌లో ఎవరు చేరారు?",
  options: ["కైలియన్ Mbappe", "Lionel Messi", "Neymar Jr", "Angel Di Maria"],
  correctAnswerIndex: 2,
  explanation: "బ్రెజిల్ ఫార్వర్డ్ నేమార్ జూనియర్ పారిస్ సెయింట్-జర్మైన్ (PSG) నుండి సౌదీ అరేబియా యొక్క అల్-హిలాల్‌లో చేరాడు."
  ),
  Question(
  questionText: "నైట్ రేసింగ్ కోసం భారతదేశం మరియు దక్షిణాసియాలో మొట్టమొదటి స్ట్రీట్ సర్క్యూట్ ఎక్కడ ప్రారంభించబడింది?",
  options: ["ఢిల్లీ", "ముంబయి", "చెన్నై", "బెంగళూరు"],
  correctAnswerIndex: 2,
  explanation: "తమిళనాడు ప్రభుత్వం మరియు రేసింగ్ ప్రమోషన్స్ ప్రైవేట్ లిమిటెడ్ (RRPL) చెన్నైలో కొత్త స్ట్రీట్ సర్క్యూట్‌ను ప్రారంభించింది, ఇది భారతదేశం మరియు దక్షిణాసియాలో నైట్ రేస్‌ను నిర్వహించే మొట్టమొదటి స్ట్రీట్ సర్క్యూట్."
  ),
  Question(
  questionText: "టెస్ట్ క్రికెట్ నుండి రిటైర్మెంట్ ప్రకటించిన శ్రీలంక ఆల్ రౌండర్ ఎవరు?",
  options: ["ఏంజెలో మాథ్యూస్", "దినేష్ చండిమాల్", "వనిందు హసరంగా", "లసిత్ మలింగ"],
  correctAnswerIndex: 2,
  explanation: "శ్రీలంక ఆల్-రౌండర్ వనిందు హసరంగా తన పరిమిత ఓవర్ల కెరీర్‌పై దృష్టి పెట్టేందుకు టెస్ట్ క్రికెట్‌కు రిటైర్మెంట్ ప్రకటించాడు."
  ),
  Question(
  questionText: "అంతర్జాతీయ క్రికెట్ నుండి రిటైర్మెంట్ ప్రకటించిన పాకిస్థాన్ ఫాస్ట్ బౌలర్ ఎవరు?",
  options: ["మొహమ్మద్ అమీర్", "షహీన్ అఫ్రిది", "వహాబ్ రియాజ్", "హసన్ అలీ"],
  correctAnswerIndex: 2,
  explanation: "పాకిస్తాన్ ఫాస్ట్ బౌలర్ వహాబ్ రియాజ్ అంతర్జాతీయ క్రికెట్‌కు రిటైర్మెంట్ ప్రకటించాడు, 15 ఏళ్ల కెరీర్‌కు ముగింపు పలికాడు."
  ),
  Question(
  questionText: "భారత స్ప్రింటర్ ద్యుతీ చంద్‌పై నాలుగు సంవత్సరాల నిషేధం ఎందుకు విధించబడింది?",
  options: ["డోపింగ్ ఉల్లంఘన", "మ్యాచ్-ఫిక్సింగ్", "వయస్సు మోసం", "గాయం"],
  correctAnswerIndex: 0,
  explanation: "ఆఫ్-కాంపిటీషన్ డోప్ టెస్ట్‌లో సెలెక్టివ్ ఆండ్రోజెన్ రిసెప్టర్ మాడ్యులేటర్స్ (SARMs) ఉనికిని వెల్లడి చేయడంతో భారత స్ప్రింటర్ డ్యూటీ చంద్‌పై నాలుగు సంవత్సరాల నిషేధం విధించబడింది."
  ),
  Question(
  questionText: "వరల్డ్ అథ్లెటిక్స్ యొక్క నలుగురు వైస్ ప్రెసిడెంట్లలో ఒకరుగా ఎవరు ఎన్నికయ్యారు?",
  options: ["సురేష్ కల్మాడీ", "అనురాగ్ సింగ్ ఠాకూర్", "నీతా అంబానీ", "అడిల్లే సుమరివాలా"],
  correctAnswerIndex: 3,
  explanation: "అథ్లెటిక్స్ ఫెడరేషన్ ఆఫ్ ఇండియా (AFI) అధ్యక్షుడు అడిల్లే సుమరివాలా ప్రపంచ అథ్లెటిక్స్ యొక్క నలుగురు వైస్ ప్రెసిడెంట్లలో ఒకరిగా ఎన్నికయ్యారు."
  ),
  Question(
  questionText: "2019 నుండి జూనియర్ ప్రపంచ ఛాంపియన్‌షిప్ టైటిల్‌ను సాధించిన మొదటి భారతీయ రెజ్లర్ ఎవరు?",
  options: ["బజరంగ్ పునియా", "రవి కుమార్ దహియా", "దీపక్ పునియా", "మోహిత్ కుమార్"],
  correctAnswerIndex: 3,
  explanation: "మోహిత్ కుమార్ 2019 నుండి జూనియర్ ప్రపంచ ఛాంపియన్‌షిప్ టైటిల్‌ను సాధించిన మొదటి భారతీయ రెజ్లర్‌గా నిలిచాడు, బంగారు పతకాన్ని సాధించాడు."
  ),
  Question(
  questionText: "ఆసియా జూనియర్ స్క్వాష్ వ్యక్తిగత ఛాంపియన్‌షిప్‌ల U-17 విభాగంలో బంగారు పతకాన్ని ఎవరు సాధించారు?",
  options: ["సౌరవ్ ఘోసల్", "దీపికా పల్లికల్", "అనాహత్ సింగ్", "జోష్నా చినప్ప"],
  correctAnswerIndex: 2,
  explanation: "ఆసియా జూనియర్ స్క్వాష్ వ్యక్తిగత ఛాంపియన్‌షిప్‌ల U-17 విభాగంలో అనాహత్ సింగ్ బంగారు పతకాన్ని సాధించాడు."
  ),
  Question(
  questionText: "జోర్డాన్‌లో జరిగిన U20 ప్రపంచ రెజ్లింగ్ ఛాంపియన్‌షిప్‌లో ఏ భారతీయ రెజ్లర్ బంగారు పతకాన్ని సాధించాడు?",
  options: ["వినీష్ ఫోగట్", "సాక్షి మాలిక్", "పూజా దండా", "ప్రియా మాలిక్"],
  correctAnswerIndex: 3,
  explanation: "జోర్డాన్‌లో జరిగిన U20 ప్రపంచ రెజ్లింగ్ ఛాంపియన్‌షిప్‌లో భారత రెజ్లర్ ప్రియా మాలిక్ బంగారు పతకాన్ని సాధించింది."
  ),
  Question(
  questionText: "సింగపూర్ ఇంటర్నేషనల్ మ్యాథ్ ఒలింపియాడ్ ఛాలెంజ్ (SIMOC)లో రజత పతకాన్ని ఎవరు కైవసం చేసుకున్నారు?",
  options: ["రాజా అనిరుధ్ శ్రీరామ్", "అర్నవ్ శర్మ", "ప్రియాంక గుప్తా", "ఆదిత్య పటేల్"],
  correctAnswerIndex: 0,
  explanation: "తిరుపతికి చెందిన నాల్గవ తరగతి విద్యార్థి రాజా అనిరుధ్ శ్రీరామ్ ప్రతిష్టాత్మక సింగపూర్ ఇంటర్నేషనల్ మ్యాథ్ ఒలింపియాడ్ ఛాలెంజ్ (SIMOC)లో రజత పతకాన్ని సాధించాడు."
  ),
  Question(
  questionText: "ఖేలో ఇండియా ఉమెన్స్ లీగ్‌కి కొత్త పేరు ఏమిటి?",
  options: ["ఎంపవర్ ఉమెన్స్ లీగ్", "అస్మిత ఉమెన్స్ లీగ్", "శక్తి ఉమెన్స్ లీగ్", "నారీ శక్తి ఉమెన్స్ లీగ్"],
  correctAnswerIndex: 1,
  explanation: "ఖేలో ఇండియా ఉమెన్స్ లీగ్ ఇప్పుడు 'అస్మిత ఉమెన్స్ లీగ్'గా గుర్తించబడుతుంది, దీనిని కేంద్ర యువజన వ్యవహారాలు మరియు క్రీడల మంత్రి అనురాగ్ సింగ్ ఠాకూర్ ఆవిష్కరించారు."
  ),
  Question(
  questionText: "యునైటెడ్ వరల్డ్ రెజ్లింగ్ (UWW) నుండి రెజ్లింగ్ ఫెడరేషన్ ఆఫ్ ఇండియా (WFI) ఎందుకు సస్పెన్షన్‌ను ఎదుర్కొంది?",
  options: ["డోపింగ్ ఉల్లంఘనలు", "ఆర్థిక అక్రమాలు", "వివాదాలు మరియు ఎన్నికల జాప్యాలు", "మ్యాచ్ ఫిక్సింగ్ ఆరోపణలు"],
  correctAnswerIndex: 2,
  explanation: "అవసరమైన ఎన్నికల నిర్వహణలో కొనసాగుతున్న వివాదాలు మరియు సుదీర్ఘ జాప్యం కారణంగా యునైటెడ్ వరల్డ్ రెజ్లింగ్ (UWW) నుండి రెజ్లింగ్ ఫెడరేషన్ ఆఫ్ ఇండియా (WFI) సస్పెన్షన్‌ను ఎదుర్కొంది."
  ),
  Question(
  questionText: "చదరంగంలో FIDE ప్రపంచ కప్‌లో ఎవరు రెండవ స్థానంలో నిలిచారు?",
  options: ["మాగ్నస్ కార్ల్‌సెన్", "ఫాబియానో కరువానా", "డింగ్ లిరెన్", "రమేష్‌బాబు ప్రగ్నానంద"],
      correctAnswerIndex: 3,
  explanation: "రమేష్‌బాబు ప్రజ్ఞానంద చదరంగంలో FIDE ప్రపంచ కప్‌లో రెండవ స్థానంలో నిలిచాడు, మాగ్నస్ కార్ల్‌సెన్ టైటిల్ గెలుచుకున్నాడు."
  ),
  Question(
  questionText: "మహిళల టెన్నిస్‌లో ఇన్ఫోసిస్‌కు ప్రపంచ బ్రాండ్ అంబాసిడర్‌గా ఎవరు ప్రకటించబడ్డారు?",
  options: ["సెరెనా విలియమ్స్", "సిమోనా హాలెప్", "నవోమి ఒసాకా", "ఇగా స్విటెక్"],
  correctAnswerIndex: 3,
  explanation: "ఇన్ఫోసిస్ డిజిటల్ ఇన్నోవేషన్‌ను ప్రోత్సహించడం మరియు టెన్నిస్‌లో ప్రపంచవ్యాప్తంగా ఉన్న మహిళలను ప్రోత్సహించడంపై దృష్టి సారించి ఇగా స్వియాటెక్‌ను గ్లోబల్ బ్రాండ్ అంబాసిడర్‌గా ప్రకటించింది."
  ),
  Question(
  questionText: "ప్రపంచ అథ్లెటిక్స్ ఛాంపియన్‌షిప్‌లో పురుషుల జావెలిన్ త్రో ఈవెంట్‌లో బంగారు పతకాన్ని ఎవరు గెలుచుకున్నారు?",
  options: ["జోహన్నెస్ వెటర్", "నీరజ్ చోప్రా", "మాగ్నస్ కిర్ట్", "ఆండ్రియాస్ హాఫ్మాన్"],
  correctAnswerIndex: 1,
  explanation: "హంగేరిలోని బుడాపెస్ట్‌లో జరిగిన ప్రపంచ అథ్లెటిక్స్ ఛాంపియన్‌షిప్‌లో పురుషుల జావెలిన్ త్రో ఈవెంట్‌లో నీరజ్ చోప్రా బంగారు పతకాన్ని గెలుచుకుని చరిత్ర సృష్టించాడు."
  ),
  Question(
  questionText: "మాక్స్ వెర్స్టాపెన్ వరుసగా ఎన్ని డచ్ గ్రాండ్ ప్రిక్స్ విజయాలు సాధించాడు?",
  options: ["ఐదు", "ఏడు", "తొమ్మిది", "పదకొండు"],
  correctAnswerIndex: 2,
  explanation: "మాక్స్ వెర్స్టాపెన్ వరుసగా మూడవ సంవత్సరం డచ్ గ్రాండ్ ప్రిక్స్‌ను గెలుచుకున్నాడు, ఇప్పుడు సెబాస్టియన్ వెటెల్ యొక్క ఆల్-టైమ్ రికార్డ్‌తో వరుసగా తొమ్మిది F1 విజయాలు సాధించాడు."
  ),
  Question(
  questionText: "BWF ప్రపంచ బ్యాడ్మింటన్ ఛాంపియన్‌షిప్స్ 2023లో పురుషుల సింగిల్స్ విభాగంలో ఏ భారతీయ బ్యాడ్మింటన్ క్రీడాకారుడు కాంస్య పతకాన్ని సాధించాడు?",
  options: ["కిదాంబి శ్రీకాంత్", "HS ప్రణోయ్", "పారుపల్లి కశ్యప్", "సాయి ప్రణీత్"],
  correctAnswerIndex: 1,
  explanation: "భారత బ్యాడ్మింటన్ క్రీడాకారుడు హెచ్ఎస్ ప్రణయ్ BWF ప్రపంచ బ్యాడ్మింటన్ ఛాంపియన్‌షిప్స్ 2023లో పురుషుల సింగిల్స్ విభాగంలో కాంస్య పతకాన్ని సాధించాడు."
  ),
  Question(
  questionText: "ప్రభుత్వ జోక్యం తర్వాత ఏ ఫుట్‌బాల్ సమాఖ్య నిషేధాన్ని FIFA ఎత్తివేసింది?",
  options: ["బ్రెజిలియన్ ఫుట్‌బాల్ కాన్ఫెడరేషన్", "శ్రీలంక ఫుట్‌బాల్ ఫెడరేషన్", "జర్మన్ ఫుట్‌బాల్ అసోసియేషన్", "నైజీరియన్ ఫుట్‌బాల్ ఫెడరేషన్"],
  correctAnswerIndex: 1,
  explanation: "ప్రభుత్వ జోక్యం తర్వాత ప్రపంచ గవర్నింగ్ బాడీ FIFA శ్రీలంక ఫుట్‌బాల్ ఫెడరేషన్ (FFSL)పై నిషేధాన్ని ఎత్తివేసింది మరియు FFSL తన కార్యనిర్వాహక కమిటీకి తాజా ఎన్నికలను నిర్వహించడానికి అంగీకరించింది."
  ),
  Question(
  questionText: "థాయ్‌లాండ్‌తో జరిగిన ప్రారంభ మహిళల ఆసియా హాకీ 5 ప్రపంచ కప్ క్వాలిఫైయర్ ఫైనల్‌లో భారతదేశం ఎలా ప్రదర్శన ఇచ్చింది?",
  options: ["లాస్ట్ 3-1", "డ్రా 4-4", "వోన్ 7-2", "లాస్ట్ 5-3"],
  correctAnswerIndex: 2,
  explanation: "ఇండియా ఫైనల్‌లో థాయ్‌లాండ్‌ను 7-2తో ఓడించి తొలి మహిళల ఆసియా హాకీ 5 ప్రపంచకప్ క్వాలిఫైయర్‌ను గెలుచుకుంది."
  ),

  Question(
  questionText: "5వ వరల్డ్ కాఫీ కాన్ఫరెన్స్ (WCC) ఎక్కడ జరగాల్సి ఉంది?",
  options: ["బెంగళూరు", "జోహన్నెస్‌బర్గ్", "గాంధీనగర్", "న్యూ ఢిల్లీ"],
  correctAnswerIndex: 0,
  explanation: "సెప్టెంబర్ 25 నుండి 28 వరకు బెంగళూరులో 5వ ప్రపంచ కాఫీ సదస్సు (WCC)కి భారతదేశం ఆతిథ్యం ఇవ్వనుంది. ఆసియాలో ఈ కార్యక్రమం నిర్వహించడం ఇదే మొదటిసారి."
  ),
  Question(
  questionText: "రష్యా అధ్యక్షుడు వ్లాదిమిర్ పుతిన్ తన పర్యటనను ఏ కార్యక్రమానికి రద్దు చేసుకున్నారు, ఇది భారత ప్రధాని నరేంద్ర మోడీ హాజరును ధృవీకరించడానికి దారితీసింది?",
  options: ["G20 సమ్మిట్", "BRICS సమ్మిట్", "MSME ఎక్స్‌పో అండ్ సమ్మిట్", "WHO ట్రెడిషనల్ మెడిసిన్ గ్లోబల్ సమ్మిట్"],
  correctAnswerIndex: 1,
  explanation: "రష్యా అధ్యక్షుడు వ్లాదిమిర్ పుతిన్ తన పర్యటనను రద్దు చేసుకున్న తర్వాత, ఆగస్ట్ 22 నుండి 24, 2023 వరకు దక్షిణాఫ్రికాలోని జోహన్నెస్‌బర్గ్‌లో జరిగిన బ్రిక్స్ శిఖరాగ్ర సమావేశానికి భారత ప్రధాని నరేంద్ర మోడీ హాజరైనట్లు ధృవీకరించారు."
  ),
  Question(
  questionText: "న్యూ ఢిల్లీలో 9వ ఇండియా ఇంటర్నేషనల్ MSME ఎక్స్‌పో మరియు సమ్మిట్ 2023ని ఎవరు ప్రారంభించారు?",
  options: ["నరేంద్ర మోడీ", "మనోజ్ సిన్హా", "ఓం బిర్లా", "అమిత్ షా"],
  correctAnswerIndex: 1,
  explanation: "న్యూ ఢిల్లీలో 9వ ఇండియా ఇంటర్నేషనల్ MSME ఎక్స్‌పో మరియు సమ్మిట్ 2023ని జమ్మూ కాశ్మీర్ లెఫ్టినెంట్ గవర్నర్ శ్రీ మనోజ్ సిన్హా ప్రారంభించారు."
  ),
  Question(
  questionText: "మొదటి WHO ట్రెడిషనల్ మెడిసిన్ గ్లోబల్ సమ్మిట్ ఎక్కడ జరుగుతుంది?",
  options: ["బెంగళూరు", "జోహన్నెస్‌బర్గ్", "గాంధీనగర్", "న్యూ ఢిల్లీ"],
  correctAnswerIndex: 2,
  explanation: "మొదటి WHO ట్రెడిషనల్ మెడిసిన్ గ్లోబల్ సమ్మిట్ ఆగస్టు 17 మరియు 18, 2023లో భారతదేశంలోని గుజరాత్‌లోని గాంధీనగర్ నగరంలో జరగనుంది. ఇది G20 ఆరోగ్య మంత్రివర్గ సమావేశంతో సమానంగా ఉంటుంది."
  ),
  Question(
  questionText: "BRICS ఆర్థిక కూటమి నుండి ఏ నాయకులు మూడు రోజుల శిఖరాగ్ర సమావేశానికి జోహన్నెస్‌బర్గ్‌లోని శాండ్‌టన్‌లో సమావేశమవుతున్నారు?",
  options: ["G7", "G20", "ASEAN", "BRICS"],
  correctAnswerIndex: 3,
  explanation: "BRICS ఆర్థిక కూటమి (బ్రెజిల్, రష్యా, భారతదేశం, చైనా మరియు దక్షిణాఫ్రికా) నుండి నాయకులు మూడు రోజుల శిఖరాగ్ర సమావేశానికి శాండ్టన్, జోహన్నెస్‌బర్గ్‌లో సమావేశమవుతున్నారు."
  ),

  Question(
  questionText: "కామన్వెల్త్ పార్లమెంటరీ అసోసియేషన్ (CPA) తొమ్మిదవ భారత ప్రాంత సమావేశం ఎక్కడ జరిగింది?",
  options: ["ముంబై", "ఉదయ్‌పూర్", "చెన్నై", "కోల్‌కతా"],
  correctAnswerIndex: 1,
  explanation: "కామన్వెల్త్ పార్లమెంటరీ అసోసియేషన్ (CPA) తొమ్మిదవ ఇండియా రీజియన్ కాన్ఫరెన్స్ చారిత్రాత్మక సి.రాజస్థాన్ రాష్ట్రంలో ఉన్న ఉదయపూర్ నగరం."
  ),
  Question(
  questionText: "B20 సమ్మిట్ ఇండియా 2023 యొక్క థీమ్ ఏమిటి?",
  options: ["వేగవంతమైన వృద్ధి మరియు అభివృద్ధి", "డిజిటల్ పరివర్తన", "సుస్థిర వ్యవసాయం", "R.A.I.S.E వ్యాపారాలు"],
  correctAnswerIndex: 3,
  explanation: "B20 ఇండియా 2023 యొక్క థీమ్ బాధ్యతాయుతమైన, వేగవంతమైన, వినూత్నమైన, స్థిరమైన, ఈక్విటబుల్ (R.A.I.S.E) వ్యాపారాలు."
  ),
  Question(
  questionText: "స్మార్ట్ ఇండియా హ్యాకథాన్ (SIH) 2023 యొక్క ఆరవ ఎడిషన్‌ను ఏ సంస్థలు ఆవిష్కరించాయి?",
  options: ["నీతి ఆయోగ్ మరియు UGC", "ఇండియన్ ఆర్మీ మరియు DRDO", "మినిస్ట్రీ ఆఫ్ ఎడ్యుకేషన్ ఇన్నోవేషన్ సెల్ మరియు AICTE", "ISRO మరియు BARC"],
  correctAnswerIndex: 2,
  explanation: "విద్యా మంత్రిత్వ శాఖ యొక్క ఇన్నోవేషన్ సెల్ మరియు ఆల్ ఇండియా కౌన్సిల్ ఆఫ్ టెక్నికల్ ఎడ్యుకేషన్ (AICTE) స్మార్ట్ ఇండియా హ్యాకథాన్ (SIH) 2023 యొక్క ఆరవ ఎడిషన్‌ను ఆవిష్కరించాయి."
  ),
  Question(
  questionText: "భారతదేశం B20 అధ్యక్ష పదవిని ఏ దేశానికి అప్పగించింది?",
  options: ["చైనా", "USA", "రష్యా", "బ్రెజిల్"],
  correctAnswerIndex: 3,
  explanation: "2024లో జరిగే G20 శిఖరాగ్ర సమావేశానికి మార్పును సూచిస్తూ B20 అధ్యక్ష పదవిని భారతదేశం సునాయాసంగా బ్రెజిల్‌కు అప్పగించింది."
  ),


  Question(
  questionText: "భారత వైమానిక దళానికి ఎయిర్-లాంచ్ చేసిన ఇజ్రాయెలీ స్పైక్ నాన్ లైన్ ఆఫ్ సైట్ (NLOS) యాంటీ-ట్యాంక్ గైడెడ్ మిస్సైల్స్ (ATGM)ని ఏ దేశం సరఫరా చేసింది?",
  options: ["USA", "రష్యా", "ఇజ్రాయెల్", "ఫ్రాన్స్"],
  correctAnswerIndex: 2,
  explanation: "భారత వైమానిక దళం (IAF) ఇజ్రాయెల్ నుండి ఎయిర్-లాంచ్ చేసిన ఇజ్రాయెలీ స్పైక్ NLOS యాంటీ-ట్యాంక్ గైడెడ్ క్షిపణులను (ATGM) పొందింది."
  ),
  Question(
  questionText: "డిఫెన్స్ రీసెర్చ్ అండ్ డెవలప్‌మెంట్ ఆర్గనైజేషన్ (DRDO) అభివృద్ధి చేసి, ఇండియన్ ఆర్మీ మరియు ఇండియన్ ఎయిర్ ఫోర్స్ (IAF)లో చేర్చడానికి సిద్ధంగా ఉన్న స్వదేశీ ట్యాంక్ వ్యతిరేక గైడెడ్ మిస్సైల్ (ATGM) పేరు ఏమిటి?",
  options: ["బ్రహ్మోస్", "నాగ్", "అస్త్ర", "పృథ్వీ"],
  correctAnswerIndex: 1,
  explanation: "DRDO చే అభివృద్ధి చేయబడిన భారతదేశ స్వదేశీ నాగ్ యాంటీ-ట్యాంక్ గైడెడ్ మిస్సైల్ (ATGM), భారత సైన్యం మరియు ఇండియన్ ఎయిర్ ఫోర్స్ (IAF)లోకి చేర్చబడుతుంది."
  ),
  Question(
  questionText: "భారత సైన్యం ఇటీవల ప్రవేశపెట్టిన స్వదేశీ వెపన్ లొకేటింగ్ రాడార్ (WLR-M) యొక్క తేలికైన మరియు మరింత కాంపాక్ట్ వెర్షన్ పేరు ఏమిటి?",
  options: ["స్వాతి పర్వతాలు", "ధృవస్త్రం", "హెరాన్ మార్క్ 2", "మహేంద్రగిరి"],
  correctAnswerIndex: 0,
  explanation: "భారత సైన్యం ఇటీవల 'స్వాతి పర్వతాలను' చేర్చింది, ఇది స్వదేశీ వెపన్ లొకేటింగ్ రాడార్ (WLR-M) యొక్క తేలికైన మరియు మరింత కాంపాక్ట్ వెర్షన్."
  ),
  Question(
  questionText: "ఆస్ట్రేలియా తూర్పు తీరం వెంబడి మలబార్ సీరీస్ నావికా విన్యాసాలలో ఏ సముద్ర దళాలు పాల్గొంటున్నాయి?",
  options: ["భారతదేశం, చైనా, జపాన్", "భారతదేశం, USA, ఆస్ట్రేలియా", "భారతదేశం, రష్యా, ఫ్రాన్స్", "భారతదేశం, జపాన్, USA, ఆస్ట్రేలియా"],
  correctAnswerIndex: 3,
  explanation: "మలబార్ నావికా విన్యాసాలలో భారతదేశం, జపాన్, యునైటెడ్ స్టేట్స్ మరియు ఆస్ట్రేలియా సముద్ర దళాలు పాల్గొంటాయి."
  ),
  Question(
  questionText: "భారత రక్షణ మంత్రిత్వ శాఖ మైక్రోసాఫ్ట్ ఆపరేటింగ్ సిస్టమ్‌ను భర్తీ చేస్తున్న దేశీయంగా అభివృద్ధి చెందిన ఆపరేటింగ్ సిస్టమ్ పేరు ఏమిటి?",
  options: ["Windows 10", "Linux", "Maya", "Android"],
  correctAnswerIndex: 2,
  explanation: "భారత రక్షణ మంత్రిత్వ శాఖ మైక్రోసాఫ్ట్ ఆపరేటింగ్ సిస్టమ్‌ను 'మాయ' ఆపరేటింగ్ సిస్టమ్ పేరుతో దేశీయంగా అభివృద్ధి చేసిన ప్రత్యామ్నాయంతో భర్తీ చేస్తోంది."
  ),
  Question(
  questionText: "భారత వైమానిక దళం (IAF) ఇటీవల ప్రవేశపెట్టిన స్ట్రైక్ సామర్థ్యంతో సరికొత్త డ్రోన్ పేరు ఏమిటి?",
  options: ["ప్రిడేటర్", "రీపర్", "హెరాన్ మార్క్ 2", "రుస్టమ్"],
  correctAnswerIndex: 2,
  explanation: "భారత వైమానిక దళం దాని తాజా హెరాన్ మార్క్ 2 డ్రోన్‌లను ప్రవేశపెట్టింది, ఇవి దాడి సామర్థ్యాన్ని కలిగి ఉంటాయి మరియు చైనా మరియు పాకిస్తాన్‌లతో సరిహద్దుల వెంట నిఘాను నిర్వహించగలవు."
  ),
  Question(
  questionText: "భారతదేశం యొక్క మొట్టమొదటి దీర్ఘ-శ్రేణి రివాల్వర్ అయిన 'ప్రబల్'ను ఏ ప్రభుత్వ యాజమాన్యంలోని కంపెనీ ఆవిష్కరించనుంది?",
  options: ["HAL (హిందూస్థాన్ ఏరోనాటిక్స్ లిమిటెడ్)", "BEL (భారత్ ఎలక్ట్రానిక్స్ లిమిటెడ్)", "AWEIL (అడ్వాన్స్‌డ్ వెపన్స్ అండ్ ఎక్విప్‌మెంట్ ఇండియా లిమిటెడ్)", "DRDO (డిఫెన్స్ రీసెర్చ్ అండ్ డెవలప్‌మెంట్ ఆర్గనైజేషన్)"],
  correctAnswerIndex: 2,
  explanation: "స్వదేశీ తయారీ మరియు ఆవిష్కరణల దిశగా అడుగులు వేస్తూ, ప్రభుత్వ యాజమాన్యంలోని కంపెనీ అడ్వాన్స్‌డ్ వెపన్స్ అండ్ ఎక్విప్‌మెంట్ ఇండియా లిమిటెడ్ (AWEIL) భారతదేశపు మొట్టమొదటి దీర్ఘ-శ్రేణి రివాల్వర్ అయిన 'ప్రబల్'ను ఆవిష్కరించడానికి సిద్ధంగా ఉంది."
  ),
  Question(
  questionText: "సింగపూర్ 77వ స్వాతంత్ర్య దినోత్సవ వేడుకల్లో గైడెడ్ మిస్సైల్ కార్వెట్ INS కులిష్ తన ఉనికిని ఎక్కడ ప్రదర్శించింది?",
  options: ["సింగపూర్", "భారతదేశం", "ఆస్ట్రేలియా", "USA"],
  correctAnswerIndex: 0,
  explanation: "గైడెడ్ మిస్సైల్ కార్వెట్ INS కులిష్ సింగపూర్ యొక్క 77వ స్వాతంత్ర్య దినోత్సవ వేడుకల సందర్భంగా బహుళజాతి SEACAT 2023 వ్యాయామంలో దాని నిశ్చితార్థంలో భాగంగా తన ఉనికిని చాటుకుంది."
  ),
  Question(
  questionText: "భారత నావికాదళం కోసం ఐదు ఫ్లీట్ సపోర్ట్ షిప్‌ల నిర్మాణానికి సంబంధించి కేంద్ర ప్రభుత్వం తుది ఆమోదం పొందిన ప్రాజెక్ట్ యొక్క ఉద్దేశ్యం ఏమిటి?",
  options: ["సుర్నిఘా", "లాజిస్టికల్ సపోర్ట్", "అటాక్ మిషన్స్", "విమాన వాహక నౌక నిర్మాణం"],
  correctAnswerIndex: 1,
  explanation: "ఐదు ఫ్లీట్ సపోర్ట్ షిప్‌లను నిర్మించే కీలకమైన ప్రాజెక్ట్‌కి కేంద్ర ప్రభుత్వం తుది ఆమోదం తెలిపింది. ఈ నౌకలు కీలకమైన లాజిస్టికల్ లైఫ్‌లైన్‌లుగా పనిచేయడానికి రూపొందించబడ్డాయి, మిషన్‌ల సమయంలో అవసరమైన సామాగ్రిని యుద్ధనౌకలతో భర్తీ చేస్తాయి."
  ),
  Question(
  questionText: "75 సంవత్సరాల స్వాతంత్ర్యాన్ని పురస్కరించుకుని ఢిల్లీ మరియు చుట్టుపక్కల ఉన్న వివిధ వైమానిక దళ స్టేషన్లు 09 నుండి 15 ఆగస్టు 2023 వరకు ఏమి జరుపుకున్నాయి?",
  options: ["గణతంత్ర దినోత్సవం", "విక్టరీ డే", "స్వాతంత్ర్య దినోత్సవం", "ఆజాది కా అమృత్ మహోత్సవ్ (AKAM)"],
  correctAnswerIndex: 3,
  explanation: "75 సంవత్సరాల స్వాతంత్య్రాన్ని పురస్కరించుకుని, ఢిల్లీ మరియు చుట్టుపక్కల ఉన్న వివిధ వైమానిక దళ స్టేషన్లు 09 ఆగస్టు 2023 నుండి 15 వరకు ఆజాదీ కా అమృత్ మహోత్సవ్ (AKAM)ని జరుపుకున్నాయి."
  ),
  Question(
  questionText: "భారత వైమానిక దళం 2024 మధ్యలో నిర్వహించేందుకు సిద్ధమవుతున్న భారీ బహుపాక్షిక సైనిక వ్యాయామం పేరు ఏమిటి?",
  options: ["వరుణ", "గరుడ", "తరంగ్ శక్తి", "మలబార్"],
  correctAnswerIndex: 2,
  explanation: "భారత వైమానిక దళం (IAF) 2024 మధ్యలో 'తరంగ్ శక్తి' అనే భారీ బహుపాక్షిక సైనిక విన్యాసాన్ని నిర్వహించేందుకు సిద్ధమవుతోంది."
  ),
  Question(
  questionText: "కోల్‌కతాకు చెందిన గార్డెన్ రీచ్ షిప్‌బిల్డర్స్ అండ్ ఇంజనీర్స్ (GRSE)లో ప్రెసిడెంట్ ద్రౌపది ముర్ము ప్రారంభించిన ఇండియన్ నేవీ ఫ్లీట్‌లో తాజా చేరిక పేరు ఏమిటి?",
  options: ["INS వాగిర్", "INS వింధ్యగిరి", "INS విక్రాంత్", "INS విరాట్"],
  correctAnswerIndex: 1,
  explanation: "భారత నౌకాదళం యొక్క కార్యాచరణ సామర్థ్యాలను పెంపొందించే లక్ష్యంతో ఒక ముఖ్యమైన అభివృద్ధిలో, ప్రెసిడెంట్ ద్రౌపది ముర్ము భారత నావికాదళానికి చెందిన INS వింధ్యగిరికి సరికొత్తగా జోడించి ప్రారంభించారు."
  ),
  Question(
  questionText: "భారత నావికాదళం యొక్క జలాంతర్గామి INS వాగిర్ ఏ మైలురాయిని సాధించింది?",
  options: ["వేగవంతమైన విస్తరణ", "డీపెస్ట్ డైవ్", "స్కార్పెనెక్లాస్ సబ్‌మెరైన్ యొక్క పొడవైన విస్తరణ", "మొదటి నీటి అడుగున క్షిపణి ప్రయోగం"],
  correctAnswerIndex: 2,
  explanation: "భారత నావికాదళం యొక్క జలాంతర్గామి, INS వాగిర్, ఉమ్మడి సైనిక విన్యాసాల్లో పాల్గొనేందుకు ఆస్ట్రేలియాకు ప్రయాణంలో 7,000 కిలోమీటర్ల విస్మయపరిచే దూరాన్ని కవర్ చేస్తూ, స్కార్పెనెక్లాస్ సబ్‌మెరైన్‌ను సుదీర్ఘకాలంగా మోహరించిన మైలురాయిని సాధించింది."
  ),
  Question(
  questionText: "గోవా తీరంలో తేలికపాటి యుద్ధ విమానం (LCA) తేజస్ ఏమి సాధించింది?",
  options: ["సూపర్సోనిక్ స్పీడ్ రికార్డ్", "విజయవంతమైన ఎజెక్షన్ సిస్టమ్ టెస్ట్", "ఏరియల్ రీఫ్యూయలింగ్", "విజువల్ రేంజ్ బియాండ్ (BVR) ఎయిర్-టు-ఎయిర్ మిస్సైల్ ఆఫ్ అస్ట్రా స్వదేశీని విజయవంతంగా కాల్చడం"],
  correctAnswerIndex: 3,
  explanation: "గోవా తీరంలో ఆస్ట్రా స్వదేశీ బియాండ్ విజువల్ రేంజ్ (BVR) గగనతలంలోకి ప్రయోగించే క్షిపణిని విజయవంతంగా ప్రయోగించడంతో లైట్ కంబాట్ ఎయిర్‌క్రాఫ్ట్ (LCA) తేజస్ ఒక ముఖ్యమైన మైలురాయిని సాధించింది."
  ),
  Question(
  questionText: "చీఫ్ ఆఫ్ నేవల్ స్టాఫ్ మరియు ఫిలిప్పీన్స్ కోస్ట్ గార్డ్ కమాండెంట్ 23 ఆగస్ట్ 2023న ఏమి సంతకం చేసారు?",
  options: ["రక్షణ ఒప్పందం", "వాణిజ్య ఒప్పందం", "వైట్ షిప్పింగ్ సమాచార మార్పిడికి ప్రామాణిక ఆపరేటింగ్ విధానం (SOP)", "మారిటైమ్ సరిహద్దులపై ఒప్పందం"],
  correctAnswerIndex: 2,
  explanation: "చీఫ్ ఆఫ్ నేవల్ స్టాఫ్ మరియు ఫిలిప్పీన్ కోస్ట్ గార్డ్ యొక్క కమాండెంట్ వైట్ షిప్పింగ్ సమాచార మార్పిడి కోసం స్టాండర్డ్ ఆపరేటింగ్ ప్రొసీజర్ (SOP)పై 23 ఆగస్టు 2023న సంతకం చేశారు."
  ),
  Question(
  questionText: "భారత నౌకాదళం యొక్క కార్యాచరణ సామర్థ్యాలను పెంపొందించడానికి రక్షణ మంత్రిత్వ శాఖ హిందుస్థాన్ షిప్‌యార్డ్ లిమిటెడ్ (HSL)తో ఏ సంచలనాత్మక ఒప్పందంపై సంతకం చేసింది?",
  options: ["విమాన వాహక నౌకల నిర్మాణం", "సబ్‌మెరైన్‌ల కొనుగోలు", "డిస్ట్రాయర్‌ల నిర్మాణం", "ఫ్లీట్ సపోర్ట్ షిప్‌ల సముపార్జన (FSS)"],
  correctAnswerIndex: 3,
  explanation: "నావల్ లాజిస్టిక్స్‌లో కొత్త శకానికి గుర్తుగా ఐదు ఫ్లీట్ సపోర్ట్ షిప్‌ల (ఎఫ్‌ఎస్‌ఎస్) కొనుగోలు కోసం హిందుస్థాన్ షిప్‌యార్డ్ లిమిటెడ్ (హెచ్‌ఎస్‌ఎల్)తో రక్షణ మంత్రిత్వ శాఖ (MoD) సంచలనాత్మక ఒప్పందంపై సంతకం చేసింది."
  ),
  Question(
  questionText: "ఎక్సర్‌సైజ్ బ్రైట్ స్టార్-23 ఎక్కడ ఉంది, ఇందులో ఇండియన్ ఎయిర్ ఫోర్స్ (IAF) బృందం పాల్గొంటోంది, జరుగుతోంది?",
  options: ["న్యూ ఢిల్లీ", "కైరో, ఈజిప్ట్", "సిడ్నీ, ఆస్ట్రేలియా", "వాషింగ్టన్, USA"],
  correctAnswerIndex: 1,
  explanation: "భారత వైమానిక దళం (IAF) బృందం ఒక ముఖ్యమైన ప్రయాణాన్ని ప్రారంభించింది, ఇది ఎక్సర్‌సైజ్ BRIGHT STAR-23లో మొట్టమొదటిసారిగా భాగస్వామ్యాన్ని సూచిస్తుంది. ఈ ద్వైవార్షిక బహుపాక్షిక ట్రై-సర్వీస్ వ్యాయామం ఈజిప్టులోని కైరో (పశ్చిమ) ఎయిర్ బేస్‌లో జరుగుతోంది. ."
  ),
  Question(
  questionText: "భారతదేశం యొక్క తాజా యుద్ధనౌక మహేంద్రగిరి ఏ ముఖ్యమైన మైలురాయిని సాధించబోతోంది?",
  options: ["లాంగెస్ట్ జర్నీ", "ఫాస్టెస్ట్ స్పీడ్ రికార్డ్", "ఫస్ట్ స్టెల్త్ ఫ్రిగేట్", "లార్జెస్ట్ ఎయిర్‌క్రాఫ్ట్ క్యారియర్"],
  correctAnswerIndex: 2,
  explanation: "భారతదేశం యొక్క తాజా యుద్ధనౌక మహేంద్రగిరిని ముంబైలోని మజాగాన్ డాక్ షిప్‌బిల్డర్స్‌లో సెప్టెంబర్ 1న ప్రారంభించనున్నారు. ప్రాజెక్ట్ 17A యొక్క ఏడవ మరియు చివరి స్టెల్త్ ఫ్రిగేట్ మహేంద్రగిరిని ప్రారంభించడం, భారతదేశం నిర్మాణంలో సాధించిన అద్భుతమైన పురోగతికి ప్రతీక. స్వయం సమృద్ధి naవాల్ ఫోర్స్."
  ),
  Question(
  questionText: "మహారాష్ట్రలోని పూణేలో జరిగిన ఒక వేడుకలో లోకమాన్య తిలక్ జాతీయ అవార్డు ఎవరికి లభించింది?",
  options: ["అమిత్ షా", "రతన్ టాటా", "నరేంద్ర మోడీ", "ద్రౌపది ముర్ము"],
  correctAnswerIndex: 2,
  explanation: "మహారాష్ట్రలోని పూణేలో జరిగిన ఒక వేడుకలో భారత ప్రధాని శ్రీ నరేంద్ర మోదీకి లోకమాన్య తిలక్ జాతీయ అవార్డును మంజూరు చేశారు."
  ),
  Question(
  questionText: "మొదటి RICS సౌత్ ఆసియా అవార్డ్స్‌లో లైఫ్‌టైమ్ అచీవ్‌మెంట్ అవార్డును ఎవరు అందుకున్నారు?",
  options: ["రతన్ టాటా", "అమిత్ షా", "నరేంద్ర మోడీ", "సుభాష్ రన్వాల్"],
  correctAnswerIndex: 3,
  explanation: "ప్రముఖ రియల్ ఎస్టేట్ డెవలపర్ అయిన రన్వాల్ ఛైర్మన్ సుభాష్ రన్వాల్ మొట్టమొదటి RICS సౌత్ ఆసియా అవార్డులలో లైఫ్‌టైమ్ అచీవ్‌మెంట్ అవార్డును అందుకున్నారు."
  ),
  Question(
  questionText: "డిజిటల్ ట్రాన్స్‌ఫర్మేషన్ కేటగిరీ-1 కోసం ప్రభుత్వ ప్రక్రియ రీ-ఇంజనీరింగ్‌లో ఎక్సలెన్స్‌లో గోల్డ్ అవార్డు పొందినందుకు కేంద్ర హోం మంత్రి అమిత్ షా ఏ బృందాన్ని అభినందించారు?",
  options: ["నేషనల్ ఆటోమేటెడ్ ఫింగర్‌ప్రింట్ ఐడెంటిఫికేషన్ సిస్టమ్ (NAFIS)", "నేషనల్ క్రైమ్ రికార్డ్స్ బ్యూరో (NCRB)", "ఇండియన్ నేవీ", "ఇండియన్ ఎయిర్ ఫోర్స్ (IAF)"],
  correctAnswerIndex: 1,
  explanation: "డిజిటల్ ట్రాన్స్‌ఫర్మేషన్ కేటగిరీ-1 కోసం ప్రభుత్వ ప్రక్రియ రీ-ఇంజనీరింగ్‌లో అత్యుత్తమ ప్రతిభ కనబరిచినందుకు నేషనల్ క్రైమ్ రికార్డ్స్ బ్యూరో (NCRB) యొక్క నేషనల్ ఆటోమేటెడ్ ఫింగర్‌ప్రింట్ ఐడెంటిఫికేషన్ సిస్టమ్ (NAFIS) బృందాన్ని కేంద్ర హోంమంత్రి అమిత్ షా అభినందించారు. "
  ),
  Question(
  questionText: "2023 స్వాతంత్ర్య దినోత్సవం సందర్భంగా రాష్ట్రపతి శ్రీమతి ద్రౌపది ముర్ము ఎన్ని గ్యాలంట్రీ అవార్డులను ఆమోదించారు?",
  options: ["50", "76", "100", "125"],
  correctAnswerIndex: 1,
  explanation: "2023 స్వాతంత్ర్య దినోత్సవం సందర్భంగా సాయుధ దళాలు మరియు కేంద్ర సాయుధ పోలీసు బలగాల సభ్యులకు రాష్ట్రపతి శ్రీమతి ద్రౌపది ముర్ము 76 గ్యాలంట్రీ అవార్డులను ఆమోదించారు."
  ),
  Question(
  questionText: "హార్వర్డ్ విశ్వవిద్యాలయం వారి సంబంధిత రంగాలలో అద్భుతమైన కృషి చేసినందుకు జార్జ్ లెడ్లీ బహుమతిని ఎవరికి అందించారు?",
  options: ["రతన్ టాటా", "నరేంద్ర మోడీ", "రాజ్ చెట్టి మరియు మైఖేల్ స్ప్రింగర్", "సుభాష్ రన్వాల్"],
  correctAnswerIndex: 2,
  explanation: "ఇండియన్-అమెరికన్ ఆర్థికవేత్త రాజ్ చెట్టి మరియు జీవశాస్త్రవేత్త మైఖేల్ స్ప్రింగర్, వారి సంబంధిత రంగాలలో చేసిన అద్భుతమైన కృషికి హార్వర్డ్ విశ్వవిద్యాలయం యొక్క జార్జ్ లెడ్లీ బహుమతిని పొందారు."
  ),
  Question(
  questionText: "2023 ఇంటర్నేషనల్ యంగ్ ఎకో-హీరో అవార్డును అందుకోవడానికి 17 మంది యుక్తవయసు పర్యావరణ కార్యకర్తలలో ఎంత మంది భారతీయ యువకులు ఉన్నారు?",
  options: ["రెండు", "మూడు", "నాలుగు", "ఐదు"],
  correctAnswerIndex: 3,
  explanation: "ప్రపంచంలోని అత్యంత తీవ్రమైన పర్యావరణ సవాళ్లను పరిష్కరించడానికి వారి చొరవలకు 2023 ఇంటర్నేషనల్ యంగ్ ఎకో-హీరో అవార్డును అందుకోవడానికి ప్రపంచవ్యాప్తంగా ఉన్న 17 మంది టీనేజ్ ఎన్విరాన్‌మెంటల్ యాక్టివిస్ట్‌లలో భారతదేశానికి చెందిన ఐదుగురు యువకులు ఎంపికయ్యారు."
  ),
  Question(
  questionText: "మహారాష్ట్ర ప్రభుత్వం మొట్టమొదటిసారిగా 'ఉద్యోగ రత్న' అవార్డును ఎవరికి అందించింది?",
  options: ["అమిత్ షా", "నరేంద్ర మోడీ", "రతన్ టాటా", "సుభాష్ రన్వాల్"],
  correctAnswerIndex: 2,
  explanation: "ప్రముఖ పారిశ్రామికవేత్త రతన్ టాటాకు మహారాష్ట్ర ప్రభుత్వం స్థాపించిన మొట్టమొదటి 'ఉద్యోగ రత్న' పురస్కారం లభించింది."
  ),
  Question(
  questionText: "ఏథెన్స్‌లో గ్రీకు అధ్యక్షురాలు కాటెరినా ఎన్. సకెల్లారోపౌలౌ ప్రధానమంత్రి నరేంద్ర మోదీకి ఏ పౌర గౌరవాన్ని అందించారు?",
  options: ["ఆర్డర్ ఆఫ్ మెరిట్", "గ్రాండ్ క్రాస్ ఆఫ్ ది ఆర్డర్ ఆఫ్ హానర్", "ఆర్డర్ ఆఫ్ ఫ్రీడం", "ఆర్డర్ ఆఫ్ ఇండిపెండెన్స్"],
  correctAnswerIndex: 1,
  explanation: "ప్రధాన మంత్రి నరేంద్ర మోడీకి ఏథెన్స్‌లో గ్రీస్ అధ్యక్షురాలు కాటెరినా ఎన్. సకెల్లారోపౌలౌ ద్వారా గ్రాండ్ క్రాస్ ఆఫ్ ది ఆర్డర్ ఆఫ్ హానర్ అందించారు. ఇది విదేశీ ప్రభుత్వాధినేతకు గ్రీస్ అందించే అత్యున్నత పౌర గౌరవం."
  ),

  Question(
  questionText: "వెరిఫైడ్ డిజిటల్ ఐడెంటిటీ మరియు ఫైనాన్షియల్ ప్రాజెక్ట్‌కి యాక్సెస్‌ని వినియోగదారులకు అందించాలనే లక్ష్యంతో వరల్డ్‌కాయిన్ క్రిప్టో ప్రాజెక్ట్‌ను ఎవరు ప్రారంభించారు?",
  options: ["సామ్ ఆల్ట్‌మాన్", "ఎలోన్ మస్క్", "మార్క్ జుకర్‌బర్గ్", "టిమ్ కుక్"],
  correctAnswerIndex: 0,
  explanation: "సామ్ ఆల్ట్‌మాన్, ఇద్దరు సహ-వ్యవస్థాపకులతో కలిసి, వినియోగదారులకు ధృవీకరించబడిన డిజిటల్ గుర్తింపు మరియు ఆర్థిక ప్రాజెక్ట్‌కు ప్రాప్యతను మంజూరు చేయడానికి వరల్డ్‌కాయిన్ క్రిప్టో ప్రాజెక్ట్‌ను ప్రారంభించారు."
  ),
  Question(
  questionText: "చంద్రయాన్-3 అంతరిక్ష నౌక దాని చంద్ర అన్వేషణ మిషన్‌లో ఏ విజయాన్ని సాధించింది?",
  options: ["లూనార్ ల్యాండింగ్", "ట్రాన్స్‌లూనార్ ఇంజెక్షన్ (TLI)", "లూనార్ ఆర్బిట్ ఇన్సర్షన్ (LOI)", "మార్స్ ల్యాండింగ్"],
  correctAnswerIndex: 1,
  explanation: "చంద్రయాన్-3 స్పేస్‌క్రాఫ్ట్ ట్రాన్స్‌లూనార్ ఇంజెక్షన్ (TLI)ను పూర్తి చేసింది, ఇది భారతదేశం యొక్క మూడవ చంద్ర అన్వేషణ మిషన్‌లో ఒక ముఖ్యమైన దశను సూచిస్తుంది. తదుపరి కీలకమైన దశ ఆగస్టు 5న షెడ్యూల్ చేయబడిన చంద్ర కక్ష్య చొప్పించడం (LOI)."
  ),
  Question(
  questionText: "ఆల్బర్ట్ ఐన్‌స్టీన్ యొక్క సాధారణ సాపేక్షత సిద్ధాంతానికి సంబంధించి ఖగోళ శాస్త్రవేత్తలు ఏమి కనుగొన్నారు?",
  options: ["ఐన్స్టీన్ యొక్క టెలిస్కోప్", "ఐన్స్టీన్స్ క్రాస్", "ఐన్స్టీన్స్ గెలాక్సీ", "ఐన్స్టీన్స్ స్టార్"],
  correctAnswerIndex: 1,
  explanation: "ఖగోళ శాస్త్రవేత్తఆల్బర్ట్ ఐన్స్టీన్ యొక్క సాధారణ సాపేక్షత సిద్ధాంతం నుండి ఒక అంచనాను ధృవీకరిస్తూ, సుదూర గెలాక్సీ నుండి వచ్చే కాంతిని ముందువైపు దీర్ఘవృత్తాకార భూమి ద్వారా విభజించి, పెద్దదిగా మార్చే 'ఐన్‌స్టీన్ క్రాస్' యొక్క అద్భుతమైన ఆవిష్కరణను చేశారు."
  ),
  Question(
  questionText: "నేషనల్ హెల్త్ అథారిటీ (NHA) మరియు ఆరోగ్య మంత్రిత్వ శాఖ చురుకుగా ఏ చొరవలో నిమగ్నమై ఉన్నాయి?",
  options: ["టెలిమెడిసిన్ నెట్‌వర్క్", "నేషనల్ హెల్త్ ఇన్సూరెన్స్", "ఆర్గాన్ డొనేషన్ రిజిస్ట్రీ", "క్యాన్సర్ రీసెర్చ్ ప్రోగ్రామ్"],
  correctAnswerIndex: 2,
  explanation: "నేషనల్ ఆర్గాన్ టిష్యూ ట్రాన్స్‌ప్లాంటేషన్ ఆర్గనైజేషన్ (NOTTO)కి నిర్మాణాత్మక మెరుగుదలలను పరిచయం చేయడానికి నేషనల్ హెల్త్ అథారిటీ (NHA) మరియు ఆరోగ్య మంత్రిత్వ శాఖ ఒక అవయవ దానం రిజిస్ట్రీ అభివృద్ధిలో చురుకుగా నిమగ్నమై ఉన్నాయి."
  ),
  Question(
  questionText: "జూలాజికల్ సర్వే ఆఫ్ ఇండియా (ZSI) దాని 108వ వ్యవస్థాపక దినోత్సవం సందర్భంగా ఏ ప్రచురణను ఆవిష్కరించింది?",
  options: ["భారత క్షీరదాల కాటలాగ్", "భారతదేశానికి చెందిన 75 స్థానిక పక్షులు", "పశ్చిమ కనుమల ఉభయచరాలు", "హిమాలయాల కీటకాలు"],
  correctAnswerIndex: 1,
  explanation: "తన 108వ పునాది రోజున, జూలాజికల్ సర్వే ఆఫ్ ఇండియా (ZSI) '75 ఎండిమిక్ బర్డ్స్ ఆఫ్ ఇండియా' అనే శీర్షికతో ఒక ప్రచురణను ఆవిష్కరించింది, భారతదేశంలోని 5% పక్షి జాతులు కేవలం దేశ సరిహద్దుల్లోనే పరిమితమై ఉన్నాయని హైలైట్ చేసింది."
  ),
  Question(
  questionText: "జేమ్స్ వెబ్ స్పేస్ టెలిస్కోప్ ఏ ఖగోళ వస్తువును సంగ్రహించింది, సూర్యుని లాంటి నక్షత్రం యొక్క అవశేషాలను ప్రదర్శిస్తుంది?",
  options: ["ఆండ్రోమెడ గెలాక్సీ", "రింగ్ నెబ్యులా", "వర్ల్‌పూల్ గెలాక్సీ", "క్రాబ్ నెబ్యులా"],
  correctAnswerIndex: 1,
  explanation: "ఖగోళ శాస్త్రవేత్తలు జేమ్స్ వెబ్ స్పేస్ టెలిస్కోప్‌ను ఉపయోగించి మెస్సియర్ 57 యొక్క అద్భుతమైన చిత్రాన్ని తీయడానికి ఉపయోగించారు, దీనిని రింగ్ నెబ్యులా అని పిలుస్తారు, ఇది సూర్యుని లాంటి నక్షత్రం యొక్క అవశేషాలను ప్రదర్శిస్తుంది."
  ),
  Question(
  questionText: "న్యూస్పేస్ ఇండియా లిమిటెడ్ (NSIL) మరియు టాటా ప్లే మధ్య ఏ వ్యూహాత్మక భాగస్వామ్యం ఏర్పడింది?",
  options: ["శాటిలైట్ కాన్స్టెలేషన్ ప్రాజెక్ట్", "GSAT-24 లాంచ్", "స్పేస్ టూరిజం వెంచర్", "లూనార్ ఎక్స్‌ప్లోరేషన్ ప్రోగ్రామ్"],
  correctAnswerIndex: 1,
  explanation: "వ్యూహాత్మక భాగస్వామ్యంలో, న్యూస్పేస్ ఇండియా లిమిటెడ్ (NSIL) GSAT-24ను పరిచయం చేయడానికి టాటా ప్లేతో జతకట్టింది, ఇది ఉపగ్రహ ప్రసార సామర్థ్యాలను పెంపొందించడానికి మరియు దేశవ్యాప్తంగా అధిక-నాణ్యత వినోదాన్ని అందించడానికి లక్ష్యంగా ఉంది."
  ),
  Question(
  questionText: "ఏ దేశం తన మొదటి చంద్ర ల్యాండింగ్ స్పేస్‌క్రాఫ్ట్, లూనా 25, దాని పునరుద్ధరించబడిన చంద్ర అన్వేషణ ప్రయత్నాలలో ఒక ముఖ్యమైన దశను ప్రయోగించడానికి సిద్ధంగా ఉంది?",
  options: ["భారతదేశం", "చైనా", "రష్యా", "USA"],
  correctAnswerIndex: 2,
  explanation: "రష్యా తన మొట్టమొదటి చంద్ర ల్యాండింగ్ స్పేస్‌క్రాఫ్ట్, లూనా25, ఆగష్టు 11న ప్రారంభించేందుకు సిద్ధంగా ఉంది, ఇది దాని పునరుద్ధరించిన చంద్ర అన్వేషణ ప్రయత్నాలలో ఒక ముఖ్యమైన దశను సూచిస్తుంది."
  ),
  Question(
  questionText: "భారత అంతరిక్ష పరిశోధనా సంస్థ (ఇస్రో) మొదటి సోలార్ మిషన్ ఆదిత్య-ఎల్1 లక్ష్యం ఏమిటి?",
  options: ["మార్స్ ఎక్స్‌ప్లోరేషన్", "ఆస్టెరాయిడ్ మైనింగ్", "స్టడీ ది సన్", "ఇంటర్స్టెల్లార్ ట్రావెల్"],
  correctAnswerIndex: 2,
  explanation: "సూర్యుడిని అధ్యయనం చేయడానికి ఇస్రో తన మొదటి సౌర మిషన్ ఆదిత్య-ఎల్ 1ని ప్రయోగిస్తోంది. ఈ మిషన్ లాగ్రాంజ్ పాయింట్ 1 (ఎల్1) చుట్టూ ఒక హాలో ఆర్బిట్‌లో ఉంచబడుతుంది, ఇది సూర్యుని వాతావరణం, అయస్కాంత క్షేత్రాలు మరియు అధ్యయనాన్ని అనుమతిస్తుంది. అంతరిక్ష వాతావరణ ప్రభావాలు."
  ),
  Question(
  questionText: "ఏవియేషన్‌లో కొరియా అడ్వాన్స్‌డ్ ఇన్‌స్టిట్యూట్ ఆఫ్ సైన్స్ & టెక్నాలజీ (KAIST) ఎలాంటి సంచలనాత్మక అభివృద్ధిని చేసింది?",
  options: ["సౌరశక్తితో నడిచే విమానం", "హ్యూమనాయిడ్ రోబోట్ పైలట్", "సూపర్సోనిక్ ప్యాసింజర్ జెట్", "AI-నియంత్రిత డ్రోన్స్"],
  correctAnswerIndex: 1,
  explanation: "KAIST తన సొంత సామర్థ్యం మరియు అధునాతన AI సామర్థ్యాలను ఉపయోగించి విమానాలను ఎగరడానికి రూపొందించిన మానవరూప రోబోట్ 'Pibot' అభివృద్ధితో విమానయానంలో సంచలనాత్మక పురోగతిని సాధిస్తోంది."
  ),
  Question(
  questionText: "ఏ చెన్నైకి చెందిన కంపెనీ తన సంచలనాత్మక ప్రయోగ వాహనం అగ్నిబాన్ SOrTeD యొక్క ఏకీకరణ ప్రక్రియను ప్రారంభించింది?",
  options: ["ఇస్రో (ఇండియన్ స్పేస్ రీసెర్చ్ ఆర్గనైజేషన్)", "DRDO (డిఫెన్స్ రీసెర్చ్ అండ్ డెవలప్‌మెంట్ ఆర్గనైజేషన్)", "భారత్ డైనమిక్స్ లిమిటెడ్", "అగ్నికుల్ కాస్మోస్"],
  correctAnswerIndex: 3,
  explanation: "చెన్నైకి చెందిన అగ్నికుల్ కాస్మోస్ శ్రీహరికోటలోని సతీష్ ధావన్ స్పేస్ సెంటర్‌లో ఉన్న తన ప్రైవేట్ లాంచ్‌ప్యాడ్‌తో తన సంచలనాత్మక ప్రయోగ వాహనం అగ్నిబాన్ SOrTeD యొక్క ఏకీకరణ ప్రక్రియను ప్రారంభించింది."
  ),
  Question(
  questionText: "చంద్రయాన్-3 మిషన్ సాఫ్ట్-ల్యాండింగ్ లైవ్ టెలికాస్ట్ సమయంలో భారత అంతరిక్ష పరిశోధన సంస్థ (ఇస్రో) ఏ మైలురాయిని సాధించింది?",
  options: ["చాలా ఉపగ్రహాలు ప్రయోగించబడ్డాయి", "మొదటి మహిళా వ్యోమగామి", "ఉపయోగించిన అతిపెద్ద రాకెట్", "ప్రపంచవ్యాప్తంగా అత్యధికంగా వీక్షించబడిన ప్రత్యక్ష ప్రసారం"],
  correctAnswerIndex: 3,
  explanation: "ఇస్రో యొక్క చంద్రయాన్-3 మిషన్ సాఫ్ట్-ల్యాండింగ్ లైవ్ టెలికాస్ట్ 80 లక్షల మంది పీక్ కాకరెంట్ వీక్షకుల (PCVలు) దృష్టిని ఆకర్షించింది, ఇది ప్రపంచవ్యాప్తంగా అత్యధికంగా వీక్షించబడిన ప్రత్యక్ష ప్రసారం అయింది."
  ),
  Question(
  questionText: "సూర్యుడిని అధ్యయనం చేయడానికి భారతదేశపు మొట్టమొదటి అంతరిక్ష ఆధారిత అబ్జర్వేటరీ అయిన ఆదిత్య-L1 మిషన్ ఎప్పుడు ప్రయోగించబడుతుంది?",
  options: ["అక్టోబర్ 2023", "నవంబర్ 2023", "డిసెంబర్ 2023", "జనవరి 2024"],
  correctAnswerIndex: 0,
      explanation:  "ఆదిత్య-ఎల్1 మిషన్‌ను సెప్టెంబర్ మొదటి వారం నాటికి ప్రయోగించే అవకాశం ఉందని ఇస్రో చీఫ్ ఎస్ సోమనాథ్ ప్రకటించారు."
  ),
  Question(
  questionText: "అక్రమమైన గెలాక్సీ ESO 300-16ను ప్రదర్శిస్తూ జేమ్స్ వెబ్ స్పేస్ టెలిస్కోప్ దేనిని సంగ్రహించింది?",
  options: ["ఎమిషన్ నెబ్యులా", "స్పైరల్ గెలాక్సీ", "స్టార్ క్లస్టర్", "రింగ్ నెబ్యులా"],
  correctAnswerIndex: 1,
  explanation: "హబుల్ స్పేస్ టెలిస్కోప్ క్రమరహిత గెలాక్సీ ESO 300-16 యొక్క విస్మయం కలిగించే చిత్రాన్ని సంగ్రహించింది, ఇది ఖగోళ వస్తువుల యొక్క అధిక-రిజల్యూషన్ మరియు ఖచ్చితమైన వివరణాత్మక చిత్రాలను అందిస్తుంది."
  ),
  Question(
  questionText: "2024-25 నాటికి జపనీస్ స్పేస్ ఏజెన్సీ (జాక్సా)తో కలిసి ఇస్రో ఏ సహకార చంద్ర మిషన్ ప్లాన్ చేస్తోంది?",
  options: ["చంద్రయాన్-4", "లూనా ఎక్స్‌ప్లోరేషన్ ప్రోగ్రామ్", "LUPEX (లూనార్ పోలార్ ఎక్స్‌ప్లోరేషన్)", "మార్స్ ఆర్బిటర్ మిషన్ 2"],
  correctAnswerIndex: 2,
  explanation: "ఇస్రో 2024-25లో షెడ్యూల్ చేయబడిన LUPEX (లూనార్ పోలార్ ఎక్స్‌ప్లోరేషన్) అని పిలువబడే జపనీస్ అంతరిక్ష సంస్థ (జాక్సా)తో కలిసి చంద్రుని మిషన్‌ను ప్లాన్ చేస్తోంది."
  ),
  Question(
  questionText: "ఇస్రో నేతృత్వంలోని గగన్‌యాన్ మిషన్ కోసం ట్రయల్స్ ఎప్పుడు ప్రారంభమవుతాయని భావిస్తున్నారు?",
  options: ["జూలై 2023", "అక్టోబర్ 2023", "డిసెంబర్ 2023", "ఫిబ్రవరి 2024"],
  correctAnswerIndex: 1,
  explanation: "ఇస్రో యొక్క గగన్‌యాన్ మిషన్‌కు సంబంధించిన ట్రయల్స్ అక్టోబర్‌లో ప్రారంభమవుతాయని పేర్కొంటూ కేంద్ర మంత్రి జితేంద్ర సింగ్ ఒక ముఖ్యమైన నవీకరణను అందించారు."
  ),
  Question(
  questionText: "సముద్ర యాత్రల సమయంలో మత్స్యకారుల భద్రతను మెరుగుపరచడానికి ఇస్రో ఏ వినూత్న పరికరాన్ని విజయవంతంగా పరీక్షించింది?",
  options: ["ఆక్వాటిక్ రోబోటిక్ డ్రోన్", "ఫిషర్‌మెన్ GPS ట్రాకర్", "నభమిత్ర", "ఓషన్ వెదర్ ఫోర్‌కాస్టింగ్ సిస్టమ్"],
  correctAnswerIndex: 2,
  explanation: "ఇస్రో అహ్మదాబాద్‌లోని ఇస్రో యొక్క స్పేస్ అప్లికేషన్స్ సెంటర్‌లో అభివృద్ధి చేసిన 'నభమిత్ర' అనే దాని వినూత్న పరికరాన్ని విజయవంతంగా పరీక్షించడం ద్వారా ఒక ముఖ్యమైన మైలురాయిని సాధించింది, ఇది మత్స్యకారుల సముద్ర యాత్రల సమయంలో వారి భద్రతను పెంపొందించే లక్ష్యంతో ఉంది."
  ),
  Question(
  questionText: "చంద్ర దక్షిణ ధ్రువం దగ్గర ఇన్‌సిటు రికార్డింగ్‌ల సమయంలో చంద్రయాన్-3 యొక్క ప్రజ్ఞాన్ రోవర్ మాడ్యూల్ ఏ ముఖ్యమైన నిర్ధారణను అందించింది?",
  options: ["నీటి ఉనికి", "ఆక్సిజన్ ఉనికి", "సల్ఫర్ ఉనికి", "బంగారం ఉనికి"],
  correctAnswerIndex: 2,
  explanation: "ఒక సంచలనాత్మక ప్రకటనలో, చంద్రయాన్-3 యొక్క ప్రజ్ఞాన్ రోవర్ మాడ్యూల్ చంద్రుని దక్షిణ ధ్రువం దగ్గర ఇన్సిటు రికార్డింగ్ సమయంలో చంద్రుని ఉపరితలంపై సల్ఫర్ (S) ఉనికిని నిర్ధారించిందని ఇస్రో వెల్లడించింది."
  ),
  Question(
  questionText: "డా. APJ అబ్దుల్ కలాం: మెమోరీస్ నెవర్ డై' పుస్తకాన్ని రామేశ్వరంలో ఎవరు విడుదల చేశారు?",
  options: ["నరేంద్ర మోడీ", "రాహుల్ గాంధీ", "అమిత్ షా", "సోనియా గాంధీ"],
  correctAnswerIndex: 2,
  explanation: "కేంద్ర హోం మంత్రి మరియు సహకార మంత్రి, శ్రీ అమిత్ షా రామేశ్వరంలో 'డా. APJ అబ్దుల్ కలాం: మెమోరీస్ నెవర్ డై' పుస్తకాన్ని విడుదల చేశారు."
  ),
  Question(
  questionText: "2023 బుకర్ ప్రైజ్ లాంగ్‌లిస్ట్‌లో లండన్‌కు చెందిన భారతీయ సంతతి రచయిత్రి చేతనా మారూ ఏ తొలి నవల ఉంది?",
  options: ["సిటీ ఆఫ్ డ్రీమ్స్", "వెస్ట్రన్ లేన్", "గార్డెన్ ఆఫ్ షాడోస్", "ఓషన్స్ ఎంబ్రేస్"],
  correctAnswerIndex: 1,
  explanation: "చెత్నా మారూ యొక్క తొలి నవల 'వెస్ట్రన్ లేన్' 2023 బుకర్ ప్రైజ్ లాంగ్‌లిస్ట్‌లో కట్ చేయడానికి 13 పుస్తకాలలో ఉంది, ఇది బ్రిటిష్ గుజరాతీ పరిసరాల చిత్రణకు ప్రశంసలు అందుకుంది."
  ),
  Question(
  questionText: "కాన్స్టిట్యూషన్ క్లబ్ ఆఫ్ ఇండియాలో 'కార్గిల్: ఏక్ యాత్రి కీ జుబానీ' (హిందీ ఎడిషన్) పేరుతో పుస్తకం మరియు దృష్టాంతాలను ఎవరు విడుదల చేశారు?",
  options: ["అమిత్ షా", "రాజ్‌నాథ్ సింగ్", "ఎస్ జైశంకర్", "నిర్మలా సీతారామన్"],
  correctAnswerIndex: 0,
  explanation: "రిషి రాజ్ రచించిన 'కార్గిల్: ఏక్ యాత్రి కి జుబానీ' (హిందీ ఎడిషన్) అనే పుస్తకాన్ని మరియు దృష్టాంతాలను రాష్ట్ర మంత్రి (MoS), రక్షణ మంత్రిత్వ శాఖ (MoD) అజయ్ భట్ విడుదల చేశారు."
  ),
  Question(
  questionText: "సోనియా గాంధీ ప్రకటనకు దారితీసిన నాటకాన్ని గుర్తుచేస్తూ నీర్జా చౌదరి కొత్త పుస్తకం యొక్క శీర్షిక ఏమిటి?",
  options: ["ది పొలిటికల్ డ్రామా", "ది పవర్ ప్లే", "ప్రధానులు ఎలా డిసైడ్ చేస్తారు", "సోనియా జర్నీ"],
  correctAnswerIndex: 2,
  explanation: "నీర్జా చౌదరి కొత్త పుస్తకం పేరు 'హౌ ప్రైమ్ మినిస్టర్స్ డిసైడ్', సోనియాగాంధీ ప్రకటనకు దారితీసిన నాటకాన్ని గుర్తుచేస్తూ, రాహుల్ 'తన తల్లి ప్రాణాల పట్ల భయం'తో ప్రేరేపించబడింది."
  ),
  Question(
  questionText: "పాత ఢిల్లీలోని కతికా కల్చర్ సెంటర్‌లో ప్రారంభించబడిన అభయ్ కుమార్ (అభయ్ కె) కొత్త పుస్తకం యొక్క శీర్షిక ఏమిటి?",
  options: ["మాన్సూన్: ఎ పోయెమ్ ఆఫ్ లవ్ అండ్ లాంజింగ్", "విస్పర్స్ ఆఫ్ ది విండ్", "ఎకోస్ ఆఫ్ ది హిమాలయాస్", "రిథమ్స్ ఆఫ్ ది రైన్"],
  correctAnswerIndex: 0,
  explanation: "భారత కవి దౌత్యవేత్త అభయ్ కుమార్ తన కొత్త పుస్తకాన్ని 'మాన్‌సూన్: ఎ పోయెమ్ ఆఫ్ లవ్ అండ్ లాంగింగ్' పేరుతో ఆవిష్కరించారు, ఇది 150 నాలుగు-లైన్ చరణాలలో సాగే పుస్తక-నిడివి గల కవిత."
  ),
  Question(
  questionText: "గోవా గవర్నర్ పి.ఎస్. శ్రీధరన్ పిళ్లై రాజ్ భవన్‌లో ఏ మూడు పుస్తకాలను విడుదల చేశారు?",
  options: ["హెరిటేజ్ ట్రీస్ ఆఫ్ గోవా, డాన్స్ ఆఫ్ షాడోస్, ఎసెన్స్ ఆఫ్ పొయెట్రీ", "పరలల్ లైన్స్ కలిసినప్పుడు, అర్ధరాత్రి మ్యూజింగ్స్, సోల్ ఆఫ్ ది సోల్", "ఎంటే ప్రియా కవితాకల్, రిఫ్లెక్షన్స్ ఆఫ్ ట్విలైట్, శాండ్స్ ఆఫ్ టైమ్", "హెరిటేజ్ ట్రీస్ గోవా యొక్క, When పారలల్ లైన్స్ మీట్, ఎంటే ప్రియా కవితకల్"],
  correctAnswerIndex: 2,
  explanation: "గోవా గవర్నర్ పి.ఎస్. శ్రీధరన్ పిళ్లై 'హెరిటేజ్ ట్రీస్ ఆఫ్ గోవా,' 'వెన్ పారలల్ లైన్స్ మీట్,' మరియు 'ఎంటే ప్రియా కవితకల్' ('మై డియర్ పోయెమ్స్' కవితల సంకలనం) అనే మూడు కొత్త పుస్తకాలను విడుదల చేశారు."
  ),
  Question(
  questionText: "భారత క్రికెట్‌లోని చిరస్మరణీయ క్షణాల గురించి సజీవమైన అంతర్దృష్టితో కూడిన ఫస్ట్-పర్సన్ ఖాతాలను తీసుకుని, దీర్ఘకాల క్రికెట్ నిర్వాహకుడు అమృత్ మాథుర్ రాసిన పుస్తకం యొక్క శీర్షిక ఏమిటి?",
  options: ["ఆన్ ది ఫీల్డ్ అండ్ బియాండ్", "ది క్రికెట్ క్రానికల్స్", "ప్లేయింగ్ ఇట్ స్ట్రెయిట్", "పిచ్‌సైడ్: మై లైఫ్ ఇన్ ఇండియన్ క్రికెట్"],
  correctAnswerIndex: 3,
  explanation: "లాంగ్-టర్మ్ క్రికెట్ అడ్మినిస్ట్రేటర్ అమృత్ మాథుర్ రాసిన 'పిచ్‌సైడ్: మై లైఫ్ ఇన్ ఇండియన్ క్రికెట్' అనే పుస్తకంలో భారత క్రికెట్‌లోని కొన్ని మరపురాని క్షణాల గురించి సజీవమైన అంతర్దృష్టి గల మొదటి వ్యక్తి ఖాతాలను అందించింది."
  ),

  Question(
  questionText: "కునో నేషనల్ పార్క్‌లో ధాత్రి అనే ఆడ చిరుత మరణించిన తర్వాత ఏమి దర్యాప్తు చేస్తున్నారు?",
  options: [
  "బాహ్య కారకాల ద్వారా సాధ్యమైన ఫౌల్ ప్లే",
  "రిలొకేట్ చేయబడిన చిరుతలకు పరిరక్షణ పద్ధతులు",
  "మరణానికి కారణాన్ని గుర్తించడానికి పోస్ట్ మార్టం పరీక్ష",
  "వన్యప్రాణులపై వాతావరణ మార్పుల ప్రభావం"
  ],
  correctAnswerIndex: 2,
  explanation: "కునో నేషనల్ పార్క్‌లో ధాత్రి అనే ఆడ చిరుత మరణానికి కారణాన్ని గుర్తించేందుకు పోస్ట్‌మార్టం పరీక్ష జరుగుతోంది."
  ),
  Question(
  questionText: "అస్సాం రాష్ట్ర జంతుప్రదర్శనశాలలో బందిఖానాలో విజయవంతంగా సంతానోత్పత్తి చేయడం వల్ల ఏ జాతి వారి పరిరక్షణ ప్రయాణంలో గణనీయమైన ఆశను సాధించింది?",
  options: [
  "బెంగాల్ టైగర్",
  "హిమాలయన్ రాబందు",
  "భారత ఖడ్గమృగం",
  "మంచు చిరుత"
  ],
  correctAnswerIndex: 1,
  explanation: "అస్సాం రాష్ట్ర జంతుప్రదర్శనశాలలో బందిఖానాలో విజయవంతమైన సంతానోత్పత్తి కారణంగా హిమాలయ రాబందు వారి పరిరక్షణ ప్రయాణంలో ఒక ముఖ్యమైన ఆశను సాధించింది."
  ),
  Question(
  questionText: "డ్రగ్స్ అండ్ కాస్మెటిక్స్ యాక్ట్, 1940లోని సెక్షన్ 26A కింద జంతువుల వినియోగాన్ని కేంద్ర ఆరోగ్య మరియు కుటుంబ సంక్షేమ మంత్రిత్వ శాఖ ఏమి నిషేధించింది?",
  options: [
  "యాంటీబయాటిక్స్",
  "'కెటోప్రోఫెన్' మరియు 'అసెక్లోఫెనాక్' వాటి సూత్రీకరణలతో పాటు",
  "టీకాలు",
  "పురుగుమందులు"
  ],
  correctAnswerIndex: 1,
  explanation: "కేంద్ర ఆరోగ్య మరియు కుటుంబ సంక్షేమ మంత్రిత్వ శాఖ డ్రగ్స్ అండ్ కాస్మెటిక్స్ చట్టం, 1940లోని సెక్షన్ 26A కింద జంతువుల ఉపయోగం కోసం 'కెటోప్రోఫెన్' మరియు 'అసెక్లోఫెనాక్' ఉత్పత్తి, అమ్మకం మరియు పంపిణీని నిషేధించింది."
  ),
  Question(
  questionText: "ఏ రెండు ఉత్పత్తులకు భౌగోళిక సూచిక (GI) ట్యాగ్‌లు మంజూరు చేయబడ్డాయి, వాటి ప్రత్యేక స్వభావం మరియు అసాధారణమైన లక్షణాలను సూచిస్తుంది?",
  options: [
  "డార్జిలింగ్ టీ మరియు అల్ఫోన్సో మామిడి",
  "బాస్మతి రైస్ మరియు కాంచీపురం సిల్క్ చీర",
  "రజౌరీ చిక్రి వుడ్ క్రాఫ్ట్ మరియు ముష్క్బుడ్జి రైస్",
  "ఆగ్రా పేట మరియు బనారసీ పాన్"
  ],
  correctAnswerIndex: 2,
  explanation: "రాజౌరి జిల్లాకు చెందిన రాజౌరీ చిక్రి వుడ్ క్రాఫ్ట్ మరియు అనంత్‌నాగ్ జిల్లా నుండి బహుమతి పొందిన ముష్క్‌బుడ్జి రైస్ రకానికి భౌగోళిక సూచిక (జిఐ) ట్యాగ్‌లు మంజూరు చేయబడ్డాయి."
  ),
  Question(
  questionText: "పూర్తిగా మహిళా సిబ్బందిచే నిర్వహించబడే మొదటి 'పింక్ స్టేషన్' ఏది రైల్వే స్టేషన్?",
  options: [
  "న్యూ ఢిల్లీ రైల్వే స్టేషన్",
  "ముంబై సెంట్రల్ రైల్వే స్టేషన్",
  "కొత్త అమరావతి రైల్వే స్టేషన్",
  "చెన్నై సెంట్రల్ రైల్వే స్టేషన్"
  ],
  correctAnswerIndex: 2,
  explanation: "సెంట్రల్ రైల్వే యొక్క కొత్త అమరావతి స్టేషన్ భూసావల్ డివిజన్‌లో మొదటి స్టేషన్‌గా మారింది మరియు సెంట్రల్ రైల్వేలో మూడవ స్టేషన్‌గా 'పింక్ స్టేషన్'గా గుర్తించబడింది - ఇది పూర్తిగా మహిళా సిబ్బందిచే నిర్వహించబడే స్టేషన్."
  ),
  Question(
  questionText: "ఇందిరా గాంధీ మెమోరియల్ తులిప్ గార్డెన్ ప్రపంచ బుక్ ఆఫ్ రికార్డ్స్‌లో గుర్తింపు పొందేందుకు దారితీసిన ఏ ప్రత్యేకతను సాధించింది?",
  options: [
  "అరుదైన పువ్వుల అతిపెద్ద సేకరణ",
  "ఆసియాలో అతిపెద్ద మరియు అత్యంత అద్భుతమైన తులిప్ తోట",
  "ఆసియాలో మొట్టమొదటి పూర్తి ఆటోమేటెడ్ గార్డెన్",
  "అరుదైన సీతాకోక చిలుక జాతులకు నిలయం"
  ],
  correctAnswerIndex: 1,
  explanation: "ఇందిరా గాంధీ మెమోరియల్ తులిప్ గార్డెన్ వరల్డ్ బుక్ ఆఫ్ రికార్డ్స్‌లో ఆసియాలోనే అతిపెద్ద మరియు అత్యంత అద్భుతమైన తులిప్ గార్డెన్‌గా గుర్తింపు పొందింది."
  ),
  Question(
  questionText: "కన్యాకుమారి జిల్లాకు చెందిన ఏ అరటి రకానికి జియోగ్రాఫికల్ ఇండికేషన్ (జిఐ) ట్యాగ్ మంజూరు చేయబడింది?",
  options: [
  "అరటి అరటి",
  "ఎరుపు అరటి",
  "కావెండిష్ బనానా",
  "మట్టి అరటి"
  ],
  correctAnswerIndex: 3,
  explanation: "కన్నియాకుమారి జిల్లాకు చెందిన మట్టి అరటి రకానికి భౌగోళిక సూచిక (GI) ట్యాగ్ మంజూరు చేయబడింది."
  ),
  Question(
  questionText: "హాట్ మెటల్ ఉత్పత్తిని ప్రారంభించిన కేవలం 9 రోజుల తర్వాత ఏ స్టీల్ ప్లాంట్ తన ప్రారంభ హాట్ రోల్డ్ (HR) కాయిల్‌ను విడుదల చేసే మైలురాయిని సాధించింది?",
  options: [
  "టాటా స్టీల్ జంషెడ్‌పూర్",
  "JSW స్టీల్ విజయనగర్",
  "నాగర్నార్ స్టీల్ ప్లాంట్",
  "భిలాయ్ స్టీల్ ప్లాంట్"
  ],
  correctAnswerIndex: 2,
  explanation: "హాట్ మెటల్ ఉత్పత్తిని ప్రారంభించిన 9 రోజుల తర్వాత నాగర్నార్ స్టీల్ ప్లాంట్ దాని ప్రారంభ హాట్ రోల్డ్ (HR) కాయిల్‌ను విడుదల చేసే మైలురాయిని సాధించింది."
  ),
  Question(
  questionText: "ఏ వైరస్, మొదట ఉగాన్‌లో గుర్తించబడిందిడా 1947లో, ప్రధానంగా ఏడెస్ దోమల ద్వారా వ్యాపిస్తుంది, ప్రస్తుత వ్యవహారాలలో ప్రస్తావించబడింది?",
  options: [
  "డెంగ్యూ వైరస్",
  "జికా వైరస్",
  "చికున్‌గున్యా వైరస్",
  "ఎల్లో ఫీవర్ వైరస్"
  ],
  correctAnswerIndex: 1,
  explanation: "జికా వైరస్, మొదట ఉగాండాలో 1947లో గుర్తించబడింది, ప్రస్తుత వ్యవహారాలలో ఇది ప్రస్తావించబడింది. ఇది ప్రధానంగా పగటిపూట చురుకుగా ఉండే ఈడెస్ దోమల ద్వారా వ్యాపిస్తుంది."
  ),
  Question(
  questionText: "'మ్యాజిక్ రైస్' అని పిలువబడే మరియు అస్సాంకు చెందిన ఏ వరి రకానికి ఇటీవల భౌగోళిక సూచిక (GI) ట్యాగ్ మంజూరు చేయబడింది?",
  options: [
  "బాస్మతి రైస్",
  "జోహా రైస్",
  "చోకువా రైస్",
  "సోనా మసూరి రైస్"
  ],
  correctAnswerIndex: 2,
  explanation: "మ్యాజిక్ రైస్‌గా పిలవబడే చోకువా బియ్యం ఇటీవలే ప్రతిష్టాత్మకమైన భౌగోళిక సూచిక (GI) ట్యాగ్‌తో అందించబడింది."
  ),
  Question(
  questionText: "మిస్ వరల్డ్ అందాల పోటీ యొక్క 71వ ఎడిషన్ ఎక్కడ నిర్వహించబడుతోంది?",
  options: [
  "న్యూయార్క్, USA",
  "పారిస్, ఫ్రాన్స్",
  "కశ్మీర్, భారతదేశం",
  "టోక్యో, జపాన్"
  ],
  correctAnswerIndex: 2,
  explanation: "మిస్ వరల్డ్ యొక్క CEO అయిన జూలియా ఎరిక్ మోర్లీ, మిస్ వరల్డ్ అందాల పోటీ యొక్క 71వ ఎడిషన్‌ను ప్రకటించారు, ఇది భారతదేశంలోని కాశ్మీర్‌లో నిర్వహించబడుతోంది."
  ),

];


int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

late Timer _examTimer;

@override
void initState() {
super.initState();
_loadLikedData();
//_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
_startriversTimer();
}
void _startriversTimer() {
_examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
setState(() {
_elapsedTimeInSeconds++;
});
});
}

Future<void> _loadLikedData() async {
// Load liked questions data here
// ...
}

void _nextQuestion() {
setState(() {
if (_currentQuestionIndex < _questions.length - 1) {
_currentQuestionIndex++;
_selectedAnswerIndex = null;
} else {
// All questions have been answered, navigate to results screen
_navigateToResults();
}
});
}

void _previousQuestion() {
setState(() {
if (_currentQuestionIndex > 0) {
_currentQuestionIndex--;
_selectedAnswerIndex = null;
}
});
}

void _navigateToResults() {
// Navigate to results screen
_examTimer.cancel(); // Cancel the exam timer before navigating
Navigator.of(context).pushReplacement(
MaterialPageRoute(
builder: (context) => ResultsScreen(
userAnswers: _userAnswers,
questions: _questions,
elapsedTimeInSeconds: _elapsedTimeInSeconds,
),
),
);
}

@override
Widget build(BuildContext context) {
return Scaffold(
appBar: AppBar(
title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
backgroundColor: Colors.blueAccent,
),
  body: GestureDetector(
    onVerticalDragEnd: (details) {
      if (details.velocity.pixelsPerSecond.dy < 0) {
        // Swipe up detected, move to the next question
        _nextQuestion();
      } else if (details.velocity.pixelsPerSecond.dy > 0) {
        // Swipe down detected, move to the previous question
        _previousQuestion();
      }
    },
    onHorizontalDragEnd: (details) {
      if (details.primaryVelocity! > 0) {
        _previousQuestion();
      } else if (details.primaryVelocity! < 0) {
        _nextQuestion();
      }
    },
child: ListView(

padding: EdgeInsets.all(16.0),
children: [
  MyBannerAdWidget(), // Add the banner ad here
Text(
"Question ${_currentQuestionIndex + 1}:",
style: TextStyle(
fontSize: 18,
fontWeight: FontWeight.bold,
),
),
SizedBox(height: 8.0),
Text(
_questions[_currentQuestionIndex].questionText,
style: TextStyle(fontSize: 16),
),
SizedBox(height: 16.0),
..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
final optionIndex = entry.key;
final optionText = entry.value;
return InkWell( // Added this InkWell
onTap: () {
setState(() {
_selectedAnswerIndex = optionIndex;
_userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
});
},
child: ListTile(
title: Text(optionText),
leading: Radio<int>(
value: optionIndex,
groupValue: _selectedAnswerIndex,
onChanged: (int? value) {
setState(() {
_selectedAnswerIndex = value;
_userAnswers[_currentQuestionIndex] = value; // Store user's answer
});
},
),
),
);
}).toList(),
  // Show correct answer if an option is selected
  if (_selectedAnswerIndex != null)
    Text(
      "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
      style: TextStyle(
        fontSize: 16,
        fontWeight: FontWeight.bold,
        color: Colors.green, // Set your desired color here
      ),
    ),

  MyBannerAdWidget(), // Add the banner ad here
],
),
),
bottomNavigationBar: Container(
color: Colors.red[400],
child: Theme(
data: Theme.of(context).copyWith(
canvasColor: Colors.blueAccent[200],
),
child: BottomNavigationBar(
type: BottomNavigationBarType.fixed,
items: const [
BottomNavigationBarItem(
icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
label: '',
),
BottomNavigationBarItem(
icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
label: '',
),
],
onTap: (index) {
if (index == 0) {
_previousQuestion();
} else if (index == 1) {
_nextQuestion();
}
},
),
),
),
// Overall exam timer display

// Overall exam timer display
// Overall exam timer display
persistentFooterButtons: [
Text(
'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
),
],

);
}
@override
void dispose() {
// Dispose of the exam timer when the widget is disposed
_examTimer.cancel();
super.dispose();
}
}

class ResultsScreen extends StatelessWidget {
final int elapsedTimeInSeconds;
final List<int?> userAnswers;
final List<Question> questions;

ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


int calculateScore() {
int score = 0;
for (int i = 0; i < questions.length; i++) {
if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
score++;
}
}
return score;
}
String formatElapsedTime(int seconds) {
int minutes = seconds ~/ 60;
int remainingSeconds = seconds % 60;
return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
}
@override
Widget build(BuildContext context) {
final int score = calculateScore();
final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
return Scaffold(
appBar: AppBar(
title: Text("Results"),
actions: [
Padding(
padding: EdgeInsets.all(16.0),
child: Text("Completed Time: $completedTime" ),
),
],
),
body: ListView(
padding: EdgeInsets.all(16.0),
children: [
  MyBannerAdWidget(), // Add the banner ad here
Text(
"Your Score: $score/${questions.length}",
style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
),
SizedBox(height: 16.0),
for (int i = 0; i < questions.length; i++) ...[
Text(
"Question ${i + 1}:",
style: TextStyle(
fontSize: 18,
fontWeight: FontWeight.bold,
),
),
SizedBox(height: 8.0),
Text(
questions[i].questionText,
style: TextStyle(fontSize: 16),
),
SizedBox(height: 8.0),
Text(
"Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
),
Text(
"Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
),
SizedBox(height: 16.0),
Text(
"Explanation: ${questions[i].explanation}",
style: TextStyle(fontSize: 16),
),
SizedBox(height: 16.0),

],
],
),
);
}
}

void main() {
runApp(MaterialApp(
home: august_te(),
));
}
