import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class july_te extends StatefulWidget {
  final String? userIdentifier;

  july_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<july_te> createState() => _july_teState();
}

class _july_teState extends State<july_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(300, null); // Initialize with the number of questions

  List<Question> _questions = [


    Question(
        questionText: "వింబుల్డన్ 2023లో పురుషుల సింగిల్స్ టైటిల్‌ను ఎవరు గెలుచుకున్నారు?",
        options: [
          "నొవాక్ జకోవిచ్",
          "కార్లోస్ అల్కరాజ్",
          "మార్కెటా వొండ్రూసోవా",
          "ఆన్స్ జబీర్"
        ],
        correctAnswerIndex: 1,
        explanation: "వింబుల్డన్ 2023లో కార్లోస్ అల్కరాజ్ పురుషుల సింగిల్స్ టైటిల్‌ను గెలుచుకున్నాడు."
    ),

    Question(
        questionText: "వింబుల్డన్ 2023లో మహిళల సింగిల్స్ ఛాంపియన్‌గా ఎవరు నిలిచారు?",
        options: [
          "మార్కెటా వొండ్రూసోవా",
          "ఆన్స్ జబీర్",
          "బార్బోరా స్ట్రికోవా",
          "హ్సీహ్ సు-వీ"
        ],
        correctAnswerIndex: 0,
        explanation: "మార్కెటా వొండ్రూసోవా వింబుల్డన్ 2023లో మహిళల సింగిల్స్ ఛాంపియన్‌గా నిలిచింది."
    ),

    Question(
        questionText: "వింబుల్డన్ 2023లో పురుషుల డబుల్స్ టైటిల్‌ను ఏ జంట గెలుచుకుంది?",
        options: [
          "వెస్లీ కూల్హోఫ్ & నీల్ స్కుప్స్కీ",
          "హోరాసియో జెబల్లోస్ & మార్సెల్ గ్రానోల్లర్స్",
          "మేట్ పావిక్ & లియుడ్మిలా కిచెనోక్",
          "జు యి అభిమాని & జోరాన్ విలీగెన్"
        ],
        correctAnswerIndex: 0,
        explanation: "వింబుల్డన్ 2023లో వెస్లీ కూల్‌హోఫ్ & నీల్ స్కుప్స్కీ పురుషుల డబుల్స్ టైటిల్‌ను గెలుచుకున్నారు."
    ),

    Question(
        questionText: "వింబుల్డన్ 2023లో మహిళల డబుల్స్‌లో ఛాంపియన్‌గా ఎవరు నిలిచారు?",
        options: [
          "బార్బోరా స్ట్రికోవా & హ్సీహ్ సు-వీ",
          "ఎలిస్ మెర్టెన్స్ & స్టార్మ్ సాండర్స్",
          "మార్కెటా వొండ్రూసోవా & ఆన్స్ జబీర్",
          "జు యి అభిమాని & జోరాన్ విలీగెన్"
        ],
        correctAnswerIndex: 0,
        explanation: "వింబుల్డన్ 2023లో బార్బోరా స్ట్రోకోవా & హ్సీహ్ సు-వీ మహిళల డబుల్స్ టైటిల్‌ను గెలుచుకున్నారు."
    ),

    Question(
        questionText: "NITI ఆయోగ్ యొక్క ఎగుమతి సన్నద్ధత సూచిక 2022లో భారతదేశంలో ఏ రాష్ట్రం అగ్రస్థానంలో ఉంది?",
        options: [
          "మహారాష్ట్ర",
          "కర్ణాటక",
          "తమిళనాడు",
          "గుజరాత్"
        ],
        correctAnswerIndex: 2,
        explanation: "నీతి ఆయోగ్ యొక్క ఎగుమతి సన్నద్ధత సూచిక 2022లో తమిళనాడు అగ్రస్థానంలో ఉంది."
    ),

    Question(
        questionText: "ఎగుమతి సన్నద్ధత సూచిక 2022లో తమిళనాడు మొత్తం స్కోర్ ఎంత?",
        options: [
          "76.36",
          "78.20",
          "80.89",
          "73.22"
        ],
        correctAnswerIndex: 2,
        explanation: "ఎగుమతి సన్నద్ధత సూచిక 2022లో తమిళనాడు 80.89 స్కోర్ చేసింది."
    ),

    Question(
        questionText: "హెన్లీ పాస్‌పోర్ట్ ఇండెక్స్ 2023లో ప్రపంచంలో అత్యంత శక్తివంతమైన పాస్‌పోర్ట్ టైటిల్ ఏ దేశం కలిగి ఉంది?",
        options: [
          "జర్మనీ",
          "సింగపూర్",
          "జపాన్",
          "ఇటలీ"
        ],
        correctAnswerIndex: 1,
        explanation: "హెన్లీ పాస్‌పోర్ట్ ఇండెక్స్ 2023లో సింగపూర్ ప్రపంచంలోనే అత్యంత శక్తివంతమైన పాస్‌పోర్ట్ టైటిల్‌ను కలిగి ఉంది."
    ),

    Question(
        questionText: "హెన్లీ పాస్‌పోర్ట్ ఇండెక్స్ 2023లో భారతదేశం యొక్క ర్యాంకింగ్ ఏమిటి?",
        options: [
          "75వ",
          "80వ",
          "85వ",
          "90వ"
        ],
        correctAnswerIndex: 1,
        explanation: "హెన్లీ పాస్‌పోర్ట్ ఇండెక్స్ 2023లో భారతదేశం 80వ స్థానంలో ఉంది."
    ),



    Question(
        questionText: "హర్యానాలోని అంబాలాలో ఏ రేడియో స్టేషన్, నేషనల్ కమ్యూనిటీ రేడియో అవార్డ్స్‌లో మొదటి బహుమతిని గెలుచుకుంది?",
        options: [
          "రేడియో హిరాఖండ్",
          "గ్రీన్ రేడియో",
          "రేడియో మైండ్ ట్రీ",
          "రేడియో SD"
        ],
        correctAnswerIndex: 2,
        explanation: "హర్యానాలోని అంబాలాలోని రేడియో మైండ్ ట్రీ నేషనల్ కమ్యూనిటీ రేడియో అవార్డ్స్‌లో మొదటి బహుమతిని గెలుచుకుంది."
    ),

    Question(
        questionText: "థీమాటిక్ అవార్డుల విభాగంలో ఏ రాష్ట్ర కార్యక్రమం 'హోప్ జీనే కి రా' మొదటి బహుమతిని గెలుచుకుంది?",
        options: [
          "ఒడిశా",
          "హర్యానా",
          "బీహార్",
          "ఉత్తర ప్రదేశ్"
        ],
        correctAnswerIndex: 1,
        explanation: "థీమాటిక్ అవార్డుల విభాగంలో హర్యానాకు చెందిన 'హోప్ జీనే కి రా' కార్యక్రమం మొదటి బహుమతిని గెలుచుకుంది."
    ),

    Question(
        questionText: "తీర ప్రాంతాలలో ఎగుమతి సన్నద్ధత సూచిక 2022లో ఏ రాష్ట్రం అగ్రస్థానంలో ఉంది?",
        options: [
          "ఆంధ్రప్రదేశ్",
          "కేరళ",
          "పశ్చిమ బెంగాల్",
          "గుజరాత్"
        ],
        correctAnswerIndex: 2,
        explanation: "తీర ప్రాంతాలలో ఎగుమతి సన్నద్ధత సూచిక 2022లో పశ్చిమ బెంగాల్ అగ్రస్థానంలో ఉంది."
    ),

    Question(
        questionText: "ఎగుమతి సన్నద్ధత సూచిక 2022లో ఏ కేంద్రపాలిత ప్రాంతం/చిన్న రాష్ట్రం అగ్రస్థానాన్ని పొందింది?",
        options: [
          "ఢిల్లీ",
          "గోవా",
          "అండమాన్ మరియు నికోబార్",
          "లడఖ్"
        ],
        correctAnswerIndex: 1,
        explanation: "ఎగుమతి సన్నద్ధత సూచిక 2022లో కేంద్రపాలిత ప్రాంతాలు/చిన్న రాష్ట్రాలలో గోవా అగ్రస్థానంలో ఉంది."
    ),

    Question(
        questionText: "నీతి ఆయోగ్ నివేదిక ప్రకారం భారతదేశంలోని ఏ రాష్ట్రం బహుమితీయ పేదరికంలో అతిపెద్ద క్షీణతను చూపింది?",
        options: [
          "ఉత్తర ప్రదేశ్",
          "మహారాష్ట్ర",
          "తమిళనాడు",
          "బీహార్"
        ],
        correctAnswerIndex: 0,
        explanation: "నీతి ఆయోగ్ నివేదిక ప్రకారం ఉత్తరప్రదేశ్ బహుమితీయ పేదరికంలో అతిపెద్ద క్షీణతను చూపింది."
    ),


    Question(
        questionText: "హెన్లీ పాస్‌పోర్ట్ ఇండెక్స్ 2023లో ఏ దేశం అత్యల్ప ర్యాంక్‌ను కలిగి ఉంది?",
        options: [
          "సిరియా",
          "పాకిస్తాన్",
          "ఆఫ్ఘనిస్తాన్",
          "ఇరాక్"
        ],
        correctAnswerIndex: 2,
        explanation: "హెన్లీ పాస్‌పోర్ట్ ఇండెక్స్ 2023లో ఆఫ్ఘనిస్తాన్ అత్యల్ప ర్యాంక్‌ను కలిగి ఉంది."
    ),

    Question(
        questionText: "ఎగుమతి సన్నద్ధత సూచికలోని ఏ స్తంభం రాష్ట్రాలు మరియు UTల యొక్క వాస్తవ ఎగుమతి ఫలితాలను అంచనా వేస్తుంది?",
        options: [
          "విధాన స్తంభం",
          "వ్యాపార పర్యావరణ వ్యవస్థ",
          "ఎగుమతి పర్యావరణ వ్యవస్థ",
          "ఎగుమతి పనితీరు"
        ],
        correctAnswerIndex: 3,
        explanation: "ఎగుమతి సన్నద్ధత సూచికలో రాష్ట్రాలు మరియు UTల యొక్క వాస్తవ ఎగుమతి ఫలితాలను ఎగుమతి పనితీరు స్తంభం అంచనా వేస్తుంది."
    ),
    Question(
      questionText: "లోకల్ కల్చర్ అవార్డులను ప్రోత్సహించడంలో ఏ కమ్యూనిటీ రేడియో స్టేషన్ మొదటి బహుమతిని గెలుచుకుంది?",
      options: [
        "కబీర్ రేడియో, సంత్ కబీర్ నగర్, UP.",
        "రేడియో మైండ్ ట్రీ, అంబాలా, హర్యానా.",
        "వాయిస్ ఆఫ్ SOA, కటక్, ఒడిస్సా.",
        "ఫ్రెండ్స్ FM, త్రిపుర, అగర్తల."
      ],
      correctAnswerIndex: 2,
      explanation: "వాయిస్ ఆఫ్ SOA, కటక్, ఒడిస్సా, స్థానిక సంస్కృతిని ప్రోత్సహించడంలో మొదటి బహుమతిని గెలుచుకుంది.",
    ),




    Question(
      questionText: "ప్రభుత్వం ద్వారా కమ్యూనిటీ రేడియో స్టేషన్‌ల లైసెన్సింగ్ సమయంలో ఏ మార్పు జరిగింది?",
      options: [
        "ఆరు నెలల నుండి నాలుగు సంవత్సరాలకు తగ్గించబడింది.",
        "ఆరు నెలల నుంచి నాలుగు సంవత్సరాలకు పెంపు.",
        "నాలుగు సంవత్సరాల నుండి ఆరు నెలలకు తగ్గించబడింది.",
        "నాలుగేళ్లుగా మారలేదు."
      ],
      correctAnswerIndex: 2,
      explanation: "కమ్యూనిటీ రేడియో స్టేషన్ల లైసెన్సింగ్ సమయం గణనీయంగా నాలుగు సంవత్సరాల నుండి ఆరు నెలలకు తగ్గించబడింది.",
    ),

    Question(
      questionText: "సవరించబడిన ఆల్ ఇండియా సర్వీసెస్ (డెత్-కమ్-రిటైర్మెంట్ బెనిఫిట్స్) రూల్స్, 1958, చిరునామా ఏమిటి?",
      options: [
        "టైగర్ రిజర్వ్‌ల కోసం మెరుగైన రక్షణ చర్యలు.",
        "IAS, IPS, IFOS పెన్షనర్ల పదవీ విరమణ ప్రయోజనాలలో మార్పులు.",
        "పంజాబ్ నేషనల్ బ్యాంక్ ద్వారా వర్చువల్ బ్రాంచ్ ప్రారంభం.",
        "IDFC ఫస్ట్ బ్యాంక్ మరియు IDFC లిమిటెడ్ విలీనం."
      ],
      correctAnswerIndex: 1,
      explanation: "నియమాలలో సవరణలు IAS, IPS మరియు IFoS అధికారుల పదవీ విరమణ ప్రయోజనాలకు సంబంధించినవి.",
    ),


    Question(
      questionText: "29 జూలై 2023న గ్లోబల్ టైగర్ డే రోజున భారతదేశం ఏ ముఖ్యమైన మైలురాయిని సాధించింది?",
      options: [
        "పులుల సంరక్షణపై సమగ్ర నివేదికను ప్రారంభించడం.",
        "ప్రాజెక్ట్ టైగర్ 50 సంవత్సరాలు పూర్తి చేసుకుంది.",
        "పులి జనాభాలో 6.1% వార్షిక వృద్ధి రేటును వెల్లడిస్తోంది.",
        "SBI ద్వారా 34 ట్రాన్సాక్షన్ బ్యాంకింగ్ హబ్‌లను ఏర్పాటు చేస్తున్నట్లు ప్రకటించడం."
      ],
      correctAnswerIndex: 2,
      explanation: "గ్లోబల్ టైగర్ డే రోజున 6.1% వార్షిక వృద్ధి రేటుతో భారతదేశం 3,925 పులుల జనాభా అంచనాను వెల్లడించింది.",
    ),

    Question(
      questionText: "అందించిన డేటా ప్రకారం అత్యధిక పులుల జనాభా ఉన్న రాష్ట్రం ఏది?",
      options: [
        "మధ్యప్రదేశ్.",
        "కర్ణాటక.",
        "ఉత్తరాఖండ్.",
        "మహారాష్ట్ర."
      ],
      correctAnswerIndex: 0,
      explanation: "డేటా ప్రకారం 785 పులులతో మధ్యప్రదేశ్‌లో అత్యధిక పులులు ఉన్నాయి.",
    ),

    Question(
      questionText: "NHB ప్రకటించిన అర్బన్ ఇన్‌ఫ్రాస్ట్రక్చర్ డెవలప్‌మెంట్ ఫండ్ (UIDF) ప్రయోజనం ఏమిటి?",
      options: [
        "పట్టణ ప్రాంతాలలో పులుల సంరక్షణను సులభతరం చేయడానికి.",
        "టైగర్ రిజర్వ్స్ కోసం రక్షణ చర్యలను మెరుగుపరచడానికి.",
        "టైర్-2 మరియు టైర్-3 నగరాల్లో పట్టణ మౌలిక సదుపాయాల కల్పనకు మద్దతు ఇవ్వడానికి.",
        "స్థిరమైన బ్యాంకింగ్ పద్ధతులను ప్రోత్సహించడానికి."
      ],
      correctAnswerIndex: 2,
      explanation: "టైర్-2 మరియు టైర్-3 నగరాల్లో పట్టణ మౌలిక సదుపాయాల కల్పనను సులభతరం చేయడం UIDF లక్ష్యం.",
    ),

    Question(
      questionText: "CBDC మరియు UPI మధ్య పరస్పర చర్యను ప్రవేశపెట్టడంలో RBI యొక్క లక్ష్యం ఏమిటి?",
      options: [
        "పులుల సంరక్షణను ప్రోత్సహించడానికి.",
        "బ్యాంకుల కార్పొరేట్ నిర్మాణాన్ని సరళీకృతం చేయడానికి.",
        "CBDC లావాదేవీల కోసం UPI QR కోడ్‌ల వినియోగాన్ని సులభతరం చేయడానికి.",
        "డేటా నిర్వహణను మెరుగుపరచడానికి."
      ],
      correctAnswerIndex: 2,
      explanation: "డిజిటల్ కరెన్సీ లావాదేవీల కోసం UPI QR కోడ్‌ల వినియోగాన్ని అనుమతించడానికి CBDC మరియు UPI మధ్య పరస్పర చర్యను అమలు చేయడం RBI లక్ష్యం.",
    ),
    Question(
      questionText: "ఉత్తరాఖండ్‌లోని పంత్‌నగర్‌లోని పంత్‌నగర్ జనవాణికి, స్థానిక సంస్కృతిని ప్రోత్సహించే అవార్డులలో ఏ కార్యక్రమం మూడవ బహుమతిని పొందింది?",
      options: [
        "అస్మిత.",
        "చనిపోతున్న కళను పునరుద్ధరించింది: మాస్క్ & పాట్.",
        "దాడీ మా కా బటువా.",
        "బుక్ బగ్స్."
      ],
      correctAnswerIndex: 2,
      explanation: "పంత్‌నగర్ జనవాణి, పంత్‌నగర్, ఉత్తరాఖండ్, స్థానిక సంస్కృతిని ప్రోత్సహించే అవార్డులలో 'దాది మా కా బటువా' కార్యక్రమానికి మూడవ బహుమతిని గెలుచుకుంది.",
    ),


    Question(
      questionText: "IAS, IPS మరియు IFOS పెన్షనర్ల పదవీ విరమణ ప్రయోజనాలకు సంబంధించి సవరించిన నియమం ఏమిటి?",
      options: [
        "టైగర్ రిజర్వ్‌ల కోసం మెరుగైన రక్షణ చర్యలు.",
        "తీవ్రమైన దుష్ప్రవర్తన లేదా తీవ్రమైన నేరాలకు పెన్షన్‌ను నిలిపివేయడం లేదా ఉపసంహరించుకోవడం.",
        "మెటావర్స్‌లో వర్చువల్ శాఖను ప్రారంభించడం.",
        "CBDC లావాదేవీల కోసం UPI QR కోడ్‌ల వినియోగాన్ని ప్రచారం చేయడం."
      ],
      correctAnswerIndex: 1,
      explanation: "సవరించబడిన నియమాలు తీవ్రమైన దుష్ప్రవర్తన లేదా తీవ్రమైన నేరాల కోసం పెన్షన్‌ను నిలిపివేయడం లేదా ఉపసంహరించుకోవడంతో సహా పెన్షనర్‌లపై చర్య తీసుకునేందుకు కేంద్ర ప్రభుత్వానికి అధికారం కల్పిస్తాయి.",
    ),

    Question(
      questionText: "సవరించబడిన ఆల్ ఇండియా సర్వీసెస్ (డెత్-కమ్-రిటైర్మెంట్ బెనిఫిట్స్) రూల్స్, 1958, దేనిపై ఆధారపడటాన్ని తొలగిస్తుంది?",
      options: [
        "విశ్రాంత అధికారులపై చర్య కోసం రాష్ట్ర ప్రభుత్వ సూచనలు.",
        "కమ్యూనిటీ రేడియో స్టేషన్లకు లైసెన్సింగ్ సమయం.",
        "పులుల సంరక్షణ చర్యల కోసం కేంద్ర ప్రభుత్వ సూచనలు.",
        "మెటావర్స్‌లో వర్చువల్ శాఖలు."
      ],
      correctAnswerIndex: 0,
      explanation: "సవరించిన నియమాలు పదవీ విరమణ చేసిన అధికారులపై చర్య కోసం రాష్ట్ర ప్రభుత్వ సూచనలపై ఆధారపడటాన్ని తొలగిస్తాయి.",
    ),


    Question(
      questionText: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా చీఫ్ ఫైనాన్షియల్ ఆఫీసర్ (CFO)గా ఎవరు నియమితులయ్యారు?",
      options: [
        "అభిజిత్ చక్రవర్తి.",
        "కామేశ్వర్ రావు కొడవంటి.",
        "టి. రబీ శంకర్.",
        "అశ్విని కుమార్."
      ],
      correctAnswerIndex: 1,
      explanation: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా చీఫ్ ఫైనాన్షియల్ ఆఫీసర్ (CFO)గా కామేశ్వర్ రావు కొడవంటి నియమితులయ్యారు.",
    ),

    Question(
        questionText: "CBDC లావాదేవీల కోసం UPI QR కోడ్‌లను ప్రవేశపెట్టడం ద్వారా RBI ఏమి సాధించాలని లక్ష్యంగా పెట్టుకుంది?",
        options: [
          "పులుల సంరక్షణ కోసం డేటా నిర్వహణను మెరుగుపరచండి.",
          "డిజిటల్ కరెన్సీ లావాదేవీల కోసం UPI QR కోడ్‌ల వినియోగాన్ని ప్రోత్సహించండి.",
          "బ్యాంకుల కార్పొరేట్ నిర్మాణాన్ని సరళీకృతం చేయండి.",
          "టైర్-2 మరియు టైర్-3 నగరాల్లో పట్టణ మౌలిక సదుపాయాల కల్పనను సులభతరం చేయండి."
        ],
        correctAnswerIndex: 1,
        explanation: "CBDC మరియు UPI మధ్య పరస్పర చర్యను ప్రవేశపెట్టడం ద్వారా CBDC లావాదేవీల కోసం UPI QR కోడ్‌ల వినియోగాన్ని సులభతరం చేయడం RBI లక్ష్యం."
    ),
    Question(
      questionText: "HDFC బ్యాంక్ ఇటీవల ఏ మైలురాయిని సాధించింది?",
      options: [
        "\$100 బిలియన్ల మార్కెట్ క్యాప్ క్లబ్‌లోకి ప్రవేశించారు",
        "భారతదేశంలో 2వ అత్యంత విలువైన కంపెనీగా అవతరించింది",
        "CRISIL యొక్క కార్పొరేట్ బ్యాంకింగ్ ర్యాంకింగ్‌లో అగ్రస్థానాన్ని పొందింది",
        "Swiggyతో సహ-బ్రాండెడ్ క్రెడిట్ కార్డ్‌ని ప్రారంభించింది"
      ],
      correctAnswerIndex: 0,
      explanation: "HDFC బ్యాంక్ ఇటీవల \$100 బిలియన్ మార్కెట్ క్యాప్ క్లబ్‌లోకి ప్రవేశించింది.",
    ),
    Question(
      questionText: "2047 నాటికి భారతదేశం అభివృద్ధి చెందిన ఆర్థిక వ్యవస్థగా మారడానికి RBI నిర్దేశించిన GDP వృద్ధి లక్ష్యం ఏమిటి?",
      options: [
        "5.0%",
        "6.5%",
        "7.6%",
        "8.9%"
      ],
      correctAnswerIndex: 2,
      explanation: "2047 నాటికి భారతదేశం అభివృద్ధి చెందిన ఆర్థిక వ్యవస్థగా మారడానికి RBI GDP వృద్ధిని 7.6% లక్ష్యంగా పెట్టుకుంది.",
    ),
    Question(
      questionText: "యూరోపియన్ ఇన్వెస్ట్‌మెంట్ బ్యాంక్ (EIB) భారతదేశ పునరుత్పాదక ఇంధన రంగంలో పెట్టుబడి పెట్టేందుకు ఎంత నిధులు సమకూరుస్తోంది?",
      options: [
        "€200 మిలియన్",
        "€500 మిలియన్",
        "€1 బిలియన్",
        "€ 2 బిలియన్"
      ],
      correctAnswerIndex: 1,
      explanation: "EIB భారతదేశ పునరుత్పాదక ఇంధన రంగంలో సుమారు €500 మిలియన్లు పెట్టుబడి పెట్టాలని యోచిస్తోంది.",
    ),
    Question(
      questionText: "భారతదేశంలో సెంట్రల్ బ్యాంక్ డిజిటల్ కరెన్సీ (CBDC) పైలట్ కోసం ఏ బ్యాంకులు ప్రచారాన్ని పెంచుతున్నాయి?",
      options: [
        "SBI మరియు ICICI బ్యాంక్",
        "HDFC బ్యాంక్ మరియు యాక్సిస్ బ్యాంక్",
        "SBI మరియు HDFC బ్యాంక్",
        "ICICI బ్యాంక్ మరియు HDFC బ్యాంక్"
      ],
      correctAnswerIndex: 2,
      explanation: "భారతదేశంలో CBDC పైలట్ కోసం SBI మరియు HDFC బ్యాంక్ ప్రచారాన్ని వేగవంతం చేస్తున్నాయి.",
    ),
    Question(
      questionText: "విదేశీ ఇన్‌వర్డ్ రెమిటెన్స్ సర్టిఫికెట్‌లు (FIRC) మరియు ఎలక్ట్రానిక్ బ్యాంక్ రియలైజేషన్ సర్టిఫికెట్‌ల (e-BRCలు)కి సంబంధించి బ్యాంకుల కోసం RBI ప్రామాణిక ఆపరేటింగ్ విధానాన్ని (SOP) ప్రవేశపెట్టడం యొక్క ఉద్దేశ్యం ఏమిటి?",
      options: [
        "బ్యాంకుల పన్ను విధానాలను సులభతరం చేయడానికి",
        "ఎగుమతిదారులకు రూపాయి వ్యాపారాన్ని వేగవంతం చేయడానికి",
        "విదేశీ లావాదేవీల వడ్డీ రేట్లను నియంత్రించడానికి",
        "కస్టమర్ ఆన్‌బోర్డింగ్ ప్రక్రియలను మెరుగుపరచడానికి"
      ],
      correctAnswerIndex: 1,
      explanation: "విదేశీ వాణిజ్యం కోసం FIRC మరియు e-BRC జారీని వేగవంతం చేయడానికి SOP ప్రవేశపెట్టబడింది.",
    ),
    Question(
      questionText: "ఎందుకు AT-1 బాండ్ వార్తల్లో ఉంది?",
      options: [
        "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా AT-1 బాండ్లను విజయవంతంగా జారీ చేసింది",
        "రూ. 10,000 కోట్ల విలువైన AT-1 బాండ్లు ఓవర్‌సబ్‌స్క్రైబ్ చేయబడ్డాయి",
        "రూ. 10,000 కోట్ల విలువైన AT-1 బాండ్లకు పేలవమైన స్పందన వచ్చింది",
        "AT-1 బాండ్లను ఇటీవల HDFC బ్యాంక్ ప్రవేశపెట్టింది"
      ],
      correctAnswerIndex: 2,
      explanation: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా రూ. 10,000 కోట్ల విలువైన AT-1 బాండ్లను జారీ చేసింది, అయితే కేవలం రూ. 3,100 కోట్ల విలువైన సబ్‌స్క్రైబ్ చేయబడింది.",
    ),
    Question(
      questionText: "యునైటెడ్ ఇండియా కోఆపరేటివ్ బ్యాంక్ లిమిటెడ్ యొక్క రిజిస్ట్రేషన్ సర్టిఫికేట్ రద్దుకు దారితీసింది ఏమిటి?",
      options: [
        "తగినంత మూలధనం మరియు పేద సంపాదన అవకాశాలు",
        "ఆర్థిక మోసం మరియు దుష్ప్రవర్తన",
        "ప్రభుత్వ జోక్యం",
        "నియంత్రణ సమ్మతిని పాటించడంలో వైఫల్యం"
      ],
      correctAnswerIndex: 0,
      explanation: "తగిన మూలధనం మరియు పేద ఆదాయ అవకాశాలు కారణంగా రద్దు చేయబడింది.",
    ),
    Question(
      questionText: "NongHyup బ్యాంక్'కి సంబంధించి RBI ఏ ముఖ్యమైన చర్య తీసుకుంది?",
      options: [
        "దాని లైసెన్స్ రద్దు చేయబడింది",
        "ఇది RBI చట్టం, 1934 యొక్క రెండవ షెడ్యూల్‌కు జోడించబడింది",
        "నియంత్రణ ఉల్లంఘనలకు విధించిన జరిమానాలు",
        "మరొక బ్యాంకుతో దాని విలీనానికి ఆమోదం లభించింది"
      ],
      correctAnswerIndex: 1,
      explanation: "RBI చట్టం, 1934 యొక్క రెండవ షెడ్యూల్‌కు RBI 'NongHyup బ్యాంక్'ని జోడించింది.",
    ),
    Question(
      questionText: "వరుసగా ఐదవ సంవత్సరం ప్రభుత్వ యాజమాన్యంలోని కార్పొరేషన్‌లు మరియు PSUలకు రుణాలు ఇవ్వడంలో ప్రభుత్వ రంగ రుణదాతగా అగ్రస్థానంలో ఉన్న బ్యాంకు ఏది?",
      options: [
        "SBI",
        "ICICI బ్యాంక్",
        "కెనరా బ్యాంక్",
        "HDFC బ్యాంక్"
      ],
      correctAnswerIndex: 2,
      explanation: "వరుసగా ఐదవ సంవత్సరం ప్రభుత్వ యాజమాన్యంలోని కార్పొరేషన్‌లు మరియు PSUలకు రుణాలు ఇవ్వడంలో కెనరా బ్యాంక్ అగ్ర ప్రభుత్వ రంగ రుణదాతగా ఉంది.",
    ),

    Question(
      questionText: "2023-24 ఆర్థిక సంవత్సరానికి ప్రత్యక్ష పన్నుల మొత్తం బడ్జెట్ అంచనా ఎంత?",
      options: [
        "రూ. 1.5 లక్షల కోట్లు",
        "రూ. 2.1 లక్షల కోట్లు",
        "రూ. 5.0 లక్షల కోట్లు",
        "రూ. 18.23 లక్షల కోట్లు"
      ],
      correctAnswerIndex: 3,
      explanation: "2023-24 ఆర్థిక సంవత్సరానికి ప్రత్యక్ష పన్నుల మొత్తం బడ్జెట్ అంచనా రూ. 18.23 లక్షల కోట్లు.",
    ),
    Question(
      questionText: "ప్రస్తుత ఆర్థిక సంవత్సరానికి అంతర్జాతీయ ద్రవ్య నిధి (IMF) ద్వారా భారతదేశానికి సవరించబడిన GDP వృద్ధి అంచనా ఏమిటి?",
      options: [
        "5.5%",
        "6.1%",
        "7.0%",
        "8.2%"
      ],
      correctAnswerIndex: 1,
      explanation: "IMF ప్రస్తుత ఆర్థిక సంవత్సరానికి భారతదేశ GDP వృద్ధి అంచనాను 6.1%కి సవరించింది.",
    ),
    Question(
      questionText: "భారతదేశం యొక్క ఫారెక్స్ నిల్వల తాజా వాల్యుయేషన్ ఏమిటి?",
      options: [
        "\$580 బిలియన్",
        "\$600 బిలియన్",
        "\$620 బిలియన్",
        "\$650 బిలియన్"
      ],
      correctAnswerIndex: 1,
      explanation: "భారతదేశం యొక్క ఫారెక్స్ నిల్వలు \$600 బిలియన్ల మార్కును అధిగమించాయి.",
    ),
    Question(
      questionText: "గోల్డ్‌మన్ సాక్స్ ప్రకారం, భారతదేశం ఎప్పుడు ప్రపంచంలో రెండవ అతిపెద్ద ఆర్థిక వ్యవస్థగా అవతరించనుందని అంచనా వేయబడింది?",
      options: [
        "2030",
        "2040",
        "2055",
        "2075"
      ],
      correctAnswerIndex: 3,
      explanation: "2075 నాటికి భారతదేశం ప్రపంచంలో రెండవ అతిపెద్ద ఆర్థిక వ్యవస్థగా అవతరించనుందని గోల్డ్‌మ్యాన్ సాక్స్ అంచనా వేసింది.",
    ),
    Question(
      questionText: "మే 2023 చివరి నాటికి కేంద్ర ప్రభుత్వ ఆర్థిక లోటు ఎంత?",
      options: [
        "10.5%",
        "11.8%",
        "12.3%",
        "13.0%"
      ],
      correctAnswerIndex: 1,
      explanation: "మే 2023 చివరి నాటికి కేంద్ర ప్రభుత్వ ఆర్థిక లోటు 11.8%.",
    ),


    Question(
      questionText: "ప్రామాణిక చార్టర్డ్ రీసెర్చ్ ప్రకారం, 2030 నాటికి భారతదేశం యొక్క అంచనా వేసిన GDP ఎంత?",
      options: [
        "\$5 ట్రిలియన్",
        "\$6 ట్రిలియన్",
        "\$7 ట్రిలియన్",
        "\$8 ట్రిలియన్"
      ],
      correctAnswerIndex: 1,
      explanation: "2030 నాటికి భారతదేశ ఆర్థిక వ్యవస్థ \$6 ట్రిలియన్లకు చేరుతుందని స్టాండర్డ్ చార్టర్డ్ యొక్క భారతదేశ పరిశోధన బృందం అంచనా వేసింది.",
    ),

    Question(
      questionText: "SEBI ప్రవేశపెట్టిన కార్పొరేట్ డెట్ మార్కెట్ డెవలప్‌మెంట్ ఫండ్ (CDMDF) ప్రయోజనం ఏమిటి?",
      options: [
        "కార్పొరేట్ రుణగ్రహీతలకు రుణాలు అందించడానికి",
        "ఇన్వెస్ట్‌మెంట్-గ్రేడ్ కార్పొరేట్ డెట్ సెక్యూరిటీలను కొనుగోలు చేయడం ద్వారా ఒత్తిడికి గురైన మార్కెట్ పరిస్థితులలో మద్దతు ఇవ్వడానికి",
        "కార్పొరేట్ రుణ వడ్డీ రేట్లను నియంత్రించడానికి",
        "కార్పొరేట్ రుణాలలో విదేశీ ప్రత్యక్ష పెట్టుబడులను సులభతరం చేయడానికి"
      ],
      correctAnswerIndex: 1,
      explanation: "పెట్టుబడి-స్థాయి కార్పొరేట్ రుణ సెక్యూరిటీలను కొనుగోలు చేయడం ద్వారా ఒత్తిడికి గురైన మార్కెట్ పరిస్థితులలో మద్దతునిస్తూ, 'బ్యాక్‌స్టాప్ సౌకర్యం'గా పనిచేయడానికి SEBI CDMDFని ప్రవేశపెట్టింది.",
    ),

    Question(
      questionText: "భారతదేశం యొక్క మొదటి కార్బన్ మార్కెట్‌ను స్థాపించడానికి భారత ప్రభుత్వం ఏ ముఖ్యమైన చర్య తీసుకుంది?",
      options: [
        "కార్బన్ పన్నుల అమలు",
        "డ్రాఫ్టింగ్ ది కార్బన్ క్రెడిట్ ట్రేడింగ్ స్కీమ్, 2023",
        "కార్బన్ ట్రేడింగ్ ఎక్స్ఛేంజ్ ఏర్పాటు",
        "కార్బన్ ఉద్గార తగ్గింపు లక్ష్యాలను పరిచయం చేస్తోంది"
      ],
      correctAnswerIndex: 1,
      explanation: "భారత ప్రభుత్వం కార్బన్ క్రెడిట్ ట్రేడింగ్ స్కీమ్, 2023 కోసం ముసాయిదా ఫ్రేమ్‌వర్క్‌ను నోటిఫై చేసింది, భారతదేశం యొక్క మొదటి కార్బన్ మార్కెట్‌ను స్థాపించే దిశగా ఒక ముఖ్యమైన అడుగు వేస్తోంది.",
    ),

    Question(
      questionText: "WTO-వరల్డ్ బ్యాంక్ నివేదిక ప్రకారం, 2005 నుండి 2022 వరకు ప్రపంచ వాణిజ్య సేవల ఎగుమతుల్లో భారతదేశం వాటా ఎంత పెరిగింది?",
      options: [
        "1.5%",
        "2.5%",
        "3.5%",
        "4.4%"
      ],
      correctAnswerIndex: 3,
      explanation: "ప్రపంచ బ్యాంకు మరియు WTO నివేదిక ప్రకారం, ప్రపంచ వాణిజ్య సేవల ఎగుమతుల్లో భారతదేశం వాటా 2005లో 2% నుండి 2022లో 4.4%కి రెట్టింపు అయింది.",
    ),

    Question(
      questionText: "ఏ PSU భారతదేశంలో లంచం వ్యతిరేక నిర్వహణ వ్యవస్థ ధృవీకరణను సాధించిన మొదటి స్థానంలో నిలిచింది?",
      options: [
        "ఇండియన్ ఆయిల్ కార్పొరేషన్",
        "భారత్ హెవీ ఎలక్ట్రికల్స్ లిమిటెడ్",
        "చమురు మరియు సహజ వాయువు కార్పొరేషన్ (ONGC)",
        "కోల్ ఇండియా లిమిటెడ్"
      ],
      correctAnswerIndex: 2,
      explanation: "ONGC దాని లంచ వ్యతిరేక నిర్వహణ వ్యవస్థ (ABMS) కోసం ధృవీకరణ పొందిన భారతదేశంలో మొదటి కేంద్ర ప్రభుత్వ రంగ సంస్థ (CPSE) అయింది.",
    ),

    Question(
      questionText: "భారతదేశంలో MSME ఫార్మా సంస్థలకు షెడ్యూల్ M యొక్క ప్రాముఖ్యత ఏమిటి?",
      options: [
        "MSMEలకు పన్ను ప్రోత్సాహకాలు",
        "నాణ్యత హామీ మార్గదర్శకాలు",
        "MSMEల కోసం కార్మిక ప్రమాణాలు",
        "MSMEల కోసం పర్యావరణ సమ్మతి"
      ],
      correctAnswerIndex: 1,
      explanation: "MSME రంగంలోని భారతదేశపు చిన్న ఔషధ తయారీదారులు డ్రగ్స్ అండ్ కాస్మెటిక్స్ చట్టం యొక్క షెడ్యూల్ Mలో వివరించిన మంచి తయారీ పద్ధతులకు త్వరలో కట్టుబడి ఉండవలసి ఉంటుంది.",
    ),


    Question(
      questionText: "ఏ ఫిన్‌టెక్ దిగ్గజం మలేషియాలో తన మొదటి అంతర్జాతీయ చెల్లింపు గేట్‌వేని ప్రారంభించింది?",
      options: [
        "Paytm",
        "ఫోన్‌పే",
        "రేజర్పే",
        "Google Pay"
      ],
      correctAnswerIndex: 2,
      explanation: "Razorpay, భారతదేశపు ప్రముఖ ఫిన్‌టెక్ దిగ్గజం, మలేషియాలో తన మొదటి అంతర్జాతీయ చెల్లింపు గేట్‌వేని ప్రారంభించింది.",
    ),
    Question(
      questionText: "గ్రూప్ బ్యాంక్‌కి \$1.5 బిలియన్ల విరాళాన్ని అందజేస్తూ బ్రిక్స్ గ్రూపులో చేరడానికి ఏ దేశం దరఖాస్తు చేసింది?",
      options: [
        "సౌదీ అరేబియా",
        "అల్జీరియా",
        "నైజీరియా",
        "దక్షిణ ఆఫ్రికా"
      ],
      correctAnswerIndex: 1,
      explanation: "అల్జీరియా అధికారికంగా బ్రిక్స్ దేశాల సమూహంలో చేరడానికి ఒక దరఖాస్తును సమర్పించింది, గ్రూప్ బ్యాంక్‌కు \$1.5 బిలియన్ల విరాళాన్ని అందజేస్తుంది.",
    ),

    Question(
      questionText: "మ్యూచువల్ ఫండ్ మార్కెట్‌లో జియో ఫైనాన్షియల్ సర్వీసెస్ లిమిటెడ్ మరియు బ్లాక్‌రాక్ మధ్య జాయింట్ వెంచర్ పేరు ఏమిటి?",
      options: [
        "జియో మ్యూచువల్ వెంచర్స్",
        "బ్లాక్‌రాక్ ఇండియా వెంచర్స్",
        "జియో బ్లాక్‌రాక్",
        "ఫైనాన్షియల్ ఇన్నోవేషన్స్ అలయన్స్"
      ],
      correctAnswerIndex: 2,
      explanation: "జియో ఫైనాన్షియల్ సర్వీసెస్ లిమిటెడ్ మరియు బ్లాక్‌రాక్‌లు భారతదేశ మ్యూచువల్ ఫండ్ మార్కెట్‌లో విప్లవాత్మక మార్పులు తీసుకురావడానికి 'జియో బ్లాక్‌రాక్' అనే జాయింట్ వెంచర్‌ను రూపొందించడానికి దళాలు చేరాయి.",
    ),

    Question(
      questionText: "అమెజాన్ ఇండియా తన మొట్టమొదటి ఫ్లోటింగ్ స్టోర్‌ను ఎక్కడ ప్రారంభించింది?",
      options: [
        "గంగా నది",
        "యమునా నది",
        "దాల్ లేక్",
        "బ్రహ్మపుత్ర నది"
      ],
      correctAnswerIndex: 2,
      explanation: "అమెజాన్ ఇండియా కాశ్మీర్‌లోని శ్రీనగర్‌లోని దాల్ సరస్సులో తన మొట్టమొదటి ఫ్లోటింగ్ స్టోర్‌ను ప్రారంభించింది.",
    ),

    Question(
      questionText: "పండ్లు మరియు కూరగాయల కొనుగోళ్లకు సూపర్ మార్కెట్లలో ఉపయోగించే పలుచని ప్లాస్టిక్ సంచులపై పూర్తి నిషేధాన్ని అమలు చేసిన మొదటి దేశం ఏది?",
      options: [
        "ఆస్ట్రేలియా",
        "కెనడా",
        "న్యూజిలాండ్",
        "యునైటెడ్ కింగ్‌డమ్"
      ],
      correctAnswerIndex: 2,
      explanation: "పండ్లు మరియు కూరగాయల కొనుగోళ్ల కోసం సూపర్ మార్కెట్లలో ఉపయోగించే సన్నని ప్లాస్టిక్ సంచులపై పూర్తి నిషేధాన్ని అమలు చేసిన మొదటి దేశంగా న్యూజిలాండ్ అవతరించింది.",
    ),

    Question(
      questionText: "షాంఘై కోఆపరేషన్ ఆర్గనైజేషన్ (SCO)లో అధికారికంగా ఏ దేశం పూర్తి సభ్యత్వం పొందింది?",
      options: [
        "ఇరాన్",
        "టర్కీ",
        "ఇరాక్",
        "ఈజిప్ట్"
      ],
      correctAnswerIndex: 0,
      explanation: "ఇరాన్ అధికారికంగా షాంఘై సహకార సంస్థ (SCO)లో పూర్తి సభ్యదేశంగా మారింది.",
    ),


    Question(
      questionText: "భారతదేశంలో గ్రీన్ హైడ్రోజన్ మరియు పునరుత్పాదక ఇంధన ప్రాజెక్టుల కోసం 1 బిలియన్ యూరోలను విస్తరించడానికి ఏ అంతర్జాతీయ ఆర్థిక సంస్థ ఆసక్తిగా ఉంది?",
      options: [
        "అంతర్జాతీయ ద్రవ్య నిధి (IMF)",
        "ప్రపంచ బ్యాంకు",
        "ఆసియన్ డెవలప్‌మెంట్ బ్యాంక్ (ADB)",
        "యూరోపియన్ ఇన్వెస్ట్‌మెంట్ బ్యాంక్ (EIB)"
      ],
      correctAnswerIndex: 3,
      explanation: "యూరోపియన్ ఇన్వెస్ట్‌మెంట్ బ్యాంక్ (EIB) భారతదేశంలో గ్రీన్ హైడ్రోజన్ మరియు పునరుత్పాదక ఇంధన ప్రాజెక్టుల కోసం 1 బిలియన్ యూరోలను విస్తరించడానికి ఆసక్తిగా ఉంది.",
    ),

    Question(
      questionText: "ASEAN యొక్క అమిటీ అండ్ కోఆపరేషన్ (TAC) ఒప్పందంపై సంతకం చేసిన 51వ దేశం ఏది?",
      options: [
        "ఖతార్",
        "యుఎఇ",
        "ఒమన్",
        "బహ్రెయిన్"
      ],
      correctAnswerIndex: 1,
      explanation: "ASEAN యొక్క అమిటీ అండ్ కోఆపరేషన్ (TAC) ఒప్పందంపై సంతకం చేసిన 51వ దేశంగా సౌదీ అరేబియా అవతరించింది.",
    ),

    Question(
      questionText: "చైనీస్ కంపెనీ ప్రయోగించిన ప్రపంచంలోని మొట్టమొదటి మీథేన్-ఇంధన అంతరిక్ష రాకెట్ పేరు ఏమిటి?",
      options: [
        "లాంగ్ మార్చి 5",
        "ఫాల్కన్ 9",
        "జుక్-2",
        "సోయుజ్"
      ],
      correctAnswerIndex: 2,
      explanation: "ఒక ప్రైవేట్ చైనీస్ కంపెనీ 'జుక్-2' పేరుతో ప్రపంచంలోని మొట్టమొదటి మీథేన్-ఇంధన అంతరిక్ష రాకెట్‌ను ప్రయోగించింది.",
    ),

    Question(
      questionText: "పెరూ జాతీయ అత్యవసర పరిస్థితిని ప్రకటించడానికి నాడీ సంబంధిత పరిస్థితి ఏమిటి?",
      options: [
        "పార్కిన్సన్స్ వ్యాధి",
        "గ్విలియన్-బారే సిండ్రోమ్ (GBS)",
        "అల్జీమర్స్ వ్యాధి",
        "మల్టిపుల్ స్క్లేరోసిస్"
      ],
      correctAnswerIndex: 1,
      explanation: "గులియన్-బారే సిండ్రోమ్ (GBS)తో బాధపడుతున్న రోగులలో పెరుగుదల మధ్య పెరూ జాతీయ అత్యవసర పరిస్థితిని ప్రకటించింది.",
    ),
    Question(
      questionText: "జూలై 13న బ్యాంక్ ఆఫ్ ఇజ్రాయెల్ కోసం ప్రపంచ బ్యాంక్ ఏ అధికారిక ఆమోదాన్ని జారీ చేసింది?",
      options: [
        "ఇంటర్నేషనల్ కమిటీ ఆన్ క్రెడిట్ రిపోర్టింగ్ (ICCR)లో సభ్యత్వం.",
        "పాఠశాలల్లో స్మార్ట్‌ఫోన్ నిషేధంపై యునెస్కో చొరవలో భాగస్వామ్యం.",
        "పాలక కంబోడియన్ పీపుల్స్ పార్టీలో నాయకత్వ పాత్రలు.",
        "అంటార్కిటికాలో సముద్రపు మంచు తక్కువ స్థాయిలో నమోదైంది."
      ],
      correctAnswerIndex: 0,
      explanation: "ఇంటర్నేషనల్ కమిటీ ఆన్ క్రెడిట్ రిపోర్టింగ్ (ICCR)లో చేరడానికి బ్యాంక్ ఆఫ్ ఇజ్రాయెల్ కోసం ప్రపంచ బ్యాంక్ అధికారిక ఆమోదం జారీ చేసింది.",
    ),



    Question(
      questionText: "అంటార్కిటికా సముద్రపు మంచు ఎంతగా నమోదైంది మరియు అది సాధారణ స్థాయికి ఎలా పోలుస్తుంది?",
      options: [
        "సాధారణ పరిధి కంటే 16.7 మిలియన్ చ. కి.మీ వద్ద నమోదైంది.",
        "14.2 మిలియన్ చ. కి.మీ వద్ద నమోదు చేయబడింది, ఇది సాధారణ పరిధి కంటే చాలా తక్కువగా ఉంది.",
        "18 మిలియన్ చ. కి.మీ. వద్ద రికార్డ్ చేయబడింది, ఇది ఎప్పటికైనా అత్యధికం.",
        "15.5 మిలియన్ చ. కి.మీ. వద్ద నమోదు చేయబడింది, సాధారణ పరిధికి దగ్గరగా ఉంది."
      ],
      correctAnswerIndex: 1,
      explanation: "అంటార్కిటికా సముద్రపు మంచు దాదాపు 14.2 మిలియన్ చ.కి.మీ కంటే తక్కువ స్థాయిలో నమోదైంది, ఇది సాధారణమైన 16.7 మిలియన్ చ.కి.మీ కంటే చాలా తక్కువగా ఉంది.",
    ),


    Question(
      questionText: "ఇంటర్ గవర్నమెంటల్ ప్యానెల్ ఆన్ క్లైమేట్ చేంజ్ (IPCC) యొక్క కొత్త చైర్‌గా ఎవరు ఎన్నికయ్యారు?",
      options: [
        "తెల్మా క్రుగ్ ఆఫ్ బ్రెజిల్.",
        "జేమ్స్ ఫెర్గూసన్ 'జిమ్' స్కీయా ఆఫ్ యునైటెడ్ కింగ్‌డమ్.",
        "బ్రెజిల్ జాతీయ అంతరిక్ష సంస్థలో మాజీ పరిశోధకుడు.",
        "IPCC యొక్క మొదటి మహిళా అధ్యక్షురాలు."
      ],
      correctAnswerIndex: 1,
      explanation: "యునైటెడ్ కింగ్‌డమ్‌కు చెందిన జేమ్స్ ఫెర్గూసన్ 'జిమ్' స్కీ IPCC యొక్క కొత్త చైర్‌గా ఎన్నికయ్యారు.",
    ),

    Question(
      questionText: "భారత అణుశక్తి రంగంలో ఏ ముఖ్యమైన మైలురాయిని సాధించింది?",
      options: [
        "దేశీయంగా అభివృద్ధి చేసిన మొదటి అణు రియాక్టర్ పూర్తి.",
        "డిజిటల్ వ్యక్తిగత డేటా బిల్లు ఆమోదం.",
        "సాయి హీరా గ్లోబల్ కన్వెన్షన్ సెంటర్ ప్రారంభోత్సవం.",
        "కక్రాపర్ అటామిక్ పవర్ ప్రాజెక్ట్ (KAPP) రియాక్టర్ వద్ద వాణిజ్య కార్యకలాపాల ప్రారంభం."
      ],
      correctAnswerIndex: 3,
      explanation: "గుజరాత్‌లోని కక్రాపర్ అటామిక్ పవర్ ప్రాజెక్ట్ (KAPP) వద్ద భారతదేశం యొక్క మొట్టమొదటి దేశీయంగా అభివృద్ధి చేసిన 700 MW న్యూక్లియర్ పవర్ రియాక్టర్ విజయవంతంగా వాణిజ్య కార్యకలాపాలను ప్రారంభించింది.",
    ),

    Question(
      questionText: "ప్రధానమంత్రి నరేంద్ర మోడీ వర్చువల్‌గా ఆంధ్రప్రదేశ్‌లో ఏ గ్లోబల్ ఈవెంట్‌ను ప్రారంభించారు?",
      options: [
        "ది ఇంటర్నేషనల్ కమిటీ ఆన్ క్రెడిట్ రిపోర్టింగ్ (ICCR) సమ్మిట్.",
        "ది ఇంటర్నేషనల్ ఎగ్జిబిషన్-కమ్-కన్వెన్షన్ సెంటర్ (IECC).",
        "ది స్టార్టప్20 శిఖర్ సమ్మిట్.",
        "ది సాయి హిరా గ్లోబల్ కన్వెన్షన్ సెంటర్."
      ],
      correctAnswerIndex: 3,
      explanation: "ఆంధ్రప్రదేశ్‌లోని పుట్టపర్తిలో సాయి హీరా గ్లోబల్ కన్వెన్షన్ సెంటర్‌ను ప్రధాని నరేంద్ర మోదీ వాస్తవంగా ప్రారంభించారు.",
    ),

    Question(
      questionText: "ఇండియా G20 ప్రెసిడెన్సీ నిర్వహించిన స్టార్టప్20 శిఖర్ సమ్మిట్‌లో దేనిపై దృష్టి పెట్టారు?",
      options: [
        "సాంస్కృతిక మార్పిడి మరియు ప్రపంచ సామరస్యం.",
        "ఇన్నోవేషన్, సహకారాలు మరియు విజ్ఞాన భాగస్వామ్యం.",
        "స్వదేశీ అణుశక్తిని ప్రోత్సహించడం.",
        "ఛాంపియన్స్ గ్రూప్ ఏర్పాటు."
      ],
      correctAnswerIndex: 1,
      explanation: "స్టార్టప్20 శిఖర్ సమ్మిట్ గ్లోబల్ స్టార్టప్ ఎకోసిస్టమ్‌లో ఆవిష్కరణలు, సహకారాలు, జ్ఞానాన్ని పంచుకోవడం మరియు వ్యూహాత్మక పొత్తులను పెంపొందించడానికి ఒక వేదికగా పనిచేసింది.",
    ),

    Question(
      questionText: "వ్యక్తిగత డేటా రక్షణకు సంబంధించి కేంద్ర ప్రభుత్వం ఏ ముఖ్యమైన చర్య తీసుకుంది?",
      options: [
        "CRCS - సహారా రీఫండ్ పోర్టల్‌ను ప్రారంభించింది.",
        "గ్లోబల్ క్రైసిస్ రెస్పాన్స్ గ్రూప్ యొక్క ఛాంపియన్స్ గ్రూప్‌లో చేరారు.",
        "డిజిటల్ వ్యక్తిగత డేటా బిల్లు ఆమోదించబడింది.",
        "టెక్నో-కమర్షియల్ రెడీనెస్ అండ్ మార్కెట్ మెచ్యూరిటీ మ్యాట్రిక్స్ (TCRM మ్యాట్రిక్స్) ఫ్రేమ్‌వర్క్‌ను ప్రారంభించింది."
      ],
      correctAnswerIndex: 2,
      explanation: "కేంద్ర ప్రభుత్వం ముసాయిదా డిజిటల్ పర్సనల్ డేటా బిల్లును ఆమోదించింది, ఇది వర్షాకాలంలో పార్లమెంటు ముందుకు రానుంది.",
    ),
    Question(
      questionText: "స్వాతంత్ర్య దినోత్సవం సందర్భంగా ప్రధాన మంత్రి నరేంద్ర మోడీ ఏ ప్రచారాన్ని ప్రకటించారు?",
      options: [
        "మేరీ మతి మేరా దేశ్",
        "జగనన్న అమ్మ వొడి",
        "ULLAS మొబైల్ అప్లికేషన్",
        "అంత్యోదయ శ్రమిక్ సురక్ష యోజన"
      ],
      correctAnswerIndex: 0,
      explanation: "స్వాతంత్ర్య దినోత్సవం సందర్భంగా 'మేరీ మతి మేరా దేశ్' ప్రచారాన్ని ప్రధాని నరేంద్ర మోదీ ప్రకటించారు.",
    ),

    Question(
      questionText: "అఖిల భారతీయ శిక్షా సమాగం 2023లో ప్రారంభించబడిన ఉల్లాస్: నవ భారత్ సాక్షరత కార్యక్రమ లక్ష్యం ఏమిటి?",
      options: [
        "ప్రాథమిక అక్షరాస్యతను ప్రోత్సహించండి",
        "విద్య మరియు అక్షరాస్యతను విప్లవాత్మకంగా మార్చండి",
        "వృత్తి శిక్షణను మెరుగుపరచండి",
        "NEP 2020ని అమలు చేయండి"
      ],
      correctAnswerIndex: 1,
      explanation: "ఉల్లాస్ సమగ్ర అభ్యాస పర్యావరణ వ్యవస్థను సృష్టించడం ద్వారా భారతదేశంలో విద్య మరియు అక్షరాస్యతను విప్లవాత్మకంగా మార్చాలని లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "కేంద్ర మంత్రి భూపేందర్ యాదవ్ చెన్నైలో ఏ కూటమిని ప్రారంభించారు?",
      options: [
        "పోలీస్ డ్రోన్ యూనిట్",
        "రిసోర్స్ ఎఫిషియెన్సీ సర్క్యులర్ ఎకానమీ ఇండస్ట్రీ కూటమి (RECEIC)",
        "జగనన్న అమ్మ ఒడి పథకం",
        "మేరీ మతి మేరా దేశ్ ప్రచారం"
      ],
      correctAnswerIndex: 1,
      explanation: "కేంద్ర మంత్రి భూపేందర్ యాదవ్ చెన్నైలో రిసోర్స్ ఎఫిషియెన్సీ సర్క్యులర్ ఎకానమీ ఇండస్ట్రీ కూటమి (RECEIC)ని ప్రారంభించారు.",
    ),



    Question(
      questionText: "భారతదేశంలో ఎలక్ట్రానిక్ ఎగుమతులలో ఏ రాష్ట్రం తిరిగి అగ్రస్థానాన్ని పొందింది?",
      options: [
        "మహారాష్ట్ర",
        "కర్ణాటక",
        "తమిళనాడు",
        "ఆంధ్రప్రదేశ్"
      ],
      correctAnswerIndex: 2,
      explanation: "భారతదేశంలో ఎలక్ట్రానిక్ ఎగుమతులలో తమిళనాడు అగ్రగామిగా తన స్థానాన్ని తిరిగి పొందింది.",
    ),

    Question(
      questionText: "చెన్నైలో ప్రారంభించిన 'పోలీస్ డ్రోన్ యూనిట్' లక్ష్యం ఏమిటి?",
      options: [
        "ట్రాఫిక్ నిర్వహణ",
        "వైమానిక నిఘా మరియు నేర గుర్తింపు",
        "వాతావరణ పర్యవేక్షణ",
        "విపత్తు ఉపశమనం"
      ],
      correctAnswerIndex: 1,
      explanation: "చెన్నైలోని 'పోలీస్ డ్రోన్ యూనిట్' వైమానిక నిఘా మరియు నేర కార్యకలాపాలను త్వరగా గుర్తించడం కోసం ప్రారంభించబడింది.",
    ),

    Question(
      questionText: "సూక్ష్మ రుణాలు ఇవ్వడంలో తమిళనాడును ఏ రాష్ట్రం అధిగమించింది?",
      options: [
        "కర్ణాటక",
        "ఆంధ్రప్రదేశ్",
        "బీహార్",
        "మహారాష్ట్ర"
      ],
      correctAnswerIndex: 2,
      explanation: "బిహార్ తమిళనాడును అధిగమించి అత్యధిక సూక్ష్మ రుణాలు తీసుకునే రాష్ట్రంగా అవతరించింది.",
    ),

    Question(
      questionText: "ఎక్స్‌టెండెడ్ ప్రొడ్యూసర్స్ రెస్పాన్సిబిలిటీ (EPR) క్రెడిట్‌ను పొందిన మొదటి పట్టణ సంస్థగా మధ్యప్రదేశ్‌లోని ఏ మున్సిపల్ కార్పొరేషన్ అవతరించింది?",
      options: [
        "ముంబయి మున్సిపల్ కార్పొరేషన్",
        "ఢిల్లీ మున్సిపల్ కార్పొరేషన్",
        "భోపాల్ మున్సిపల్ కార్పొరేషన్",
        "ఇండోర్ మున్సిపల్ కార్పొరేషన్"
      ],
      correctAnswerIndex: 3,
      explanation: "ఇండోర్ మునిసిపల్ కార్పొరేషన్ నిషేధించబడిన సింగిల్ యూజ్ ప్లాస్టిక్ వస్తువులను రీసైక్లింగ్ చేయడానికి ఎక్స్‌టెండెడ్ ప్రొడ్యూసర్స్ రెస్పాన్సిబిలిటీ (EPR) క్రెడిట్‌ని పొందిన మొదటి పట్టణ సంస్థగా అవతరించింది.",
    ),

    Question(
      questionText: "మహారాష్ట్ర మరియు కర్ణాటకలో టమోటా పంటలను ఏ వైరస్‌లు ప్రభావితం చేశాయి?",
      options: [
        "CMV మరియు ToMV",
        "H1N1 మరియు Zika",
        "ఎబోలా మరియు డెంగ్యూ",
        "SARS-CoV-2 మరియు ఇన్ఫ్లుఎంజా"
      ],
      correctAnswerIndex: 0,
      explanation: "మహారాష్ట్రలో టమోటా పంటలు దోసకాయ మొజాయిక్ వైరస్ (CMV) ద్వారా ప్రభావితమయ్యాయి, అయితే కర్ణాటకలో టమోటా మొజాయిక్ వైరస్ (ToMV) ప్రభావితమైంది.",
    ),


    Question(
      questionText: "విద్యను ప్రోత్సహించడానికి ముఖ్యమంత్రి వైఎస్ జగన్ మోహన్ రెడ్డి ఆంధ్రప్రదేశ్‌లో ఏ పథకాన్ని అమలు చేశారు?",
      options: [
        "అంత్యోదయ శ్రమిక్ సురక్ష యోజన",
        "ముఖ్య మంత్రి ఖేత్ సురక్ష యోజన",
        "జగనన్న అమ్మ ఒడి పథకం",
        "మిషన్ శక్తి స్కూటర్ యోజన"
      ],
      correctAnswerIndex: 2,
      explanation: "విద్యను ప్రోత్సహించేందుకు ముఖ్యమంత్రి వైఎస్ జగన్ మోహన్ రెడ్డి ఆంధ్రప్రదేశ్‌లో 'జగనన్న అమ్మ ఒడి' పథకాన్ని అమలు చేశారు.",
    ),

    Question(
      questionText: "భారతదేశం యొక్క మొదటి 'పోలీస్ డ్రోన్ యూనిట్' ఎక్కడ ప్రారంభించబడింది?",
      options: [
        "ఢిల్లీ",
        "ముంబయి",
        "చెన్నై",
        "కోల్‌కతా"
      ],
      correctAnswerIndex: 2,
      explanation: "భారతదేశం యొక్క మొట్టమొదటి 'పోలీస్ డ్రోన్ యూనిట్' వైమానిక నిఘా మరియు నేరాల గుర్తింపు కోసం చెన్నైలో ప్రారంభించబడింది.",
    ),

    Question(
      questionText: "ఎలక్ట్రానిక్ ఎగుమతుల్లో తమిళనాడును ఏ రాష్ట్రం అధిగమించింది?",
      options: [
        "కర్ణాటక",
        "మహారాష్ట్ర",
        "ఆంధ్రప్రదేశ్",
        "తెలంగాణ"
      ],
      correctAnswerIndex: 2,
      explanation: "ఎలక్ట్రానిక్ ఎగుమతుల్లో తమిళనాడును ఆంధ్రప్రదేశ్ అధిగమించింది.",
    ),

    Question(
      questionText: "మానవ-ఏనుగుల సంఘర్షణను పరిష్కరించడానికి అస్సాంలో ఏ ప్రాజెక్ట్ ప్రారంభించబడింది?",
      options: [
        "ప్రాజెక్ట్ గజా కోతా",
        "ప్రాజెక్ట్ గంగా కళ్యాణ్",
        "ప్రాజెక్ట్ రైనో షీల్డ్",
        "ప్రాజెక్ట్ టైగర్ రిసర్జెన్స్"
      ],
      correctAnswerIndex: 0,
      explanation: "మానవ-ఏనుగుల సంఘర్షణను పరిష్కరించడానికి అస్సాం 'ప్రాజెక్ట్ గజా కోతా'ను ప్రారంభించింది.",
    ),

    Question(
      questionText: "మహారాష్ట్రలోని ఏ నగరంలో PM మెగా ఇంటిగ్రేటెడ్ టెక్స్‌టైల్ రీజియన్స్ మరియు అపెరల్ పార్క్ (PM MITRA పార్క్) ఉంటుంది?",
      options: [
        "ముంబయి",
        "పూణే",
        "నాగ్‌పూర్",
        "అమరావతి"
      ],
      correctAnswerIndex: 3,
      explanation: "PM మెగా ఇంటిగ్రేటెడ్ టెక్స్‌టైల్ రీజియన్స్ మరియు అపెరల్ పార్క్ (PM MITRA పార్క్) మహారాష్ట్రలోని అమరావతిలో ఉంటుంది.",
    ),

    Question(
      questionText: "ఉత్తరప్రదేశ్ ప్రభుత్వం ఏ నదిని 'శాశ్వత నది'గా ప్రకటించింది?",
      options: [
        "యమునా",
        "గంగా",
        "సరస్వతి",
        "గోమతి"
      ],
      correctAnswerIndex: 3,
      explanation: "గోమతి నదిని ఉత్తరప్రదేశ్ ప్రభుత్వం 'శాశ్వత నది'గా ప్రకటించింది.",
    ),

    Question(
      questionText: "మిషన్ శక్తి స్కూటర్ యోజన కింద ఒడిశా రాష్ట్ర మంత్రివర్గం ఏమి ఆమోదించింది?",
      options: [
        "గృహ రుణాలపై వడ్డీ రాయితీ",
        "వ్యవసాయ రుణాలపై వడ్డీ రాయితీ",
        "స్కూటర్ల కోసం బ్యాంకు రుణాలపై వడ్డీ రాయితీ",
        "విద్యా రుణాలపై వడ్డీ రాయితీ"
      ],
      correctAnswerIndex: 2,
      explanation: "మిషన్ శక్తి స్కూటర్ యోజన కింద స్కూటర్ల కోసం బ్యాంకు రుణాలపై వడ్డీ రాయితీని ఒడిశా రాష్ట్ర మంత్రివర్గం ఆమోదించింది.",
    ),

    Question(
      questionText: "భారత చరిత్రలో ఎక్కువ కాలం పనిచేసిన రెండవ ముఖ్యమంత్రి ఎవరు?",
      options: [
        "భూపేందర్ పటేల్",
        "నవీన్ పట్నాయక్",
        "యోగి ఆదిత్యనాథ్",
        "జ్యోతి బసు"
      ],
      correctAnswerIndex: 1,
      explanation: "ఒడిశాకు చెందిన నవీన్ పట్నాయక్ భారతదేశ చరిత్రలో ఎక్కువ కాలం పనిచేసిన రెండవ ముఖ్యమంత్రి.",
    ),

    Question(
      questionText: "ఉత్తరప్రదేశ్‌లోని ముఖ్య మంత్రి ఖేత్ సురక్ష యోజన లక్ష్యం ఏమిటి?",
      options: [
        "విద్యను ప్రోత్సహించడం",
        "ఆరోగ్య సంరక్షణను మెరుగుపరచడం",
        "రైతులకు సామాజిక భద్రతకు భరోసా",
        "ఏనుగు-మానవుల సంఘర్షణకు పరిష్కారం"
      ],
      correctAnswerIndex: 2,
      explanation: "ఉత్తరప్రదేశ్‌లోని ముఖ్య మంత్రి ఖేత్ సురక్ష యోజన రైతులకు సామాజిక భద్రత కల్పించడం లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "వరల్డ్ సిటీస్ కల్చర్ ఫోరమ్‌లో భారతదేశంలోని ఏ నగరం మొదటిగా చేరింది?",
      options: [
        "ఢిల్లీ",
        "ముంబయి",
        "బెంగళూరు",
        "చెన్నై"
      ],
      correctAnswerIndex: 2,
      explanation: "వరల్డ్ సిటీస్ కల్చర్ ఫోరమ్‌లో చేరిన మొదటి భారతీయ నగరంగా బెంగళూరు నిలిచింది.",
    ),
    Question(
      questionText: "మిషన్ వాత్సల్య పథకం యొక్క లక్ష్యం ఏమిటి?",
      options: [
        "అత్యాచారానికి గురైన మైనర్ బాలికల కుటుంబాలకు ఉపశమనం కలిగించడం",
        "వెనుకబడిన తరగతులకు చెందిన మహిళా పారిశ్రామికవేత్తలకు సాధికారత కల్పించడం",
        "రాష్ట్రాలలో అగ్నిమాపక సేవలను ఆధునీకరించడానికి",
        "గిరిజన జనాభాలో సికిల్ సెల్ అనీమియాను తొలగించడానికి"
      ],
      correctAnswerIndex: 0,
      explanation: "అత్యాచారానికి గురైన మైనర్ బాలికల కుటుంబాలకు ఉపశమనం కలిగించడమే 'మిషన్ వాత్సల్య' లక్ష్యం.",
    ),

    Question(
      questionText: "స్వర్ణిమ పథకాన్ని ఏ మంత్రిత్వ శాఖ ప్రవేశపెట్టింది?",
      options: [
        "సామాజిక న్యాయం మరియు సాధికారత మంత్రిత్వ శాఖ",
        "హోం వ్యవహారాల మంత్రిత్వ శాఖ",
        "వ్యవసాయం మరియు రైతు సంక్షేమ మంత్రిత్వ శాఖ",
        "మినిస్ట్రీ ఆఫ్ కామర్స్ & ఇండస్ట్రీ"
      ],
      correctAnswerIndex: 0,
      explanation: "స్వర్ణిమ పథకం సామాజిక న్యాయం మరియు సాధికారత మంత్రిత్వ శాఖ ద్వారా ప్రవేశపెట్టబడింది.",
    ),

    Question(
      questionText: "రాష్ట్రాల్లో అగ్నిమాపక సేవల విస్తరణ మరియు ఆధునీకరణ పథకం' కోసం కేటాయించిన మొత్తం ఎంత?",
      options: [
        "రూ. 5,000 కోట్లు",
        "రూ. 2,00,000/-",
        "సంవత్సరానికి రూ. 6,000",
        "రూ. 81,597 కోట్లు"
      ],
      correctAnswerIndex: 0,
      explanation: "అగ్నిమాపక సేవల పథకం కోసం కేటాయించిన మొత్తం రూ. 5,000 కోట్లు.",
    ),

    Question(
      questionText: "నేషనల్ సికిల్ సెల్ అనీమియా ఎరాడికేషన్ మిషన్ (NSCAEM)ని ప్రధాని మోడీ ఏ రాష్ట్రం ప్రారంభించారు?",
      options: [
        "మధ్యప్రదేశ్",
        "ఉత్తర ప్రదేశ్",
        "మహారాష్ట్ర",
        "గుజరాత్"
      ],
      correctAnswerIndex: 0,
      explanation: "ప్రధానమంత్రి మోడీ మధ్యప్రదేశ్‌లోని షాడోల్‌లో NSCAEMని ప్రారంభించారు.",
    ),

    Question(
      questionText: "ప్రధాన మంత్రి కిసాన్ సమ్మాన్ నిధి పథకం ఎప్పుడు ప్రారంభించబడింది?",
      options: [
        "1 డిసెంబర్, 2018",
        "13 జూన్, 2023",
        "19 జూలై, 2023",
        "1 ఆగస్టు, 2023"
      ],
      correctAnswerIndex: 0,
      explanation: "ప్రధాన మంత్రి కిసాన్ సమ్మాన్ నిధి పథకం 1 డిసెంబర్, 2018న ప్రారంభించబడింది.",
    ),

    Question(
      questionText: "Q1 FY24లో PMMY కింద రుణాల పంపిణీలో పెరుగుదల ఎంత?",
      options: [
        "23%",
        "5%",
        "10%",
        "15%"
      ],
      correctAnswerIndex: 0,
      explanation: "PMMY కింద రుణాల పంపిణీ Q1 FY24లో 23% పెరిగింది.",
    ),

    Question(
      questionText: "అడ్వాన్స్ ఆథరైజేషన్ స్కీమ్ ద్వారా DGFT ఏమి పర్యవేక్షిస్తుంది?",
      options: [
        "ఎగుమతి ప్రయోజనాల కోసం ఇన్‌పుట్‌ల డ్యూటీ-ఫ్రీ దిగుమతి",
        "రాష్ట్రాల్లో అగ్నిమాపక సేవల విస్తరణ",
        "మహిళా పారిశ్రామికవేత్తలకు ఆర్థిక సహాయం",
        "సికిల్ సెల్ అనీమియా నిర్మూలన"
      ],
      correctAnswerIndex: 0,
      explanation: "DGFT అడ్వాన్స్ ఆథరైజేషన్ స్కీమ్ ద్వారా ఎగుమతి ప్రయోజనాల కోసం ఇన్‌పుట్‌ల సుంకం-రహిత దిగుమతిని పర్యవేక్షిస్తుంది.",
    ),

    Question(
      questionText: "గృహ లక్ష్మి పథకం లక్ష్యం ఏమిటి?",
      options: [
        "మహిళా గృహాధిపతులకు ఆర్థిక సహాయం అందించడం",
        "రైల్వే స్టేషన్లలో సౌకర్యాలను మెరుగుపరచడానికి",
        "సికిల్ సెల్ అనీమియాను తొలగించడానికి",
        "MMRలో సరసమైన గృహాలను అందించడానికి"
      ],
      correctAnswerIndex: 0,
      explanation: "గృహ లక్ష్మి పథకం మహిళా కుటుంబ పెద్దలకు ఆర్థిక సహాయం అందించడం లక్ష్యంగా పెట్టుకుంది.",
    ),



    Question(
      questionText: "భారత ప్రభుత్వం ప్రవేశపెట్టిన 'క్రెడిట్ గ్యారెంటీ స్కీమ్' దేనికి?",
      options: [
        "పశుసంపద రంగం",
        "MSMEలు",
        "గ్రామీణ ఆర్థిక వ్యవస్థ",
        "సికిల్ సెల్ అనీమియా నిర్మూలన"
      ],
      correctAnswerIndex: 0,
      explanation: "క్రెడిట్ గ్యారెంటీ స్కీమ్' అనేది గ్రామీణ ఆర్థిక వ్యవస్థను రీబూట్ చేయడానికి మరియు MSMEలను శక్తివంతం చేయడానికి పశువుల రంగం కోసం ఉద్దేశించబడింది.",
    ),

    Question(
      questionText: "నిరుపేదలకు ఉచిత గృహ సౌకర్యాలు కల్పించేందుకు సీఎం భూపేష్ బఘెల్ ఏ పథకాన్ని ప్రారంభించారు?",
      options: [
        "గ్రామీణ్ ఆవాస్ న్యాయ్ యోజన",
        "పీఎం కిసాన్ సమ్మాన్ నిధి",
        "సశక్త్ మహిళా రిన్ యోజన",
        "నూతన గ్రామీణ గృహనిర్మాణ పథకం"
      ],
      correctAnswerIndex: 0,
      explanation: "పేదలకు ఉచిత గృహ సౌకర్యాలు కల్పించేందుకు సిఎం భూపేష్ బఘేల్ 'గ్రామీణ ఆవాస్ న్యాయ్ యోజన'ని ప్రారంభించారు.",
    ),

    Question(
      questionText: "'ప్రధాన్ మంత్రి శ్రమ యోగి మాన్-ధన్ (PM-SYM)' పథకం యొక్క లక్ష్యం ఏమిటి?",
      options: [
        "అసంఘటిత కార్మికులకు పెన్షన్ పథకం",
        "మహిళా పారిశ్రామికవేత్తలకు ఆర్థిక సహాయం",
        "రాష్ట్రాల్లో అగ్నిమాపక సేవల విస్తరణ",
        "సికిల్ సెల్ అనీమియా నిర్మూలన"
      ],
      correctAnswerIndex: 0,
      explanation: "PM-SYM యొక్క లక్ష్యం భారతదేశంలో అసంఘటిత కార్మికులకు పెన్షన్ పథకాన్ని అందించడం.",
    ),

    Question(
      questionText: "'అమృత్ భారత్ స్టేషన్ స్కీమ్ (ABSS)' లక్ష్యం ఏమిటి?",
      options: [
        "రైల్వే స్టేషన్లలో సౌకర్యాలను మెరుగుపరచడం",
        "రేప్ బాధిత కుటుంబాలకు ఉపశమనం అందించడం",
        "రైల్వే స్టేషన్ల కోసం మాస్టర్ ప్లాన్‌లను సిద్ధం చేస్తోంది",
        "అసంఘటిత కార్మికులకు పెన్షన్ పథకం"
      ],
      correctAnswerIndex: 0,
      explanation: "90 స్టేషన్లను గుర్తించి అభివృద్ధి చేయడం ద్వారా రైల్వే స్టేషన్లలో సౌకర్యాలను మెరుగుపరచడం ABSS లక్ష్యం.",
    ),

    Question(
      questionText: "పసిఫిక్ ద్వీప దేశాలకు విస్తరించాలని భారతదేశం పరిశీలిస్తోంది ISA ద్వారా నిర్వహించబడే ఏ సౌర చొరవ?",
      options: [
        "సోలార్ స్టార్-సి",
        "PMAY-G",
        "NSCAEM 2047",
        "గృహ లక్ష్మి పథకం"
      ],
      correctAnswerIndex: 0,
      explanation: "భారతదేశం ISA చే నిర్వహించబడుతున్న దాని సోలార్ స్టార్-C చొరవను పసిఫిక్ ద్వీప దేశాలకు విస్తరించాలని ఆలోచిస్తోంది.",
    ),

    Question(
      questionText: "గృహ లక్ష్మి' రిజిస్ట్రేషన్ ఎప్పుడు ప్రారంభమైంది?",
      options: [
        "19 జూలై 2023",
        "1 డిసెంబర్ 2018",
        "13 జూన్ 2023",
        "24 జూలై 2023"
      ],
      correctAnswerIndex: 0,
      explanation: "గృహ లక్ష్మి' రిజిస్ట్రేషన్ 19 జూలై 2023న ప్రారంభమైంది.",
    ),

    Question(
      questionText: "'ఈశాన్య ప్రాంతం కోసం ప్రధానమంత్రి అభివృద్ధి చొరవ (PM-DevINE)' పథకం యొక్క ప్రాముఖ్యత ఏమిటి?",
      options: [
        "కేంద్ర ప్రభుత్వం ద్వారా 100% నిధులు",
        "మహిళా పారిశ్రామికవేత్తలను శక్తివంతం చేయడానికి",
        "సికిల్ సెల్ అనీమియా నిర్మూలన",
        "రాష్ట్రాల్లో అగ్నిమాపక సేవల విస్తరణ"
      ],
      correctAnswerIndex: 0,
      explanation: "PM-DevINE పథకం ఈశాన్య ప్రాంతంలోని అభివృద్ధి ప్రాజెక్టుల కోసం కేంద్ర ప్రభుత్వంచే 100% నిధులు సమకూరుస్తుంది.",
    ),

    Question(
      questionText: "'సహకార్ సే సమృద్ధి' పథకం ఏమి సాధించాలని లక్ష్యంగా పెట్టుకుంది?",
      options: [
        "సహకార ఉద్యమాన్ని బలోపేతం చేయడం",
        "అసంఘటిత కార్మికులకు పెన్షన్ పథకం",
        "రాష్ట్రాల్లో అగ్నిమాపక సేవల విస్తరణ",
        "సికిల్ సెల్ అనీమియా నిర్మూలన"
      ],
      correctAnswerIndex: 0,
      explanation: "'సహకార్ సే సమృద్ధి' దేశంలో సహకార ఉద్యమాన్ని బలోపేతం చేయడమే లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "ఆర్థిక వ్యవహారాలపై క్యాబినెట్ కమిటీ కొనసాగింపు కోసం ఏ గొడుగు పథకం ఆమోదించబడింది?",
      options: [
        "వాతావరణం & వాతావరణ పరిశోధన-మోడలింగ్ అబ్జర్వింగ్ సిస్టమ్స్ & సర్వీసెస్ (ACROSS)",
        "సౌని యోజన",
        "క్రెడిట్ గ్యారెంటీ స్కీమ్",
        "గృహ లక్ష్మి పథకం"
      ],
      correctAnswerIndex: 0,
      explanation: "అక్రోస్' గొడుగు పథకం కొనసాగింపుకు ఆర్థిక వ్యవహారాల క్యాబినెట్ కమిటీ ఆమోదం తెలిపింది.",
    ),

    Question(
      questionText: "సౌని పథకం కింద గుజరాత్ ప్రభుత్వం విజయవంతంగా ఏమి పూర్తి చేసింది?",
      options: [
        "లింక్-3 యొక్క ప్యాకేజీ 8 మరియు ప్యాకేజీ 9 నిర్మాణం",
        "రాష్ట్రాల్లో అగ్నిమాపక సేవల విస్తరణ",
        "మహిళా పారిశ్రామికవేత్తలకు ఆర్థిక సహాయం",
        "సికిల్ సెల్ అనీమియా నిర్మూలన"
      ],
      correctAnswerIndex: 0,
      explanation: "సౌని పథకం కింద లింక్-3 యొక్క ప్యాకేజీ 8 మరియు ప్యాకేజీ 9 నిర్మాణాన్ని గుజరాత్ ప్రభుత్వం విజయవంతంగా పూర్తి చేసింది.",
    ),

    Question(
      questionText: "వార్తల్లో పేర్కొన్న ఆయుష్మాన్ భారత్-ప్రధాన మంత్రి జన్ ఆరోగ్య యోజన లక్ష్య సాధన ఏమిటి?",
      options: [
        "గత రెండేళ్లలో 3.14 కోట్ల మంది లబ్ధిదారులు లబ్ధి పొందుతున్నారు",
        "PMMY కింద పంపిణీలలో 23% పెరుగుదల",
        "అగ్నిమాపక సేవలకు రూ. 5,000 కోట్ల కేటాయింపు",
        "ABSS కింద 90 రైల్వే స్టేషన్ల నిర్మాణం"
      ],
      correctAnswerIndex: 0,
      explanation: "ఆయుష్మాన్ భారత్-ప్రధాన్ మంత్రి జన్ ఆరోగ్య యోజన లక్ష్య సాధన గత రెండేళ్లలో 3.14 కోట్ల మంది లబ్ధిదారులు లబ్ధి పొందుతున్నారు.",
    ),
    Question(
      questionText: "2022-23 సంవత్సరానికి AIFF పురుషుల ఫుట్‌బాలర్ ఆఫ్ ది ఇయర్‌గా ఎవరు ఎంపికయ్యారు?",
      options: [
        "లాలియన్జువాలా చాంగ్టే",
        "మనీషా కళ్యాణ్",
        "అజిత్ అగార్కర్",
        "తమీమ్ ఇక్బాల్"
      ],
      correctAnswerIndex: 0,
      explanation: "2022-23 సంవత్సరానికి AIFF పురుషుల ఫుట్‌బాలర్ ఆఫ్ ది ఇయర్‌గా లాలియన్జువాలా చాంగ్టే ఎంపికయ్యాడు.",
    ),

    Question(
      questionText: "2022-23 సంవత్సరానికి ఆమె వరుసగా రెండవ మహిళా ఫుట్‌బాల్ క్రీడాకారిణి అవార్డును ఎవరు గెలుచుకున్నారు?",
      options: [
        "లాలియన్జువాలా చాంగ్టే",
        "మనీషా కళ్యాణ్",
        "అజిత్ అగార్కర్",
        "తమీమ్ ఇక్బాల్"
      ],
      correctAnswerIndex: 1,
      explanation: "మనీషా కళ్యాణ్ తన వరుసగా రెండవ మహిళా ఫుట్‌బాల్ క్రీడాకారిణి అవార్డును గెలుచుకుంది.",
    ),

    Question(
      questionText: "సీనియర్ పురుషుల క్రికెట్ ఎంపిక కమిటీ ఛైర్మన్‌గా ఎవరు నియమితులయ్యారు?",
      options: [
        "లాలియన్జువాలా చాంగ్టే",
        "అజిత్ అగార్కర్",
        "తమీమ్ ఇక్బాల్",
        "మాక్స్ వెర్స్టాపెన్"
      ],
      correctAnswerIndex: 1,
      explanation: "సీనియర్ పురుషుల క్రికెట్ సెలక్షన్ కమిటీ ఛైర్మన్‌గా అజిత్ అగార్కర్ నియమితులయ్యారు.",
    ),

    Question(
      questionText: "ఏ దేశపు పురుషుల హాకీ జట్టు రెండవ FIH హాకీ ప్రో లీగ్ టైటిల్‌ను గెలుచుకుంది?",
      options: [
        "భారతదేశం",
        "నెదర్లాండ్స్",
        "ఆస్ట్రేలియా",
        "స్పెయిన్"
      ],
      correctAnswerIndex: 1,
      explanation: "నెదర్లాండ్స్ పురుషుల జట్టు రెండవ FIH హాకీ ప్రో లీగ్ టైటిల్‌ను గెలుచుకుంది.",
    ),

    Question(
      questionText: "బ్రిటీష్ గ్రాండ్ ప్రిక్స్ 2023లో ఎవరు విజయం సాధించారు?",
      options: [
        "లాండో నోరిస్",
        "లూయిస్ హామిల్టన్",
        "మాక్స్ వెర్స్టాపెన్",
        "లక్ష్య సేన్"
      ],
      correctAnswerIndex: 2,
      explanation: "బ్రిటీష్ గ్రాండ్ ప్రిక్స్ 2023లో మ్యాక్స్ వెర్స్టాపెన్ విజయం సాధించాడు.",
    ),

    Question(
      questionText: "58వ కెనడా ఓపెన్ 2023లో పురుషుల సింగిల్స్ టైటిల్‌ను ఎవరు గెలుచుకున్నారు?",
      options: [
        "లక్ష్య సేన్",
        "లి షి ఫెంగ్",
        "ఆంథోనీ గోర్డాన్",
        "తమీమ్ ఇక్బాల్"
      ],
      correctAnswerIndex: 0,
      explanation: "58వ కెనడా ఓపెన్ 2023లో లక్ష్య సేన్ పురుషుల సింగిల్స్ టైటిల్‌ను గెలుచుకున్నాడు.",
    ),

    Question(
      questionText: "అండర్-21 యూరోపియన్ ఛాంపియన్‌షిప్ ఫైనల్‌లో ఏ జట్టు విజేతగా నిలిచింది?",
      options: [
        "స్పెయిన్",
        "ఇటలీ",
        "ఇంగ్లండ్",
        "నెదర్లాండ్స్"
      ],
      correctAnswerIndex: 2,
      explanation: "స్పెయిన్‌తో జరిగిన అండర్-21 యూరోపియన్ ఛాంపియన్‌షిప్ ఫైనల్‌లో ఇంగ్లాండ్ విజేతగా నిలిచింది.",
    ),

    Question(
      questionText: "34వ అంతర్జాతీయ జీవశాస్త్ర ఒలింపియాడ్ ఏ దేశంలో జరిగింది?",
      options: [
        "భారతదేశం",
        "యుఎఇ",
        "కెనడా",
        "ఆస్ట్రేలియా"
      ],
      correctAnswerIndex: 1,
      explanation: "34వ అంతర్జాతీయ జీవశాస్త్ర ఒలింపియాడ్ UAEలోని అల్ ఐన్‌లో జరిగింది.",
    ),

    Question(
      questionText: "2023 ప్రపంచ ఆర్చరీ యూత్ ఛాంపియన్‌షిప్‌లో భారత్ ఎన్ని పతకాలు సాధించింది?",
      options: [
        "5",
        "9",
        "11",
        "15"
      ],
      correctAnswerIndex: 2,
      explanation: "2023 ప్రపంచ ఆర్చరీ యూత్ ఛాంపియన్‌షిప్‌లో భారత్ 11 పతకాలు సాధించింది.",
    ),

    Question(
      questionText: "2026 కామన్వెల్త్ క్రీడల హోస్ట్‌గా ఆస్ట్రేలియా ఎందుకు ఉపసంహరించుకుంది?",
      options: [
        "భద్రతా ఆందోళనలు",
        "కోవిడ్-19 మహమ్మారి",
        "ఖర్చు పెంపు",
        "మౌలిక సదుపాయాల కొరత"
      ],
      correctAnswerIndex: 2,
      explanation: "ఆస్ట్రేలియా 2026 కామన్వెల్త్ క్రీడల హోస్ట్‌గా వైదొలిగింది, ఈవెంట్‌ను నిర్వహించడానికి అంచనా వ్యయం భారీగా పెరిగింది.",
    ),
    Question(
      questionText: "పారా అథ్లెటిక్స్ ప్రపంచ ఛాంపియన్‌షిప్‌లో పారిస్‌లో బంగారు పతకాన్ని ఎవరు కైవసం చేసుకున్నారు?",
      options: [
        "అజీత్ సింగ్",
        "పృథ్వీరాజ్ తొండైమాన్",
        "హర్మన్‌ప్రీత్ కౌర్",
        "మాక్స్ వెర్స్టాపెన్"
      ],
      correctAnswerIndex: 0,
      explanation: "పారా అథ్లెటిక్స్ ప్రపంచ ఛాంపియన్‌షిప్‌లో పురుషుల జావెలిన్ త్రో F46 విభాగంలో అజీత్ సింగ్ బంగారు పతకాన్ని సాధించాడు.",
    ),

    Question(
      questionText: "షాట్‌గన్ ప్రపంచ కప్‌లో ట్రాప్‌లో కాంస్యం గెలిచిన పృథ్వీరాజ్ తొండైమాన్ ఏ భారతీయ రాష్ట్రం నుండి వచ్చాడు?",
      options: [
        "మహారాష్ట్ర",
        "కర్ణాటక",
        "పశ్చిమ బెంగాల్",
        "రాజస్థాన్"
      ],
      correctAnswerIndex: 0,
      explanation: "షాట్‌గన్ ప్రపంచకప్‌లో ట్రాప్‌లో కాంస్యం గెలిచిన పృథ్వీరాజ్ తొండైమాన్ మహారాష్ట్రకు చెందినవాడు.",
    ),

    Question(
      questionText: "25వ ఆసియా అథ్లెటిక్స్ ఛాంపియన్‌షిప్ 2023లో భారత బృందం ఎన్ని పతకాలు సాధించింది?",
      options: [
        "15",
        "20",
        "25",
        "27"
      ],
      correctAnswerIndex: 3,
      explanation: "థాయిలాండ్‌లోని బ్యాంకాక్‌లో జరిగిన 25వ ఆసియా అథ్లెటిక్స్ ఛాంపియన్‌షిప్ 2023లో భారత బృందం 27 పతకాలను గెలుచుకుంది.",
    ),

    Question(
      questionText: "సాత్విక్‌సాయిరాజ్ రంకిరెడ్డి బ్యాడ్మింటన్‌లో ఏ గిన్నిస్ రికార్డు సృష్టించారు?",
      options: [
        "పొడవైన ర్యాలీ",
        "వేగవంతమైన హిట్",
        "ఎత్తైన జంప్",
        "అత్యంత వరుస విజయాలు"
      ],
      correctAnswerIndex: 1,
      explanation: "కొరియా ఓపెన్ 2023లో బ్యాడ్మింటన్‌లో అత్యంత వేగంగా హిట్ సాధించిన పురుష క్రీడాకారుడిగా సాత్విక్‌సాయిరాజ్ రంకిరెడ్డి కొత్త గిన్నిస్ ప్రపంచ రికార్డును నెలకొల్పాడు.",
    ),

    Question(
      questionText: "FIFA ఉమెన్స్ వరల్డ్ కప్ 2023 కోసం టెలివిజన్ హక్కులను ఏ ఛానెల్ పొందింది?",
      options: [
        "స్టార్ స్పోర్ట్స్",
        "ESPN",
        "DD స్పోర్ట్స్",
        "సోనీ సిక్స్"
      ],
      correctAnswerIndex: 2,
      explanation: "FIFA ఉమెన్స్ వరల్డ్ కప్ 2023 కోసం DD స్పోర్ట్స్ టెలివిజన్ హక్కులను పొందింది.",
    ),

    Question(
      questionText: "2023లో హంగరీలో జరిగిన సూపర్ GM చెస్ టోర్నమెంట్‌ను ఎవరు గెలుచుకున్నారు?",
      options: [
        "విశ్వనాథన్ ఆనంద్",
        "మాగ్నస్ కార్ల్‌సెన్",
        "ఆర్ ప్రజ్ఞానంద",
        "హికారు నకమురా"
      ],
      correctAnswerIndex: 2,
      explanation: "2023లో హంగేరిలో జరిగిన సూపర్ GM చెస్ టోర్నమెంట్‌లో 17 ఏళ్ల భారతీయ గ్రాండ్‌మాస్టర్ ఆర్ ప్రగ్నానంద విజేతగా నిలిచాడు.",
    ),

    Question(
      questionText: "500 అంతర్జాతీయ మ్యాచ్‌లు ఆడిన 10వ క్రికెటర్‌ ఎవరు?",
      options: [
        "సచిన్ టెండూల్కర్",
        "రికీ పాంటింగ్",
        "ఎబి డివిలియర్స్",
        "విరాట్ కోహ్లీ"
      ],
      correctAnswerIndex: 3,
      explanation: "విరాట్ కోహ్లీ చరిత్రలో 500 అంతర్జాతీయ మ్యాచ్‌లు ఆడిన 10వ క్రికెటర్ అయ్యాడు.",
    ),

    Question(
      questionText: "75 పరుగుల విజయంతో దులీప్ ట్రోఫీని ఏ జట్టు గెలుచుకుంది?",
      options: [
        "నార్త్ జోన్",
        "ఈస్ట్ జోన్",
        "వెస్ట్ జోన్",
        "సౌత్ జోన్"
      ],
      correctAnswerIndex: 3,
      explanation: "బెంగళూరులోని ఎం. చిన్నస్వామి స్టేడియంలో సౌత్ జోన్ 75 పరుగుల తేడాతో దులీప్ ట్రోఫీని గెలుచుకుంది.",
    ),

    Question(
      questionText: "ICC వరల్డ్ కప్ 2023 బ్రాండ్ అంబాసిడర్‌గా ఎవరు నియమితులయ్యారు?",
      options: [
        "అమితాబ్ బచ్చన్",
        "షారుఖ్ ఖాన్",
        "అమీర్ ఖాన్",
        "దీపికా పదుకొనే"
      ],
      correctAnswerIndex: 1,
      explanation: "ICC ప్రపంచ కప్ 2023 బ్రాండ్ అంబాసిడర్‌గా షారూఖ్ ఖాన్ నియమితులయ్యారు.",
    ),

    Question(
      questionText: "వెస్టిండీస్‌తో భారత్ రెండో టెస్టులో విరాట్ కోహ్లీ ఏ మైలురాయిని సాధించాడు?",
      options: [
        "200 శతాబ్దాలు",
        "500 అంతర్జాతీయ ప్రదర్శనలు",
        "10000 టెస్ట్ పరుగులు",
        "50 టెస్ట్ సెంచరీలు"
      ],
      correctAnswerIndex: 1,
      explanation: "వెస్టిండీస్‌తో భారత్ రెండో టెస్టులో విరాట్ కోహ్లీ 500 అంతర్జాతీయ మ్యాచ్‌లు ఆడిన మైలురాయిని సాధించాడు.",
    ),
    Question(
        questionText: "లిథువేనియాలోని విల్నియస్‌లో జరిగిన NATO సమ్మిట్ ఏ ముఖ్యమైన వృద్ధి మరియు ఐక్యతను సాధించింది?",
        options: [
          "సింబాలిక్ విస్తరణ మరియు దూకుడుకు వ్యతిరేకంగా పరిష్కారం.",
          "ఉక్రెయిన్‌పై రష్యా దాడిలో వ్యూహాత్మక విజయం.",
          "కూటమిలో చేరిన ఇద్దరు కొత్త సభ్యులు.",
          "NATO యొక్క ఐక్యతలో తగ్గుదల."
        ],
        correctAnswerIndex: 0,
        explanation: "NATO సమ్మిట్ లాంఛనప్రాయ విస్తరణను సాధించింది మరియు దురాక్రమణకు వ్యతిరేకంగా పరిష్కరించుకుంది."
    ),

    Question(
        questionText: "వరల్డ్ ట్రేడ్ ఆర్గనైజేషన్ (WTO) యొక్క 13వ మంత్రివర్గ సమావేశానికి అధ్యక్షుడిగా ఎవరు ఎన్నికయ్యారు?",
        options: [
          "డా. థాని అల్ జెయోడీ",
          "జ్యోతిరాదిత్య ఎం సింధియా",
          "భూపేంద్రభాయ్ పటేల్",
          "లెఫ్టినెంట్ జనరల్ MU నాయర్"
        ],
        correctAnswerIndex: 0,
        explanation: "డా. థానీ అల్ జెయౌడీ WTO యొక్క 13వ మంత్రివర్గ సమావేశానికి అధ్యక్షుడిగా ఎన్నికయ్యారు."
    ),

    Question(
        questionText: "హెలీ సమ్మిట్ 2023తో ఏ థీమ్ అనుబంధించబడింది?",
        options: [
          "రీచింగ్ ది లాస్ట్ మైల్: హెలికాప్టర్స్ & స్మాల్ ఎయిర్‌క్రాఫ్ట్ ద్వారా ప్రాంతీయ కనెక్టివిటీ",
          "ఏవియేషన్‌లో స్థిరమైన అభివృద్ధి",
          "ఏరోస్పేస్ టెక్నాలజీలో పురోగతి",
          "గ్లోబల్ కోలాబరేషన్ ఫర్ ఎయిర్ ట్రాన్స్‌పోర్ట్"
        ],
        correctAnswerIndex: 0,
        explanation: "హెలి సమ్మిట్ 2023 యొక్క థీమ్ 'చివరి మైలును చేరుకోవడం: హెలికాప్టర్లు & చిన్న విమానాల ద్వారా ప్రాంతీయ కనెక్టివిటీ'."
    ),

    Question(
        questionText: "సెమికాన్ఇండియా 2023 ఎగ్జిబిషన్ ఎక్కడ ప్రారంభించబడింది?",
        options: [
          "గాంధీనగర్, గుజరాత్",
          "అబూ ధాబీ",
          "ఖజురహో",
          "విల్నియస్, లిథువేనియా"
        ],
        correctAnswerIndex: 0,
        explanation: "సెమికాన్ఇండియా 2023 ఎగ్జిబిషన్ గుజరాత్‌లోని గాంధీనగర్‌లో ప్రారంభించబడింది."
    ),

    Question(
        questionText: "అంతర్జాతీయ సహకార దినోత్సవం ఏ రోజున జరుగుతుంది?",
        options: [
          "జూలై 1 లేదా జూలై మొదటి శనివారం",
          "జూలై 10",
          "జూలై 30",
          "జూలై 15"
        ],
        correctAnswerIndex: 0,
        explanation: "అంతర్జాతీయ సహకార దినోత్సవం జూలై 1 లేదా జూలై మొదటి శనివారం జరుగుతుంది."
    ),

    Question(
        questionText: "జూలై 2023లో ప్రపంచ జనాభా దినోత్సవం యొక్క థీమ్ ఏమిటి?",
        options: [
          "లింగ సమానత్వం యొక్క శక్తిని విడుదల చేయడం: మన ప్రపంచం యొక్క అనంతమైన అవకాశాలను అన్‌లాక్ చేయడానికి మహిళలు మరియు బాలికల గొంతులను ఉద్ధరించడం",
          "ఒక జీవితం, ఒక కాలేయం",
          "అడవులు మరియు జీవనోపాధి: ప్రజలు మరియు గ్రహాలను నిలబెట్టడం",
          "30 బై 30"
        ],
        correctAnswerIndex: 0,
        explanation: "ప్రపంచ జనాభా దినోత్సవం యొక్క ఇతివృత్తం 'లింగ సమానత్వం యొక్క శక్తిని వెలికితీయడం: మన ప్రపంచం యొక్క అనంతమైన అవకాశాలను అన్‌లాక్ చేయడానికి మహిళలు మరియు బాలికల గొంతులను ఉద్ధరించడం'."
    ),

    Question(
        questionText: "కొత్త జాతీయ సైబర్‌ సెక్యూరిటీ కోఆర్డినేటర్‌గా ఎవరు నియమితులయ్యారు?",
        options: [
          "లెఫ్టినెంట్ జనరల్ MU నాయర్",
          "డా. థాని అల్ జెయోడీ",
          "జ్యోతిరాదిత్య ఎం సింధియా",
          "భూపేంద్రభాయ్ పటేల్"
        ],
        correctAnswerIndex: 0,
        explanation: "లెఫ్టినెంట్ జనరల్ MU నాయర్ కొత్త నేషనల్ సైబర్ సెక్యూరిటీ కోఆర్డినేటర్‌గా నియమితులయ్యారు."
    ),

    Question(
        questionText: "జపాన్-ఇండియా మారిటైమ్ ఎక్సర్‌సైజ్ 2023 (JIMEX 23) యొక్క ఏడవ ఎడిషన్ ఎక్కడ జరగనుంది?",
        options: [
          "విశాఖపట్నం, భారతదేశం",
          "కొచ్చి",
          "జకార్తా",
          "ఉలాన్‌బాతర్, మంగోలియా"
        ],
        correctAnswerIndex: 0,
        explanation: "JIMEX 23 యొక్క ఏడవ ఎడిషన్ భారతదేశంలోని విశాఖపట్నంలో జరగనుంది."
    ),

    Question(
        questionText: "భారతదేశం మరియు యునైటెడ్ స్టేట్స్ నిర్వహించిన ఆపరేషన్ బ్రాడర్ స్వోర్డ్ యొక్క దృష్టి ఏమిటి?",
        options: [
          "ఫార్మాస్యూటికల్స్, పరికరాలు మరియు పూర్వగామి రసాయనాల అక్రమ రవాణాను నిరోధించడం",
          "ఉగ్రవాద వ్యతిరేక కార్యకలాపాలు",
          "సైబర్ భద్రతా",
          "మాదక-వ్యతిరేక కార్యకలాపాలు"
        ],
        correctAnswerIndex: 0,
        explanation: "ఫార్మాస్యూటికల్స్, పరికరాలు మరియు పూర్వగామి రసాయనాల అక్రమ రవాణాను నిరోధించే లక్ష్యంతో ఆపరేషన్ బ్రాడర్ స్వోర్డ్."
    ),

    Question(
        questionText: "డిఫెన్స్ అక్విజిషన్ కౌన్సిల్ (DAC) జూలై 13, 2023న ఏమి ఆమోదించింది?",
        options: [
          "26 రాఫెల్ మెరైన్ విమానాలు మరియు అదనపు స్కార్పెన్ జలాంతర్గాముల సేకరణ",
          "కొత్త సైబర్ సెక్యూరిటీ స్ట్రాటజీ డెవలప్‌మెంట్",
          "అధునాతన క్షిపణి రక్షణ వ్యవస్థల విస్తరణ",
          "నావికాదళం యొక్క విస్తరణ"
        ],
        correctAnswerIndex: 0,
        explanation: "26 రాఫెల్ మెరైన్ విమానాలు మరియు అదనపు స్కార్పెన్ జలాంతర్గాముల సేకరణను DAC ఆమోదించింది."
    ),
    Question(
        questionText: "మారిటైమ్ డొమైన్‌లో డిజిటలైజేషన్‌ను ప్రోత్సహించే లక్ష్యంతో సర్బానంద సోనోవాల్ ఏమి ప్రారంభించారు?",
        options: [
          "సాగర్ సంపర్క్ - ఒక స్వదేశీ డిఫరెన్షియల్ గ్లోబల్ నావిగేషన్ శాటిలైట్ సిస్టమ్ (DGNSS)",
          "సెమీకాన్ఇండియా 2023 ఎగ్జిబిషన్",
          "హెలీ సమ్మిట్ 2023",
          "జపాన్-ఇండియా మారిటైమ్ ఎక్సర్‌సైజ్ 2023 (JIMEX 23)"
        ],
        correctAnswerIndex: 0,
        explanation: "సర్బానంద సోనోవాల్ సాగర్ సంపార్క్ - స్వదేశీ డిఫరెన్షియల్ గ్లోబల్ నావిగేషన్ శాటిలైట్ సిస్టమ్ (DGNSS)ని ప్రారంభించారు."
    ),

    Question(
        questionText: "ఇండియా-మంగోలియా సంయుక్త సైనిక వ్యాయామం 'నోమాడిక్ ఎలిఫెంట్' ఎక్కడ జరగనుంది?",
        options: [
          "ఉలాన్‌బాతర్, మంగోలియా",
          "విశాఖపట్నం, భారతదేశం",
          "జకార్తా",
          "గల్ఫ్ ఆఫ్ ఒమన్"
        ],
        correctAnswerIndex: 0,
        explanation: "ఇండియా-మంగోలియా సంయుక్త సైనిక వ్యాయామం 'నోమాడిక్ ఎలిఫెంట్' మంగోలియాలోని ఉలాన్‌బాటర్‌లో జరగనుంది."
    ),

    Question(
        questionText: "గల్ఫ్ ఆఫ్ ఒమన్‌లో 'సెక్యూరిటీ బాండ్-2023' అనే ఉమ్మడి నౌకాదళ వ్యాయామంలో ఏ దేశాలు పాల్గొంటున్నాయి?",
        options: [
          "చైనా, రష్యా మరియు ఇరాన్",
          "భారతదేశం మరియు యునైటెడ్ స్టేట్స్",
          "జపాన్ మరియు భారతదేశం",
          "ఉత్తర కొరియా మరియు దక్షిణ కొరియా"
        ],
        correctAnswerIndex: 0,
        explanation: "'సెక్యూరిటీ బాండ్-2023' అనేది ఒమన్ గల్ఫ్‌లో చైనా, రష్యా మరియు ఇరాన్ ప్రారంభించిన ఉమ్మడి నౌకాదళ వ్యాయామం."
    ),

    Question(
        questionText: "దాచుకున్న ఉగ్రవాదులను మట్టుబెట్టడానికి జమ్మూ-కశ్మీర్‌లో కొనసాగుతున్న సైనిక చర్య ఏమిటి?",
        options: [
          "ఆపరేషన్ త్రినేత్ర-II",
          "ఆపరేషన్ బ్రాడర్ స్వోర్డ్",
          "ఆపరేషన్ సంచార ఏనుగు",
          "ఆపరేషన్ సెక్యూరిటీ బాండ్"
        ],
        correctAnswerIndex: 0,
        explanation: "దాచుకున్న ఉగ్రవాదులను మట్టుబెట్టడానికి జమ్మూ-కశ్మీర్‌లో కొనసాగుతున్న సైనిక చర్య ఆపరేషన్ త్రినేత్ర-II."
    ),

    Question(
        questionText: "ఇండోనేషియా నావికా దళాలతో కలిసి ద్వైపాక్షిక సముద్ర వ్యాయామంలో పాల్గొనేందుకు ఏ నౌకాదళ నౌకలు జకార్తా చేరుకున్నాయి?",
        options: [
          "INS సహ్యాద్రి మరియు INS కోల్‌కతా",
          "INS కిర్పాన్ మరియు INS విక్రాంత్",
          "HMAS కాన్‌బెర్రా మరియు USS జాన్ సి. స్టెన్నిస్",
          "HMS క్వీన్ ఎలిజబెత్ మరియు FNS చార్లెస్ డి గల్లె"
        ],
        correctAnswerIndex: 0,
        explanation: "INS సహ్యాద్రి మరియు INS కోల్‌కతా ఇండోనేషియా నావికా దళాలతో కలిసి ద్వైపాక్షిక సముద్ర వ్యాయామంలో పాల్గొనేందుకు జకార్తా చేరుకున్నాయి."
    ),


    Question(
        questionText: "లైట్ మరియు మీడియం యుటిలిటీ హెలికాప్టర్ల కొనుగోలు కోసం ఏ దేశ రక్షణ మంత్రి HALతో లెటర్ ఆఫ్ ఇంటెంట్ (LoI)పై సంతకం చేశారు?",
        options: [
          "అర్జెంటీనా",
          "వియత్నాం",
          "మంగోలియా",
          "ఇరాన్"
        ],
        correctAnswerIndex: 0,
        explanation: "లైట్ మరియు మీడియం యుటిలిటీ హెలికాప్టర్ల కొనుగోలు కోసం అర్జెంటీనా రక్షణ మంత్రి HALతో లెటర్ ఆఫ్ ఇంటెంట్ (LoI)పై సంతకం చేశారు."
    ),

    Question(
        questionText: "సాంస్కృతిక మంత్రిత్వ శాఖ మరియు భారత నౌకాదళం మధ్య అవగాహన ఒప్పందం (MOU) ద్వారా ఏ పురాతన నౌకానిర్మాణ సాంకేతికత పునరుద్ధరించబడుతోంది?",
        options: [
          "టంకై పద్ధతి",
          "కుట్టిన నౌకానిర్మాణ పద్ధతి",
          "ప్లాంక్-ఆన్-ఫ్రేమ్ పద్ధతి",
          "ఫెర్రోస్మెంట్ పద్ధతి"
        ],
        correctAnswerIndex: 0,
        explanation: "MOU నౌకానిర్మాణంలో పురాతన 'టంకై పద్ధతి'ని పునరుద్ధరించడం లక్ష్యంగా పెట్టుకుంది."
    ),

    Question(
        questionText: "వివిధ ప్రాంతాల యువతను ఏకం చేసేందుకు ఇండియన్ నేవీ మరియు నేవీ వెల్ఫేర్ అండ్ వెల్నెస్ అసోసియేషన్ (NWWA) ప్రారంభించిన క్విజ్ పేరు ఏమిటి?",
        options: [
          "G20 థింక్",
          "నేవల్ ఇన్‌సైట్ ఛాలెంజ్",
          "సీ క్వెస్ట్",
          "మారిటైమ్ మైండ్స్"
        ],
        correctAnswerIndex: 0,
        explanation: "భారత నౌకాదళం మరియు NWWA ప్రారంభించిన క్విజ్‌ని 'G20 థింక్' అంటారు."
    ),

    Question(
        questionText: "జూలై 2023లో INS కిర్పాన్‌కి సంబంధించి భారతదేశం ఏ ముఖ్యమైన చర్య తీసుకుంది?",
        options: [
          "డికమిషన్ చేయబడింది మరియు వియత్నాం పీపుల్స్ నేవీకి అప్పగించబడింది",
          "అధునాతన సాంకేతికతతో అప్‌గ్రేడ్ చేయబడింది",
          "అంటార్కిటికాకు ప్రత్యేక మిషన్‌పై పంపబడింది",
          "భారత తీర రక్షక దళానికి బదిలీ చేయబడింది"
        ],
        correctAnswerIndex: 0,
        explanation: "భారతదేశం ఉపసంహరించుకుంది మరియు INS కిర్పాన్‌ను వియత్నాం పీపుల్స్ నేవీకి అప్పగించింది."
    ),

    Question(
        questionText: "తాలిస్మాన్ సాబెర్ 2023 ఏ దేశం యొక్క అతిపెద్ద ద్వైపాక్షిక సైనిక వ్యాయామం?",
        options: [
          "ఆస్ట్రేలియా",
          "భారతదేశం",
          "సంయుక్త రాష్ట్రాలు",
          "జపాన్"
        ],
        correctAnswerIndex: 0,
        explanation: "తాలిస్మాన్ సాబెర్ 2023 అనేది యునైటెడ్ స్టేట్స్‌తో ఆస్ట్రేలియా యొక్క అతిపెద్ద ద్వైపాక్షిక సైనిక వ్యాయామం."
    ),

    Question(
        questionText: "డైరెక్టర్ జనరల్ ఆఫ్ రైల్వే ప్రొటెక్షన్ ఫోర్స్ ద్వారా కొత్తగా నిర్మించిన జాతీయ అమరవీరుల స్మారక చిహ్నాన్ని ఎక్కడ ఆవిష్కరించారు?",
        options: [
          "జగ్జీవన్ RPF అకాడమీ, లక్నో, ఉత్తరప్రదేశ్",
          "ఢిల్లీ జంక్షన్ రైల్వే స్టేషన్",
          "విక్టోరియా టెర్మినస్, ముంబై",
          "హౌరా జంక్షన్, కోల్‌కతా"
        ],
        correctAnswerIndex: 0,
        explanation: "జాగ్జీవన్ RPF అకాడమీ, లక్నో, ఉత్తరప్రదేశ్‌లో జాతీయ అమరవీరుల స్మారక చిహ్నం ఆవిష్కరించబడింది."
    ),

    Question(
        questionText: "జులై 27, 2023న ఏ సెంట్రల్ ఆర్మ్‌డ్ పోలీస్ ఫోర్స్ తన 85వ రైజింగ్ డేని జరుపుకుంది?",
        options: [
          "సెంట్రల్ రిజర్వ్ పోలీస్ ఫోర్స్ (CRPF)",
          "సరిహద్దు భద్రతా దళం (BSF)",
          "ఇండో-టిబెటన్ బోర్డర్ పోలీస్ (ITBP)",
          "సెంట్రల్ ఇండస్ట్రియల్ సెక్యూరిటీ ఫోర్స్ (CISF)"
        ],
        correctAnswerIndex: 0,
        explanation: "సెంట్రల్ రిజర్వ్ పోలీస్ ఫోర్స్ (CRPF) జూలై 27, 2023న తన 85వ రైజింగ్ డేని జరుపుకుంది."
    ),

    Question(
        questionText: "భారత వైమానిక దళం కోసం ఉపగ్రహాలను అభివృద్ధి చేయడానికి రక్షణ మంత్రిత్వ శాఖ నుండి ఏ స్పేస్-టెక్ స్టార్టప్ గణనీయమైన గ్రాంట్‌ను పొందింది?",
        options: [
          "పిక్సెల్",
          "ఇస్రో",
          "ఆస్ట్రోస్కేల్",
          "స్కైరూట్ ఏరోస్పేస్"
        ],
        correctAnswerIndex: 0,
        explanation: "Pixxel, ఒక స్పేస్-టెక్ స్టార్టప్, భారత వైమానిక దళం కోసం ఉపగ్రహాలను అభివృద్ధి చేయడం కోసం రక్షణ మంత్రిత్వ శాఖ నుండి గణనీయమైన గ్రాంట్‌ను పొందింది."
    ),

    Question(
        questionText: "పిల్లల రచన కోసం PEN పింటర్ ప్రైజ్ 2023తో ఎవరు సత్కరించబడ్డారు?",
        options: [
          "మైఖేల్ రోసెన్",
          "రోల్డ్ డాల్",
          "JK రౌలింగ్",
          "ఎనిడ్ బ్లైటన్"
        ],
        correctAnswerIndex: 0,
        explanation: "ప్రఖ్యాత బాలల రచయిత మైఖేల్ రోసెన్, PEN పింటర్ ప్రైజ్ 2023తో సత్కరించబడ్డారు."
    ),

    Question(
        questionText: "రక్షణ మంత్రిత్వ శాఖ ప్రారంభించిన 'ఎల్లో రిబ్బన్' ప్రచారం యొక్క దృష్టి ఏమిటి?",
        options: [
          "సాయుధ దళాల సిబ్బందికి మానసిక ఆరోగ్య మద్దతు",
          "రహదారి భద్రతపై అవగాహన పెంచడం",
          "పర్యావరణ పరిరక్షణను ప్రోత్సహించడం",
          "మాదక దుర్వినియోగానికి వ్యతిరేకంగా ప్రచారం"
        ],
        correctAnswerIndex: 0,
        explanation: "'ఎల్లో రిబ్బన్' ప్రచారం సాయుధ దళాల సిబ్బందికి మానసిక ఆరోగ్య మద్దతుపై దృష్టి పెడుతుంది."
    ),

    Question(
        questionText: "ప్రపంచ హెపటైటిస్ డే 2023 యొక్క థీమ్ ఏమిటి?",
        options: [
          "తప్పిపోయిన మిలియన్లను కనుగొనండి",
          "హెపటైటిస్ రహిత భవిష్యత్తు",
          "హెపటైటిస్ లేదు. కళంకం లేదు.",
          "హెపటైటిస్‌ను నివారించండి. ఇప్పుడే చర్య తీసుకోండి."
        ],
        correctAnswerIndex: 0,
        explanation: "వరల్డ్ హెపటైటిస్ డే 2023 యొక్క థీమ్ 'తప్పిపోయిన మిలియన్లను కనుగొనండి'."
    ),

    Question(
        questionText: "ప్రజా రవాణా బస్సులలో ప్రజల భద్రతను పెంపొందించడానికి భారతదేశంలోని ఏ రాష్ట్రం 'మై జోన్, మై సేఫ్టీ' ప్రచారాన్ని ప్రారంభించింది?",
        options: [
          "మహారాష్ట్ర",
          "ఢిల్లీ",
          "తమిళనాడు",
          "కర్ణాటక"
        ],
        correctAnswerIndex: 0,
        explanation: "మహారాష్ట్ర ప్రజా రవాణా బస్సులలో ప్రజల భద్రతను పెంచడానికి 'మై జోన్, మై సేఫ్టీ' ప్రచారాన్ని ప్రారంభించింది."
    ),

    Question(
        questionText: "అంగన్‌వాడీ కార్యకర్తలు మరియు లబ్ధిదారుల సంక్షేమం కోసం కార్మిక & ఉపాధి మంత్రిత్వ శాఖ ప్రారంభించిన యాప్ పేరు ఏమిటి?",
        options: [
          "అంగన్‌సఫర్",
          "అంగనవికాస్",
          "అంగనమిత్రం",
          "అంగనసువిధ"
        ],
        correctAnswerIndex: 0,
        explanation: "కార్మిక & ఉపాధి మంత్రిత్వ శాఖ ప్రారంభించిన యాప్ పేరు 'అంగన్‌సఫర్'."
    ),

    Question(
        questionText: "వర్షపు నీటి సంరక్షణ మరియు నీటి సంరక్షణను ప్రోత్సహించడానికి జల్ శక్తి మంత్రిత్వ శాఖ ఏ చొరవను ప్రారంభించింది?",
        options: [
          "జల్ జీవన్ మిషన్",
          "జల్ సాక్షర్ అభియాన్",
          "జల్ సురక్ష యోజన",
          "జల్ శ్రేష్ట కార్యక్రమం"
        ],
        correctAnswerIndex: 0,
        explanation: "వర్షపు నీటి సంరక్షణ మరియు నీటి సంరక్షణను ప్రోత్సహించడానికి జలశక్తి మంత్రిత్వ శాఖ 'జల్ సాక్షర్ అభియాన్' కార్యక్రమాన్ని ప్రారంభించింది."
    ),

    Question(
        questionText: "15-18 ఏళ్ల వయస్సు వారికి 100% వ్యాక్సినేషన్ కవరేజీని సాధించిన మొదటి భారతీయ రాష్ట్రం/UT ఏది?",
        options: [
          "సిక్కిం",
          "గోవా",
          "లక్షద్వీప్",
          "పుదుచ్చేరి"
        ],
        correctAnswerIndex: 0,
        explanation: "15-18 ఏళ్ల వయస్సు వారికి 100% టీకా కవరేజీని సాధించిన మొదటి భారతీయ రాష్ట్రం/యుటిగా లక్షద్వీప్ అవతరించింది."
    ),

    Question(
        questionText: "పాఠశాల విద్యార్థులలో రహదారి భద్రత గురించి అవగాహన పెంపొందించడానికి విద్యా మంత్రిత్వ శాఖ ఏ చొరవను ప్రారంభించింది?",
        options: [
          "రక్షా మార్గం",
          "సురక్షా మిత్ర",
          "రోడ్ సురక్షా సతి",
          "సురక్షిత పాఠశాల మార్గాలు"
        ],
        correctAnswerIndex: 0,
        explanation: "పాఠశాల విద్యార్థులలో రోడ్డు భద్రత గురించి అవగాహన కల్పించేందుకు విద్యా మంత్రిత్వ శాఖ 'రక్షా పత్' కార్యక్రమాన్ని ప్రారంభించింది."
    ),

    Question(
        questionText: "ఫ్రెంచ్ ఓపెన్ 2023లో పురుషుల సింగిల్స్ టైటిల్‌ను ఎవరు గెలుచుకున్నారు?",
        options: [
          "నొవాక్ జకోవిచ్",
          "రాఫెల్ నాదల్",
          "స్టెఫానోస్ సిట్సిపాస్",
          "మాటియో బెరెట్టిని"
        ],
        correctAnswerIndex: 0,
        explanation: "నొవాక్ జకోవిచ్ ఫ్రెంచ్ ఓపెన్ 2023లో పురుషుల సింగిల్స్ టైటిల్‌ను గెలుచుకున్నాడు."
    ),

    Question(
        questionText: "జులై 2023లో భారత్ వర్సెస్ వెస్టిండీస్ సిరీస్ సందర్భంగా T20 అంతర్జాతీయ మ్యాచ్‌లలో అత్యధిక పరుగులు చేసిన భారతీయ క్రికెటర్ ఎవరు?",
        options: [
          "విరాట్ కోహ్లీ",
          "రోహిత్ శర్మ",
          "కెఎల్ రాహుల్",
          "శిఖర్ ధావన్"
        ],
        correctAnswerIndex: 0,
        explanation: "జూలై 2023లో భారత్ వర్సెస్ వెస్టిండీస్ సిరీస్ సందర్భంగా విరాట్ కోహ్లి T20 ఇంటర్నేషనల్స్‌లో అత్యధిక పరుగులు చేసిన ఆటగాడిగా నిలిచాడు."
    ),

    Question(
        questionText: "వింబుల్డన్ 2023లో మహిళల సింగిల్స్ టైటిల్‌ను ఎవరు గెలుచుకున్నారు?",
        options: [
          "ఆష్లీ బార్టీ",
          "కరోలినా ప్లిస్కోవా",
          "సిమోనా హాలెప్",
          "సెరెనా విలియమ్స్"
        ],
        correctAnswerIndex: 0,
        explanation: "ఆష్లీ బార్టీ వింబుల్డన్ 2023లో మహిళల సింగిల్స్ టైటిల్‌ను గెలుచుకుంది."
    ),

    Question(
        questionText: "ఆసియన్ రెజ్లింగ్ ఛాంపియన్‌షిప్స్ 2023లో ఏ భారతీయ రెజ్లర్ బంగారు పతకాన్ని గెలుచుకున్నారు?",
        options: [
          "బజరంగ్ పునియా",
          "వినీష్ ఫోగట్",
          "సాక్షి మాలిక్",
          "రవి దహియా"
        ],
        correctAnswerIndex: 0,
        explanation: "ఆసియన్ రెజ్లింగ్ ఛాంపియన్‌షిప్స్ 2023లో బజరంగ్ పునియా బంగారు పతకాన్ని గెలుచుకున్నాడు."
    ),

    Question(
        questionText: "అంతర్జాతీయ క్రికెట్‌లో 10,000 పరుగులు చేసిన మొదటి భారతీయ మహిళా క్రికెటర్ ఎవరు?",
        options: [
          "మిథాలీ రాజ్",
          "హర్మన్‌ప్రీత్ కౌర్",
          "స్మృతి మంధాన",
          "ఝులన్ గోస్వామి"
        ],
        correctAnswerIndex: 0,
        explanation: "అంతర్జాతీయ క్రికెట్‌లో 10,000 పరుగులు చేసిన తొలి భారతీయ మహిళా క్రికెటర్‌గా మిథాలీ రాజ్ నిలిచింది."
    ),

    Question(
        questionText: "పారిస్ డైమండ్ లీగ్ 2023లో జావెలిన్ త్రోలో ఏ భారతీయ అథ్లెట్ బంగారు పతకాన్ని గెలుచుకున్నారు?",
        options: [
          "నీరజ్ చోప్రా",
          "అన్నూ రాణి",
          "డ్యూటీ చంద్",
          "హిమ దాస్"
        ],
        correctAnswerIndex: 0,
        explanation: "పారిస్ డైమండ్ లీగ్ 2023లో జావెలిన్ త్రోలో నీరజ్ చోప్రా బంగారు పతకాన్ని గెలుచుకున్నాడు."
    ),

    Question(
        questionText: "US ఓపెన్ 2023లో పురుషుల సింగిల్స్ టైటిల్‌ను ఎవరు గెలుచుకున్నారు?",
        options: [
          "డానియల్ మెద్వెదేవ్",
          "నొవాక్ జకోవిచ్",
          "అలెగ్జాండర్ జ్వెరెవ్",
          "స్టెఫానోస్ సిట్సిపాస్"
        ],
        correctAnswerIndex: 0,
        explanation: "డానియల్ మెద్వెదేవ్ US ఓపెన్ 2023లో పురుషుల సింగిల్స్ టైటిల్‌ను గెలుచుకున్నాడు."
    ),

    Question(
        questionText: "AIBA వరల్డ్ బాక్సింగ్ ఛాంపియన్‌షిప్స్ 2023లో ఏ భారతీయ బాక్సర్ బంగారు పతకాన్ని గెలుచుకున్నాడు?",
        options: [
          "మేరీ కోమ్",
          "మంజు రాణి",
          "పూజా రాణి",
          "లోవ్లినా బోర్గోహైన్"
        ],
        correctAnswerIndex: 0,
        explanation: "AIBA ప్రపంచ బాక్సింగ్ ఛాంపియన్‌షిప్స్ 2023లో మేరీ కోమ్ బంగారు పతకాన్ని గెలుచుకుంది."
    ),


    Question(
        questionText: "ఎలోన్ మస్క్ యొక్క ఆర్టిఫిషియల్ ఇంటెలిజెన్స్ స్టార్టప్, xAI యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
        options: [
          "ప్రధాన సాంకేతిక సంస్థల ఆధిపత్యానికి అంతరాయం కలిగించడానికి.",
          "OpenAI యొక్క ChatGPTకి మద్దతు ఇవ్వడానికి.",
          "అంతరిక్ష అన్వేషణపై దృష్టి పెట్టడానికి.",
          "ఎలక్ట్రిక్ వాహనాలను అభివృద్ధి చేయడానికి."
        ],
        correctAnswerIndex: 0,
        explanation: "XAI యొక్క ప్రాథమిక లక్ష్యం AI పరిశ్రమలో ప్రధాన సాంకేతిక సంస్థల ఆధిపత్యానికి అంతరాయం కలిగించడం."
    ),

    Question(
        questionText: "యూక్లిడ్ స్పేస్ టెలిస్కోప్ ఏమి చేయడానికి రూపొందించబడింది?",
        options: [
          "విశ్వం గురించి మన అవగాహనను విప్లవాత్మకంగా మార్చండి.",
          "సౌర వ్యవస్థను అన్వేషించండి.",
          "భూమి యొక్క త్రిమితీయ మ్యాప్‌ను సృష్టించండి.",
          "మార్స్ వాతావరణాన్ని అధ్యయనం చేయండి."
        ],
        correctAnswerIndex: 0,
        explanation: "యూక్లిడ్ స్పేస్ టెలిస్కోప్ బిలియన్ల గెలాక్సీల explanationాత్మక త్రిమితీయ మ్యాప్‌ను రూపొందించడం ద్వారా విశ్వం గురించి మన అవగాహనలో విప్లవాత్మక మార్పులకు రూపకల్పన చేయబడింది."
    ),

    Question(
        questionText: "గ్రీన్ హైడ్రోజన్ ఎకోసిస్టమ్ కోసం భారతదేశం యొక్క డ్రాఫ్ట్ మరియు రోడ్‌మ్యాప్‌లో కొత్త మరియు పునరుత్పాదక ఇంధన వనరుల మంత్రిత్వ శాఖ యొక్క దృష్టి ఏమిటి?",
        options: [
          "గ్రీన్ హైడ్రోజన్ తయారీ మరియు నిల్వ కోసం పరిశోధన మరియు అభివృద్ధి ప్రాధాన్యతలు.",
          "సాంప్రదాయ శక్తి వనరుల నుండి కార్బన్ ఉద్గారాలను తగ్గించడం.",
          "అణుశక్తి ప్రత్యామ్నాయాలను అన్వేషించడం.",
          "శిలాజ ఇంధన వినియోగాన్ని ప్రోత్సహించడం."
        ],
        correctAnswerIndex: 0,
        explanation: "గ్రీన్ హైడ్రోజన్ తయారీ మరియు నిల్వ కోసం పరిశోధన మరియు అభివృద్ధి ప్రాధాన్యతలను వివరించడంపై దృష్టి కేంద్రీకరించబడింది."
    ),

    Question(
        questionText: "గగన్యాన్ హ్యూమన్ స్పేస్ ఫ్లైట్ మిషన్ కోసం సర్వీస్ మాడ్యూల్ ప్రొపల్షన్ సిస్టమ్‌ను ఎవరు విజయవంతంగా పరీక్షించారు?",
        options: [
          "ఇస్రో.",
          "నాసా.",
          "SpaceX.",
          "ESA."
        ],
        correctAnswerIndex: 0,
        explanation: "గగన్యాన్ హ్యూమన్ స్పేస్ ఫ్లైట్ మిషన్ కోసం సర్వీస్ మాడ్యూల్ ప్రొపల్షన్ సిస్టమ్‌ను ఇస్రో విజయవంతంగా పరీక్షించింది."
    ),

    Question(
        questionText: "మెటా మరియు MeitY స్టార్టప్ హబ్‌తో కలిసి XR స్టార్టప్ ప్రోగ్రామ్‌లో ఏ IT కంపెనీ చేరింది?",
        options: [
          "HCL టెక్.",
          "SpaceX.",
          "ట్విట్టర్.",
          "గూగుల్."
        ],
        correctAnswerIndex: 0,
        explanation: "భారతదేశంలో ఎక్స్‌టెండెడ్ రియాలిటీ (XR) టెక్నాలజీ స్టార్టప్‌లను ప్రోత్సహించడానికి మరియు వేగవంతం చేయడానికి HCL టెక్ XR స్టార్టప్ ప్రోగ్రామ్‌లో చేరింది."
    ),

    Question(
        questionText: "ట్విటర్ యొక్క ఐకానిక్ పక్షి లోగోను ఎలోన్ మస్క్ దేనితో భర్తీ చేశాడు?",
        options: [
          "'X'.",
          "'T'.",
          "'M'.",
          "'బి'."
        ],
        correctAnswerIndex: 0,
        explanation: "ఎలోన్ మస్క్ Twitter యొక్క ఐకానిక్ బర్డ్ లోగోను 'X' అక్షరంతో భర్తీ చేశాడు."
    ),



    Question(
        questionText: "'మాయ, మోడీ, ఆజాద్: దళిత్ పాలిటిక్స్ ఇన్ ది టైమ్ ఆఫ్ హిందుత్వ' పుస్తకాన్ని ఎవరు రచించారు?",
        options: [
          "సుధా పాయ్ & సజ్జన్ కుమార్.",
          "అనితా భరత్ షా.",
          "అభిషేక్ చౌదరి.",
          "TN శేషన్."
        ],
        correctAnswerIndex: 0,
        explanation: "ఈ పుస్తకం 'మాయ, మోడీ, ఆజాద్: హిందూత్వ కాలంలో దళిత రాజకీయాలు' పేరుతో సుధా పాయ్ మరియు సజ్జన్ కుమార్ రచించారు."
    ),

    Question(
        questionText: "ముకుర్తి నేషనల్ పార్క్‌లో వేటను అరికట్టేందుకు ఇటీవల ఏ భారత రాష్ట్రం ప్రయత్నాలు ముమ్మరం చేసింది?",
        options: [
          "తమిళనాడు.",
          "కేరళ.",
          "మహారాష్ట్ర.",
          "ఆంధ్రప్రదేశ్."
        ],
        correctAnswerIndex: 0,
        explanation: "ముకుర్తి నేషనల్ పార్క్‌లో వేటను అరికట్టేందుకు తమిళనాడు అటవీ శాఖ ఇటీవల ప్రయత్నాలు ముమ్మరం చేసింది."
    ),

    Question(
        questionText: "'డా. APJ అబ్దుల్ కలాం: మెమోరీస్ నెవర్ డై' పుస్తకాన్ని ఎవరు విడుదల చేసారు?",
        options: [
          "అమిత్ షా.",
          "నరేంద్ర మోడీ.",
          "అరవింద్ కేజ్రీవాల్.",
          "రంజిత్ ప్రతాప్."
        ],
        correctAnswerIndex: 0,
        explanation: "డా. ఏపీజే అబ్దుల్ కలాం: మెమోరీస్ నెవర్ డై' పుస్తకాన్ని కేంద్ర హోం మంత్రి అమిత్ షా విడుదల చేశారు."

    ),

    Question(
        questionText: "జులై 2023లో పౌర్ణమి ఏ సంఘటనను స్మరించుకుంటుంది?",
        options: [
          "బక్ మూన్.",
          "థండర్ మూన్.",
          "బెర్రీ మూన్.",
          "సాల్మన్ మూన్."
        ],
        correctAnswerIndex: 0,
        explanation: "జులై 2023లో వచ్చే పౌర్ణమిని బక్ మూన్ అని పిలుస్తారు, సంవత్సరంలో ఈ సమయంలో మగ జింక కొమ్ముల పూర్తి పెరుగుదల కారణంగా పేరు పెట్టబడింది."
    ),

    Question(
        questionText: "204వ పుట్టినరోజు వేడుక కోసం గూగుల్ డూడుల్ తన హోమ్‌పేజీలో ఎవరిని గౌరవించింది?",
        options: [
          "యూనిస్ న్యూటన్ ఫుట్.",
          "అస్మా హంజా.",
          "దలైలామా.",
          "J. రాబర్ట్ ఓపెన్‌హైమర్."
        ],
        correctAnswerIndex: 0,
        explanation: "వాతావరణ శాస్త్రానికి ఆమె చేసిన కృషికి గానూ గూగుల్ డూడుల్ యునిస్ న్యూటన్ ఫుట్, ఒక అమెరికన్ శాస్త్రవేత్తను ఆమె 204వ పుట్టినరోజున సత్కరిస్తుంది."

    ),

    Question(
        questionText: "భారతదేశం యొక్క G-20 ప్రెసిడెన్సీ నెలకొల్పిన గిన్నిస్ ప్రపంచ రికార్డు ఏమిటి?",
        options: [
          "లంబాని వస్తువుల అతిపెద్ద ప్రదర్శన.",
          "వేగవంతమైన రాకెట్ ప్రయోగం.",
          "పొడవైన అంతరిక్ష యాత్ర.",
          "అత్యంత అధునాతన AI వ్యవస్థ."
        ],
        correctAnswerIndex: 0,
        explanation: "భారతదేశం యొక్క G-20 ప్రెసిడెన్సీ భారతదేశం యొక్క గొప్ప వారసత్వాన్ని ప్రదర్శిస్తూ లంబానీ వస్తువులను అతిపెద్ద ప్రదర్శనకు గిన్నిస్ ప్రపంచ రికార్డును నెలకొల్పింది."
    ),

    Question(
        questionText: "క్వాంటం కంప్యూటింగ్ రంగంలో మైక్రోసాఫ్ట్ పరిశోధకుల విజయాల దృష్టి ఏమిటి?",
        options: [
          "మజోరానా జీరో మోడ్‌ల సృష్టి.",
          "సాంప్రదాయ కంప్యూటర్ల అభివృద్ధి.",
          "డీప్ లెర్నింగ్ అల్గారిథమ్‌ల అన్వేషణ.",
          "అంతరిక్ష అన్వేషణలో పురోగతి."
        ],
        correctAnswerIndex: 0,
        explanation: "మైక్రోసాఫ్ట్ పరిశోధకులు మజోరానా జీరో మోడ్‌ల సృష్టిలో పురోగతి సాధించడం ద్వారా క్వాంటం కంప్యూటింగ్‌లో ఒక మైలురాయిని సాధించారు."
    ),

    Question(
        questionText: "భారతదేశంలో మొక్కల రకాలు మరియు రైతుల హక్కుల అథారిటీ (PPVFRA) రక్షణ యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
        options: [
          "మొక్క రకాలు మరియు రైతుల హక్కుల పరిరక్షణ.",
          "అటవీ నరికివేతను ప్రోత్సహించడం.",
          "రసాయన వ్యవసాయాన్ని ప్రోత్సహించడం.",
          "వన్యప్రాణుల సంరక్షణను నియంత్రించడం."
        ],
        correctAnswerIndex: 0,
        explanation: "PPVFRA మొక్కల రకాలు, రైతులు మరియు మొక్కల పెంపకందారుల హక్కుల రక్షణ కోసం సమర్థవంతమైన వ్యవస్థను అందిస్తుంది మరియు కొత్త మొక్కల రకాలను అభివృద్ధి చేయడాన్ని ప్రోత్సహిస్తుంది."
    ),

    Question(
        questionText: "ఏ కేంద్రపాలిత ప్రాంతం పౌర-కేంద్రీకృత సేవల మొబైల్ ఆధారిత డెలివరీ కోసం మొబైల్-దోస్త్ యాప్‌ను ప్రారంభించింది?",
        options: [
          "జమ్మూ మరియు కాశ్మీర్.",
          "పుదుచ్చేరి.",
          "చండీగఢ్.",
          "డామన్ మరియు డయ్యూ."
        ],
        correctAnswerIndex: 0,
        explanation: "జమ్మూ మరియు కాశ్మీర్ మొబైల్-దోస్త్ యాప్‌ను మొబైల్ ఆధారిత పౌర-కేంద్రీకృత సేవల డెలివరీ కోసం సమర్థవంతమైన చొరవగా ప్రారంభించింది."
    ),

    Question(
        questionText: "రాజ్యసభ వైస్ చైర్‌పర్సన్‌గా ఎస్ ఫాంగ్నాన్ కొన్యాక్ నామినేషన్ యొక్క చారిత్రక ప్రాముఖ్యత ఏమిటి?",
        options: [
          "మొదటి నాగా మహిళా ఎంపీ.",
          "మొదటి దళిత మహిళా ఎంపీ.",
          "భారత తొలి మహిళా రాష్ట్రపతి.",
          "మొదటి లింగమార్పిడి MP."
        ],
        correctAnswerIndex: 0,
        explanation: "S Phangnon Konyak యొక్క నామినేషన్ చారిత్రాత్మకమైనది, ఎందుకంటే ఆమె రాజ్యసభ వైస్ చైర్‌పర్సన్‌గా నామినేట్ చేయబడిన మొదటి నాగా మహిళా MP."
    ),

    Question(
        questionText: "ముఖ్యమంత్రి అరవింద్ కేజ్రీవాల్ ఆవిష్కరించిన ఢిల్లీలో మొదటి 'వాటర్ ATM' ప్రయోజనం ఏమిటి?",
        options: [
          "పైపు సరఫరా లేని ప్రాంతాల్లో నీటి యాక్సెస్‌ను అందించండి.",
          "నగదు ఉపసంహరణ సేవలను అందించండి.",
          "సంప్రదాయ భారతీయ స్నాక్స్ అమ్మండి.",
          "నీటి వృధాను ప్రోత్సహించండి."
        ],
        correctAnswerIndex: 0,
        explanation: "వాటర్ ATM నీటి ట్యాంకర్లపై ఆధారపడటాన్ని తగ్గించడం ద్వారా పైపుల సరఫరా లేని ప్రాంతాలలో నీటి సదుపాయాన్ని అందించడం లక్ష్యంగా పెట్టుకుంది."

    ),

    Question(
        questionText: "CSIR-IIIM జమ్మూ ప్రారంభించిన భారతదేశపు మొట్టమొదటి గంజాయి ఔషధ ప్రాజెక్ట్ యొక్క దృష్టి ఏమిటి?",
        options: [
          "వైద్య ప్రయోజనాల కోసం గంజాయి యొక్క సంభావ్యతను ఉపయోగించడం.",
          "గంజాయి యొక్క వినోద వినియోగాన్ని ప్రోత్సహించడం.",
          "గంజాయి వాడకాన్ని నిషేధించడం.",
          "ప్రత్యామ్నాయ ఇంధన వనరులను అన్వేషించడం."
        ],
        correctAnswerIndex: 0,
        explanation: "గంజాయి ఔషధం ప్రాజెక్ట్ మానవాళి ప్రయోజనం కోసం, ముఖ్యంగా నరాలవ్యాధి, క్యాన్సర్ మరియు మూర్ఛ ఉన్న రోగులకు గంజాయి యొక్క సామర్థ్యాన్ని ఉపయోగించడం లక్ష్యంగా పెట్టుకుంది."
    ),
    Question(
      questionText: "APJ అబ్దుల్ కలాం ఎవరు, అందించిన వచనంలో ఏ సంఘటన ప్రస్తావించబడింది?",
      options: [
        "APJ అబ్దుల్ కలాం ఒక ప్రసిద్ధ శాస్త్రవేత్త, మరియు టెక్స్ట్ అతని వర్ధంతిని ప్రస్తావిస్తుంది.",
        "APJ అబ్దుల్ కలాం ఒక రాజకీయ నాయకుడు, మరియు టెక్స్ట్ అతను కార్యాలయంలో సాధించిన విజయాలను చర్చిస్తుంది.",
        "APJ అబ్దుల్ కలాం ఒక ప్రసిద్ధ కళాకారుడు, మరియు వచనం అతని గౌరవార్థం ఒక ప్రదర్శనను హైలైట్ చేస్తుంది.",
        "APJ అబ్దుల్ కలాం ఒక అథ్లెట్, మరియు టెక్స్ట్ అతని క్రీడా జీవితాన్ని కవర్ చేస్తుంది."
      ],
      correctAnswerIndex: 0,
      explanation: "APJ అబ్దుల్ కలాం ఒక ప్రసిద్ధ శాస్త్రవేత్త, మరియు టెక్స్ట్ అతని వర్ధంతిని ప్రస్తావిస్తుంది.",
    ),

    Question(
      questionText: "బటగైకా బిలం అంటే ఏమిటి మరియు అది ఎక్కడ ఉంది?",
      options: [
        "బటగైకా క్రేటర్ రష్యా ఫార్ ఈస్ట్‌లోని ఒక అగ్నిపర్వతం.",
        "బటగైకా క్రేటర్ రష్యా ఫార్ ఈస్ట్‌లో శాశ్వత మంచు బిలం.",
        "బటగైకా క్రేటర్ సైబీరియాలోని ఒక లోయ.",
        "బటగైకా బిలం హిమాలయాల్లోని పురాతన సముద్రం."
      ],
      correctAnswerIndex: 1,
      explanation: "బటగైకా క్రేటర్ అనేది రష్యా యొక్క ఫార్ ఈస్ట్‌లో ఉన్న ప్రపంచంలోనే అతిపెద్ద శాశ్వత మంచు బిలం.",
    ),

    Question(
      questionText: "భారతదేశం నుండి మౌంట్ కైలాష్ వ్యూ పాయింట్ ఎప్పుడు అందుబాటులోకి వస్తుంది?",
      options: [
        "సెప్టెంబర్ నాటికి",
        "డిసెంబర్ నాటికి",
        "జనవరి నాటికి",
        "మార్చి నాటికి"
      ],
      correctAnswerIndex: 0,
      explanation: "భారతదేశం నుండి మౌంట్ కైలాష్ వ్యూ పాయింట్ సెప్టెంబర్ నాటికి అందుబాటులోకి వస్తుందని భావిస్తున్నారు.",
    ),

    Question(
      questionText: "మచైల్ మాత యాత్ర ఏ దేవతకు అంకితం చేయబడింది?",
      options: [
        "దుర్గ",
        "లక్ష్మి",
        "సరస్వతి",
        "పార్వతి"
      ],
      correctAnswerIndex: 0,
      explanation: "మచైల్ మాత యాత్ర దుర్గాదేవికి అంకితం చేయబడింది, దీనిని 'కాళి' లేదా 'చండీ' అని కూడా పిలుస్తారు.",
    ),

    Question(
      questionText: "హిమాలయాలకు సంబంధించి ఏ సంచలనాత్మక ఆవిష్కరణ ప్రస్తావించబడింది?",
      options: [
        "పురాతన శిలాజాల ఆవిష్కరణ",
        "కొత్త జాతుల ఆవిష్కరణ",
        "600 మిలియన్ సంవత్సరాల క్రితం నుండి నది బిందువుల ఆవిష్కరణ",
        "గుప్త దేవాలయం ఆవిష్కరణ"
      ],
      correctAnswerIndex: 2,
      explanation: "శాస్త్రజ్ఞులు 600 మిలియన్ సంవత్సరాల క్రితం పురాతన సముద్రం నుండి వచ్చిన హిమాలయాల నుండి రాళ్ళలో నీటి బిందువులను కనుగొన్నారు.",
    ),




    Question(
      questionText: "ఇంటర్నేషనల్ స్పోర్ట్స్ ప్రెస్ అసోసియేషన్ యొక్క ఎగ్జిక్యూటివ్ డైరెక్టర్ ఎవరు?",
      options: [
        "డేవ్ గోరెన్",
        "గ్రెగ్ బార్క్లే",
        "మార్కో లాంబెర్టిని",
        "టెడ్రోస్ అధనామ్"
      ],
      correctAnswerIndex: 0,
      explanation: "ఇంటర్నేషనల్ స్పోర్ట్స్ ప్రెస్ అసోసియేషన్ యొక్క ఎగ్జిక్యూటివ్ డైరెక్టర్ డేవ్ గోరెన్.",
    ),

    Question(
      questionText: "డురాండ్ కప్ ఎప్పుడు స్థాపించబడింది?",
      options: [
        "1924",
        "1937",
        "1954",
        "1988"
      ],
      correctAnswerIndex: 0,
      explanation: "డురాండ్ కప్ 1924లో స్థాపించబడింది.",
    ),

    Question(
      questionText: "2028 నాటికి 6G నెట్‌వర్క్ మరియు సేవలను ఏ దేశం ప్రారంభించబోతోంది?",
      options: [
        "భారతదేశం",
        "చైనా",
        "జపాన్",
        "దక్షిణ కొరియా"
      ],
      correctAnswerIndex: 3,
      explanation: "దక్షిణ కొరియా 2028 నాటికి 6G నెట్‌వర్క్ మరియు సేవలను ప్రారంభించనుంది.",
    ),




    Question(
      questionText: "ప్రపంచ హిందూ కాంగ్రెస్ వ్యవస్థాపకుడు ఎవరు?",
      options: [
        "స్వామి విజ్ఞానానంద",
        "జయ్ షా",
        "డేవ్ గోరెన్",
        "క్రిస్ హిప్కిన్స్"
      ],
      correctAnswerIndex: 0,
      explanation: "ప్రపంచ హిందూ కాంగ్రెస్ స్థాపకుడు స్వామి విజ్ఞానానంద.",
    ),

    Question(
      questionText: "యూరోపియన్ స్పేస్ ఏజెన్సీ డైరెక్టర్ జనరల్ ఎవరు?",
      options: [
        "జోసెఫ్ అష్‌బాచెర్",
        "మైఖేల్ S. డెల్",
        "పాట్రిక్ పి. గెల్సింగర్",
        "జి. కమల వర్ధనరావు"
      ],
      correctAnswerIndex: 0,
      explanation: "యూరోపియన్ స్పేస్ ఏజెన్సీ డైరెక్టర్ జనరల్ జోసెఫ్ అష్‌బాచెర్.",
    ),

    Question(
      questionText: "Google వ్యవస్థాపకులు ఎవరు?",
      options: [
        "లారీ పేజ్, సెర్గీ బ్రిన్",
        "మార్క్ జుకర్బర్గ్",
        "డేవ్ గోరెన్",
        "సి విజయకుమార్"
      ],
      correctAnswerIndex: 0,
      explanation: "గూగుల్ వ్యవస్థాపకులు లారీ పేజ్ మరియు సెర్గీ బ్రిన్.",
    ),




  ];
  int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

  late Timer _examTimer;

  @override
  void initState() {
    super.initState();
    _loadLikedData();
    //_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
    _startriversTimer();
  }
  void _startriversTimer() {
    _examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
      setState(() {
        _elapsedTimeInSeconds++;
      });
    });
  }

  Future<void> _loadLikedData() async {
    // Load liked questions data here
    // ...
  }

  void _nextQuestion() {
    setState(() {
      if (_currentQuestionIndex < _questions.length - 1) {
        _currentQuestionIndex++;
        _selectedAnswerIndex = null;
      } else {
        // All questions have been answered, navigate to results screen
        _navigateToResults();
      }
    });
  }

  void _previousQuestion() {
    setState(() {
      if (_currentQuestionIndex > 0) {
        _currentQuestionIndex--;
        _selectedAnswerIndex = null;
      }
    });
  }

  void _navigateToResults() {
    // Navigate to results screen
    _examTimer.cancel(); // Cancel the exam timer before navigating
    Navigator.of(context).pushReplacement(
      MaterialPageRoute(
        builder: (context) => ResultsScreen(
          userAnswers: _userAnswers,
          questions: _questions,
          elapsedTimeInSeconds: _elapsedTimeInSeconds,
        ),
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
        backgroundColor: Colors.blueAccent,
      ),
      body: GestureDetector(
        onVerticalDragEnd: (details) {
          if (details.velocity.pixelsPerSecond.dy < 0) {
            // Swipe up detected, move to the next question
            _nextQuestion();
          } else if (details.velocity.pixelsPerSecond.dy > 0) {
            // Swipe down detected, move to the previous question
            _previousQuestion();
          }
        },
        onHorizontalDragEnd: (details) {
          if (details.primaryVelocity! > 0) {
            _previousQuestion();
          } else if (details.primaryVelocity! < 0) {
            _nextQuestion();
          }
        },
        child: ListView(
          padding: EdgeInsets.all(16.0),
          children: [
            MyBannerAdWidget(), // Add the banner ad here
            Text(
              "Question ${_currentQuestionIndex + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              _questions[_currentQuestionIndex].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),
            ..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
              final optionIndex = entry.key;
              final optionText = entry.value;
              return InkWell( // Added this InkWell
                onTap: () {
                  setState(() {
                    _selectedAnswerIndex = optionIndex;
                    _userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
                  });
                },
                child: ListTile(
                  title: Text(optionText),
                  leading: Radio<int>(
                    value: optionIndex,
                    groupValue: _selectedAnswerIndex,
                    onChanged: (int? value) {
                      setState(() {
                        _selectedAnswerIndex = value;
                        _userAnswers[_currentQuestionIndex] = value; // Store user's answer
                      });
                    },
                  ),
                ),
              );
            }).toList(),
            // Show correct answer if an option is selected
            // Show correct answer if an option is selected
            if (_selectedAnswerIndex != null)
              Text(
                "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.green, // Set your desired color here
                ),
              ),
            MyBannerAdWidget(), // Add the banner ad here

          ],

        ),
      ),
      bottomNavigationBar: Container(
        color: Colors.red[400],
        child: Theme(
          data: Theme.of(context).copyWith(
            canvasColor: Colors.blueAccent[200],
          ),
          child: BottomNavigationBar(
            type: BottomNavigationBarType.fixed,
            items: const [
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
                label: '',
              ),
            ],
            onTap: (index) {
              if (index == 0) {
                _previousQuestion();
              } else if (index == 1) {
                _nextQuestion();
              }
            },
          ),
        ),
      ),
      // Overall exam timer display

      // Overall exam timer display
      // Overall exam timer display
      persistentFooterButtons: [
        Text(
          'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
      ],

    );
  }
  @override
  void dispose() {
    // Dispose of the exam timer when the widget is disposed
    _examTimer.cancel();
    super.dispose();
  }
}

class ResultsScreen extends StatelessWidget {
  final int elapsedTimeInSeconds;
  final List<int?> userAnswers;
  final List<Question> questions;

  ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


  int calculateScore() {
    int score = 0;
    for (int i = 0; i < questions.length; i++) {
      if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
        score++;
      }
    }
    return score;
  }
  String formatElapsedTime(int seconds) {
    int minutes = seconds ~/ 60;
    int remainingSeconds = seconds % 60;
    return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
  }
  @override
  Widget build(BuildContext context) {
    final int score = calculateScore();
    final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
    return Scaffold(
      appBar: AppBar(
        title: Text("Results"),
        actions: [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text("Completed Time: $completedTime" ),
          ),
        ],
      ),
      body: ListView(
        padding: EdgeInsets.all(16.0),
        children: [
          MyBannerAdWidget(), // Add the banner ad here
          Text(
            "Your Score: $score/${questions.length}",
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16.0),
          for (int i = 0; i < questions.length; i++) ...[
            Text(
              "Question ${i + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              questions[i].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 8.0),
            Text(
              "Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              "Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 16.0),
            Text(
              "Explanation: ${questions[i].explanation}",
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),

          ],
        ],
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: july_te(),
  ));
}
