import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class november_te extends StatefulWidget {
  final String? userIdentifier;

  november_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<november_te> createState() => _november_teState();
}

class _november_teState extends State<november_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(200, null); // Initialize with the number of questions

  List<Question> _questions = [


    Question(
      questionText: "మిస్ యూనివర్స్ 2023 కిరీటం ఎవరు పొందారు?",
      options: [
        "ఆంటోనియా పోర్స్లిడ్",
        "మొరయా విల్సన్",
        "షెన్నిస్ పలాసియోస్",
        "R'Bonney Gabriel"
      ],
      correctAnswerIndex: 2,
      explanation: "నికరాగ్వాకు చెందిన షెన్నిస్ పలాసియోస్ మిస్ యూనివర్స్ 2023 టైటిల్ గెలుచుకున్నారు.",
    ),

    Question(
      questionText: "2023 ICC క్రికెట్ ప్రపంచ కప్‌ను ఏ దేశం గెలుచుకుంది?",
      options: [
        "భారతదేశం",
        "ఆస్ట్రేలియా",
        "శ్రీలంక",
        "న్యూజిలాండ్"
      ],
      correctAnswerIndex: 1,
      explanation: "భారత్‌ను ఓడించడం ద్వారా ఆస్ట్రేలియా ICC క్రికెట్ ప్రపంచ కప్ 2023ను గెలుచుకుంది.",
    ),

    Question(
      questionText: "ICC క్రికెట్ ప్రపంచ కప్ 2023 ఫైనల్‌లో ప్లేయర్ ఆఫ్ ది మ్యాచ్‌గా ఎవరు ప్రకటించబడ్డారు?",
      options: [
        "డేవిడ్ వార్నర్",
        "మహ్మద్ షమీ",
        "ట్రావిస్ హెడ్",
        "మిచెల్ స్టార్క్"
      ],
      correctAnswerIndex: 2,
      explanation: "ఐసిసి క్రికెట్ వరల్డ్ కప్ 2023 ఫైనల్‌లో ట్రావిస్ హెడ్ ప్లేయర్ ఆఫ్ ది మ్యాచ్‌గా ప్రకటించబడ్డాడు.",
    ),

    Question(
      questionText: "ఇంటర్నేషనల్ ఎమ్మీ అవార్డ్స్ 2023లో ఏ భారతీయ హాస్యనటుడి స్టాండ్-అప్ స్పెషల్ బెస్ట్ కామెడీ సిరీస్ అవార్డును గెలుచుకుంది?",
      options: [
        "వీర్ దాస్",
        "కపిల్ శర్మ",
        "గుర్సిమ్రాన్ ఖంబా",
        "అతుల్ ఖత్రి"
      ],
      correctAnswerIndex: 0,
      explanation: "ఇంటర్నేషనల్ ఎమ్మీ అవార్డ్స్ 2023లో వీర్ దాస్ స్టాండ్-అప్ స్పెషల్ 'వీర్ దాస్: ల్యాండింగ్' బెస్ట్ కామెడీ సిరీస్ అవార్డును గెలుచుకుంది.",
    ),

    Question(
      questionText: "సీనియర్ సిటిజన్స్ సేవింగ్స్ స్కీమ్ (SCSS) దేని కోసం రూపొందించబడింది?",
      options: [
        "50 సంవత్సరాల కంటే తక్కువ వయస్సు ఉన్న వ్యక్తులు",
        "60 మరియు అంతకంటే ఎక్కువ వయస్సు గల వ్యక్తులు",
        "ప్రభుత్వ ఉద్యోగులు",
        "55 మరియు అంతకంటే ఎక్కువ వయస్సు గల వ్యక్తులు కానీ 60 కంటే తక్కువ వయస్సు గల వ్యక్తులు"
      ],
      correctAnswerIndex: 3,
      explanation: "SCSS 60 మరియు అంతకంటే ఎక్కువ వయస్సు ఉన్న వ్యక్తులు లేదా 55 మరియు అంతకంటే ఎక్కువ వయస్సు గల ఉద్యోగుల కోసం రూపొందించబడింది, కానీ 60 కంటే తక్కువ.",
    ),
    Question(
      questionText: "72వ మిస్ యూనివర్స్ ఈవెంట్ ఎక్కడ జరిగింది?",
      options: [
        "మనాగ్వా, నికరాగ్వా",
        "శాన్ సాల్వడార్, ఎల్ సాల్వడార్",
        "అహ్మదాబాద్, భారతదేశం",
        "కోల్‌కతా, ఇండియా"
      ],
      correctAnswerIndex: 1,
      explanation: "72వ మిస్ యూనివర్స్ ఈవెంట్ శాన్ సాల్వడార్, ఎల్ సాల్వడార్‌లో ముగిసింది.",
    ),
    Question(
      questionText: "2022లో మిస్ యూనివర్స్ ఎవరు?",
      options: [
        "ఆంటోనియా పోర్స్లిడ్",
        "మొరయా విల్సన్",
        "షెన్నిస్ పలాసియోస్",
        "R'Bonney Gabriel"
      ],
      correctAnswerIndex: 3,
      explanation: "2022లో మిస్ యూనివర్స్ యునైటెడ్ స్టేట్స్‌కు చెందిన ఆర్'బోనీ గాబ్రియేల్.",
    ),
    Question(
      questionText: "72వ మిస్ యూనివర్స్ పోటీలో ఎన్ని దేశాలు మరియు ప్రాంతాలు పాల్గొన్నాయి?",
      options: [
        "72",
        "84",
        "100",
        "50"
      ],
      correctAnswerIndex: 1,
      explanation: "72వ మిస్ యూనివర్స్ పోటీలో 84 దేశాలు మరియు భూభాగాల నుండి పోటీదారులు పాల్గొన్నారు.",
    ),

    Question(
      questionText: "2023లో మిస్ యూనివర్స్ స్టేజ్‌లో ఏ దేశం అరంగేట్రం చేసింది?",
      options: [
        "భారతదేశం",
        "పాకిస్తాన్",
        "నెదర్లాండ్స్",
        "థాయిలాండ్"
      ],
      correctAnswerIndex: 1,
      explanation: "2023లో మిస్ యూనివర్స్ వేదికపై పాకిస్థాన్ అరంగేట్రం చేసింది.",
    ),
    Question(
      questionText: "2023తో సహా ఆస్ట్రేలియా ICC ODI ప్రపంచ కప్‌ని ఎన్నిసార్లు గెలుచుకుంది?",
      options: [
        "4 సార్లు",
        "5 సార్లు",
        "6 సార్లు",
        "7 సార్లు"
      ],
      correctAnswerIndex: 2,
      explanation: "2023తో సహా ఆస్ట్రేలియా 6 సార్లు ICC ODI ప్రపంచ కప్‌ను గెలుచుకుంది.",
    ),

    Question(
      questionText: "ఇంటర్నేషనల్ ఎమ్మీ అవార్డ్స్ 2023లో ఏ షో బెస్ట్ డ్రామా సిరీస్‌ని గెలుచుకుంది?",
      options: [
        "సామ్రాజ్ఞి",
        "లా కైడా",
        "ది రెస్పాండర్",
        "డెర్రీ గర్ల్స్"
      ],
      correctAnswerIndex: 0,
      explanation: "ఇంటర్నేషనల్ ఎమ్మీ అవార్డ్స్ 2023లో ఎంప్రెస్ బెస్ట్ డ్రామా సిరీస్‌ను గెలుచుకుంది.",
    ),
    Question(
      questionText: "ఇంటర్నేషనల్ ఎమ్మీ అవార్డ్స్ 2023లో ఏ షో బెస్ట్ డ్రామా సిరీస్‌ని గెలుచుకుంది?",
      options: [
        "సామ్రాజ్ఞి",
        "లా కైడా",
        "ది రెస్పాండర్",
        "డెర్రీ గర్ల్స్"
      ],
      correctAnswerIndex: 0,
      explanation: "ఇంటర్నేషనల్ ఎమ్మీ అవార్డ్స్ 2023లో ఎంప్రెస్ బెస్ట్ డ్రామా సిరీస్‌ను గెలుచుకుంది.",
    ),
    Question(
      questionText: "సీనియర్ సిటిజన్స్ సేవింగ్స్ స్కీమ్ (SCSS) ఎప్పుడు ప్రారంభించబడింది?",
      options: [
        "2000",
        "2004",
        "2008",
        "2010"
      ],
      correctAnswerIndex: 1,
      explanation: "SCSS 2004లో ప్రారంభించబడింది, సీనియర్ సిటిజన్‌ల కోసం రూపొందించబడింది, వారికి సురక్షితమైన పెట్టుబడి మార్గం మరియు సాధారణ ఆదాయ ప్రవాహాన్ని అందిస్తుంది.",
    ),
    Question(
      questionText: "2022లో గ్లోబల్ ఇంటెలెక్చువల్ ప్రాపర్టీ (IP)లో కీలక ఫలితాలు మరియు ట్రెండ్‌లను ఏ నివేదిక వివరించింది?",
      options: [
        "వరల్డ్ ఎకనామిక్ ఔట్‌లుక్",
        "వరల్డ్ ఇంటెలెక్చువల్ ప్రాపర్టీ ఇండికేటర్స్ (WIPI)",
        "గ్లోబల్ ఇన్నోవేషన్ ఇండెక్స్",
        "ప్రపంచ వాణిజ్య నివేదిక"
      ],
      correctAnswerIndex: 1,
      explanation: "2022లో గ్లోబల్ ఇంటెలెక్చువల్ ప్రాపర్టీ (IP)లో కీలక ఫలితాలు మరియు పోకడలు ప్రపంచ మేధో సంపత్తి సూచికల (WIPI) నివేదికలో వివరించబడ్డాయి.",
    ),
    Question(
      questionText: "2022లో మొత్తం గ్లోబల్ పేటెంట్ అప్లికేషన్‌లలో దాదాపు సగం ఏ దేశం ఖాతాలోకి వచ్చింది?",
      options: [
        "సంయుక్త రాష్ట్రాలు",
        "జపాన్",
        "రిపబ్లిక్ ఆఫ్ కొరియా",
        "చైనా"
      ],
      correctAnswerIndex: 3,
      explanation: "2022లో మొత్తం గ్లోబల్ పేటెంట్ దరఖాస్తుల్లో దాదాపు సగం చైనాదే.",
    ),
    Question(
      questionText: "2022లో పేటెంట్ దరఖాస్తులలో భారతదేశ వృద్ధి రేటు ఎంత?",
      options: [
        "5.3%",
        "11.7%",
        "25.5%",
        "31.6%"
      ],
      correctAnswerIndex: 3,
      explanation: "2022లో పేటెంట్ దరఖాస్తులలో భారతదేశం అసాధారణమైన 31.6% వృద్ధి రేటుతో నిలిచింది.",
    ),
    Question(
      questionText: "మేధో సంపత్తి విధానం, సేవలు, సమాచారం మరియు సహకారం కోసం గ్లోబల్ ఫోరమ్ ఎవరు?",
      options: [
        "ఐక్యరాజ్యసమితి",
        "ప్రపంచ బ్యాంకు",
        "ప్రపంచ ఆరోగ్య సంస్థ",
        "ప్రపంచ మేధో సంపత్తి సంస్థ (WIPO)"
      ],
      correctAnswerIndex: 3,
      explanation: "ప్రపంచ మేధో సంపత్తి సంస్థ (WIPO) అనేది మేధో సంపత్తి విధానం, సేవలు, సమాచారం మరియు సహకారం కోసం ప్రపంచ వేదిక.",
    ),

    Question(
      questionText: "మేధో సంపత్తి విధానం, సేవలు, సమాచారం మరియు సహకారం కోసం గ్లోబల్ ఫోరమ్ ఎవరు?",
      options: [
        "ఐక్యరాజ్యసమితి",
        "ప్రపంచ బ్యాంకు",
        "ప్రపంచ ఆరోగ్య సంస్థ",
        "ప్రపంచ మేధో సంపత్తి సంస్థ (WIPO)"
      ],
      correctAnswerIndex: 3,
      explanation: "ప్రపంచ మేధో సంపత్తి సంస్థ (WIPO) అనేది మేధో సంపత్తి విధానం, సేవలు, సమాచారం మరియు సహకారం కోసం ప్రపంచ వేదిక.",
    ),
    Question(
      questionText: "'మేరా బిల్ మేరా అధికార్' (MBMA) పథకం కింద, పౌరులు వ్యాపారులు లేదా దుకాణదారుల నుండి ఏమి అభ్యర్థించాలి?",
      options: [
        "రాయితీలు",
        "కూపన్లు",
        "బిల్లులు",
        "క్రెడిట్"
      ],
      correctAnswerIndex: 2,
      explanation: "మేరా బిల్ మేరా అధికార్' (MBMA) పథకం కింద, పౌరులు వ్యాపారులు లేదా దుకాణదారుల నుండి బిల్లులను అభ్యర్థించాలి.",
    ),

    Question(
      questionText: "QS ఆసియా యూనివర్సిటీ ర్యాంకింగ్స్ 2024లో ఏ రెండు భారతీయ సంస్థలు టాప్ 50లోపు స్థానాలను పొందాయి?",
      options: [
        "IIT బాంబే మరియు IIT ఢిల్లీ",
        "IIT బాంబే మరియు IIT ఖరగ్‌పూర్",
        "IIT ఢిల్లీ మరియు IIT మద్రాస్",
        "IIT మద్రాస్ మరియు IIT కాన్పూర్"
      ],
      correctAnswerIndex: 0,
      explanation: "IIT బాంబే మరియు IIT ఢిల్లీ రెండూ QS ఆసియా యూనివర్సిటీ ర్యాంకింగ్స్ 2024లో టాప్ 50లోపు స్థానాలను పొందాయి.",
    ),

    Question(
      questionText: "QS ఆసియా యూనివర్సిటీ ర్యాంకింగ్స్ 2024లో IIT బాంబే ర్యాంక్ ఎంత?",
      options: [
        "46",
        "53",
        "40",
        "58"
      ],
      correctAnswerIndex: 2,
      explanation: "IIT బాంబే QS ఆసియా యూనివర్సిటీ ర్యాంకింగ్స్ 2024లో 40వ స్థానాన్ని పొందింది.",
    ),

    Question(
      questionText: "QS ఆసియా యూనివర్శిటీ ర్యాంకింగ్స్ 2024లో అత్యధిక సంఖ్యలో విశ్వవిద్యాలయాలు ఏ దేశంలో ఉన్నాయి?",
      options: [
        "ముఖ్య ప్రదేశం చైనా",
        "జపాన్",
        "భారతదేశం",
        "దక్షిణ కొరియా"
      ],
      correctAnswerIndex: 2,
      explanation: "QS ఆసియా యూనివర్శిటీ ర్యాంకింగ్స్ 2024లో భారతదేశం అత్యధిక సంఖ్యలో విశ్వవిద్యాలయాలను కలిగి ఉంది, మొత్తం 148 ఉన్నాయి.",
    ),

    Question(
      questionText: "వరుసగా రెండవ సంవత్సరం ఆసియాలో ఏ విశ్వవిద్యాలయం తన టాప్ ర్యాంక్‌ను నిలుపుకుంది?",
      options: [
        "యూనివర్సిటీ ఆఫ్ హాంకాంగ్ (HKU)",
        "నేషనల్ యూనివర్శిటీ ఆఫ్ సింగపూర్ (NUS)",
        "పెకింగ్ విశ్వవిద్యాలయం",
        "సింగువా విశ్వవిద్యాలయం"
      ],
      correctAnswerIndex: 2,
      explanation: "పెకింగ్ యూనివర్శిటీ ఆఫ్ చైనా వరుసగా రెండవ సంవత్సరం ఆసియాలో తన టాప్ ర్యాంక్‌ను నిలుపుకుంది.",
    ),

    Question(
      questionText: "యునెస్కో యొక్క క్రియేటివ్ సిటీస్ నెట్‌వర్క్‌లో ఏ భారతీయ నగరాలు చేరాయి?",
      options: [
        "కోజికోడ్ మరియు ముంబై",
        "ఢిల్లీ మరియు గ్వాలియర్",
        "కోజికోడ్ మరియు గ్వాలియర్",
        "ముంబై మరియు చెన్నై"
      ],
      correctAnswerIndex: 2,
      explanation: "కోజికోడ్ మరియు గ్వాలియర్ యునెస్కో యొక్క క్రియేటివ్ సిటీస్ నెట్‌వర్క్‌లో చేరారు.",
    ),

    Question(
      questionText: "UNESCO క్రియేటివ్ సిటీస్ నెట్‌వర్క్‌లో కోజికోడ్ యొక్క హోదా ఏమిటి?",
      options: [
        "సిటీ ఆఫ్ మ్యూజిక్",
        "సాహిత్య నగరం",
        "సిటీ ఆఫ్ ఆర్ట్స్",
        "సిటీ ఆఫ్ హెరిటేజ్"
      ],
      correctAnswerIndex: 1,
      explanation: "యునెస్కో క్రియేటివ్ సిటీస్ నెట్‌వర్క్‌లో కోజికోడ్ 'సిటీ ఆఫ్ లిటరేచర్'గా గుర్తించబడింది.",
    ),

    Question(
      questionText: "యునెస్కో క్రియేటివ్ సిటీస్ నెట్‌వర్క్‌లో భారతదేశంలోని ఏ నగరాన్ని 'సిటీ ఆఫ్ మ్యూజిక్' అని పిలుస్తారు?",
      options: [
        "వారణాసి",
        "ఢిల్లీ",
        "ముంబయి",
        "గ్వాలియర్"
      ],
      correctAnswerIndex: 3,
      explanation: "గ్వాలియర్ యునెస్కో క్రియేటివ్ సిటీస్ నెట్‌వర్క్‌లో 'సిటీ ఆఫ్ మ్యూజిక్'గా గుర్తించబడింది.",
    ),

    Question(
      questionText: "'విజన్ ఇండియా@2047' ప్రణాళిక యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
      options: [
        "మధ్య-ఆదాయ స్థితిని సాధించడానికి",
        "2047 నాటికి భారతదేశాన్ని అభివృద్ధి చెందిన దేశంగా మార్చడం",
        "సామాజిక అభివృద్ధిపై మాత్రమే దృష్టి పెట్టడం",
        "ఆర్థిక వృద్ధిని నిరోధించడానికి"
      ],
      correctAnswerIndex: 1,
      explanation: "విజన్ ఇండియా@2047' ప్రణాళిక యొక్క ప్రాథమిక లక్ష్యం 2047 నాటికి భారతదేశాన్ని అభివృద్ధి చెందిన దేశంగా మార్చడం మరియు మధ్య-ఆదాయ ఉచ్చును నివారించడం.",
    ),

    Question(
      questionText: "విజన్ ఇండియా@2047' ప్లాన్‌పై ఏ ప్రభుత్వ థింక్ ట్యాంక్ పని చేస్తోంది?",
      options: [
        "ఇస్రో",
        "DRDO",
        "నీతి ఆయోగ్",
        "ఆర్థిక మంత్రిత్వ శాఖ"
      ],
      correctAnswerIndex: 2,
      explanation: "నీతి ఆయోగ్, ప్రభుత్వ థింక్ ట్యాంక్, 'విజన్ ఇండియా@2047' ప్రణాళికపై పని చేస్తోంది.",
    ),
    Question(
      questionText: "QS ఆసియా యూనివర్సిటీ ర్యాంకింగ్స్ 2024లో ఎన్ని విభిన్న దేశాలు మరియు భూభాగాలు ఉన్నాయి?",
      options: [
        "20",
        "25",
        "30",
        "15"
      ],
      correctAnswerIndex: 1,
      explanation: "QS ఆసియా యూనివర్సిటీ ర్యాంకింగ్స్ 2024 25 విభిన్న దేశాలు మరియు భూభాగాలను కలిగి ఉంది.",
    ),

    Question(
      questionText: "2047 నాటికి భారతదేశ ప్రణాళికలో ఆర్థిక లక్ష్యం ఏమిటి?",
      options: [
        "\$20 ట్రిలియన్",
        "\$25 ట్రిలియన్",
        "\$30 ట్రిలియన్",
        "\$35 ట్రిలియన్"
      ],
      correctAnswerIndex: 2,
      explanation: "2047 నాటికి భారతదేశాన్ని \$30 ట్రిలియన్ల ఆర్థిక వ్యవస్థగా తీర్చిదిద్దేందుకు ప్రణాళిక రూపొందించింది.",
    ),

    Question(
      questionText: "ఏ భారతీయ రాష్ట్రం నవంబర్ 1, 1966న ఆవిర్భావ దినోత్సవాన్ని జరుపుకుంటుంది మరియు ఏ భాషా విభజన దాని సృష్టికి దారితీసింది?",
      options: [
        "కర్ణాటక, సాంస్కృతిక గుర్తింపు ఆధారంగా",
        "పంజాబ్, భాషా గుర్తింపు ఆధారంగా",
        "హర్యానా, ప్రాంతీయ గుర్తింపు ఆధారంగా",
        "చారిత్రక ప్రాముఖ్యత ఆధారంగా మధ్యప్రదేశ్"
      ],
      correctAnswerIndex: 1,
      explanation: "పంజాబ్ నవంబర్ 1, 1966న దాని ఆవిర్భావ దినోత్సవాన్ని జరుపుకుంటుంది మరియు దాని సృష్టి భాషా గుర్తింపుపై ఆధారపడింది.",
    ),
    Question(
      questionText: "ఎడెల్ గివ్ హురున్ ఇండియా ఫిలాంత్రోపీ లిస్ట్ 2023లో ఎవరు అగ్రస్థానంలో నిలిచారు?",
      options: [
        "అజీమ్ ప్రేమ్ జీ అండ్ ఫ్యామిలీ",
        "ముఖేష్ అంబానీ అండ్ ఫ్యామిలీ",
        "గౌతమ్ అదానీ అండ్ ఫ్యామిలీ",
        "శివ్ నాడార్ మరియు కుటుంబం"
      ],
      correctAnswerIndex: 3,
      explanation: "ఎడెల్‌గివ్ హురున్ ఇండియా ఫిలాంత్రోపీ లిస్ట్ 2023లో శివ్ నాడార్ మరియు ఫ్యామిలీ అగ్రస్థానాన్ని పొందారు.",
    ),

    Question(
      questionText: "2023లో ఏ ఆటగాడు ఎనిమిదో బ్యాలన్ డి'ఓర్‌ను పొందాడు మరియు అతను ఏ రికార్డును నెలకొల్పాడు?",
      options: [
        "క్రిస్టియానో రొనాల్డో, 5 సార్లు విజేత",
        "లియోనెల్ మెస్సీ, 7 సార్లు విజేత",
        "లియోనెల్ మెస్సీ, 8 సార్లు విజేత",
        "ఎర్లింగ్ హాలాండ్, తొలి విజేత"
      ],
      correctAnswerIndex: 2,
      explanation: "లియోనెల్ మెస్సీ 2023లో ఎనిమిదవ బాలన్ డి'ఓర్‌ను సాధించి, కొత్త రికార్డును నెలకొల్పాడు.",
    ),

    Question(
      questionText: "ప్రపంచపు అత్యుత్తమ గోల్ కీపర్‌గా లెవ్ యాషిన్ అవార్డుతో ఎవరు గుర్తింపు పొందారు?",
      options: [
        "లియోనెల్ మెస్సీ",
        "ఎర్లింగ్ హాలాండ్",
        "ఎమిలియానో మార్టినెజ్",
        "ఐతన బొన్మతి"
      ],
      correctAnswerIndex: 2,
      explanation: "ఎమిలియానో మార్టినెజ్ ప్రపంచంలోని అత్యుత్తమ గోల్ కీపర్‌గా లెవ్ యాషిన్ అవార్డుతో గుర్తింపు పొందాడు.",
    ),
    Question(
      questionText: "మానవతావాద పనిని గుర్తించినందుకు వినిసియస్ జూనియర్ ఏ అవార్డును అందుకున్నాడు?",
      options: [
        "బాలన్ డి'ఓర్ ఫెమినిన్",
        "కోపా ట్రోఫీ",
        "యాచిన్ ట్రోఫీ",
        "సోక్రటీస్ అవార్డు"
      ],
      correctAnswerIndex: 3,
      explanation: "వినిసియస్ జూనియర్ మానవతావాద పనిని గుర్తించినందుకు సోక్రటీస్ అవార్డును అందుకున్నాడు.",
    ),
    Question(
      questionText: "రాష్ట్ర ఆహార భద్రత సూచిక 2022-2023లో ఏ కొత్త పరామితి ప్రవేశపెట్టబడింది?",
      options: [
        "వినియోగదారుల సాధికారత",
        "అనుకూలత",
        "SFSI ర్యాంక్‌లో మెరుగుదల",
        "ఆహార పరీక్ష మౌలిక సదుపాయాలు"
      ],
      correctAnswerIndex: 2,
      explanation: "రాష్ట్ర ఆహార భద్రత సూచిక 2022-2023లో ప్రవేశపెట్టిన కొత్త పరామితి 'SFSI ర్యాంక్‌లో మెరుగుదల'",
    ),
    Question(
      questionText: "స్టేట్ ఫుడ్ సేఫ్టీ ఇండెక్స్ 2022-2023 ప్రకారం 'SFSI ర్యాంక్‌లో మెరుగుదల' పరామితిలో ఏ రాష్ట్రం గణనీయమైన మెరుగుదలను చూపింది?",
      options: [
        "మహారాష్ట్ర",
        "గుజరాత్",
        "పంజాబ్",
        "తమిళనాడు"
      ],
      correctAnswerIndex: 2,
      explanation: "స్టేట్ ఫుడ్ సేఫ్టీ ఇండెక్స్ 2022-2023 ప్రకారం 'SFSI ర్యాంక్‌లో మెరుగుదల' పరామితిలో పంజాబ్ గణనీయమైన మెరుగుదలని చూపింది.",
    ),
    Question(
      questionText: "క్రింది క్రికెట్ మాస్ట్రోలలో ఇటీవల ఎవరు ICC క్రికెట్ హాల్ ఆఫ్ ఫేమ్‌లోకి ప్రవేశించారు?",
      options: [
        "సచిన్ టెండూల్కర్",
        "వీరేంద్ర సెహ్వాగ్",
        "బ్రియాన్ లారా",
        "రికీ పాంటింగ్"
      ],
      correctAnswerIndex: 1,
      explanation: "వీరేంద్ర సెహ్వాగ్ ఇటీవలే ICC క్రికెట్ హాల్ ఆఫ్ ఫేమ్‌లోకి ప్రవేశించాడు.",
    ),
    Question(
      questionText: "పాల్ లించ్ రచించిన 'ప్రవక్త పాట' నవల యొక్క ప్రాథమిక దృష్టి ఏమిటి?",
      options: [
        "శృంగార సంబంధాలు",
        "ఐర్లాండ్‌లో అంతర్యుద్ధం",
        "గ్లోబల్ ఎకనామిక్ క్రైసిస్",
        "పర్యావరణ పరిరక్షణ"
      ],
      correctAnswerIndex: 1,
      explanation: "పాల్ లించ్ రచించిన 'ప్రవక్త పాట' నవల యొక్క ప్రాథమిక దృష్టి ఐర్లాండ్‌లో అంతర్యుద్ధం.",
    ),

    Question(
      questionText: "భౌగోళిక సూచిక ట్యాగ్‌తో గుర్తించబడిన ఉత్తరాఖండ్ నుండి ఏ ఉత్పత్తి హిమాలయన్ రేగుట ఫైబర్‌లతో తయారు చేయబడింది?",
      options: [
        "బెరినాగ్ టీ",
        "బిచ్చు బుటీ ఫ్యాబ్రిక్స్",
        "ఉత్తరాఖండ్ మాండువా",
        "ఝంగోరా"
      ],
      correctAnswerIndex: 1,
      explanation: "ఉత్తరాఖండ్‌కు చెందిన బిచ్చు బుటీ బట్టలు భౌగోళిక సూచిక ట్యాగ్‌తో గుర్తించబడ్డాయి మరియు హిమాలయన్ రేగుట ఫైబర్‌లతో తయారు చేయబడ్డాయి.",
    ),

    Question(
      questionText: "ఉత్తరాఖండ్ నుండి బెరినాగ్ టీని తయారు చేయడంలో ప్రత్యేకమైన ప్రక్రియ ఏమిటి?",
      options: [
        "కిణ్వ ప్రక్రియ",
        "ఆకులను ఘన ద్రవ్యరాశిగా కుదించడం",
        "అధిక ఉష్ణోగ్రతల వద్ద కాల్చడం",
        "ఫ్రీజ్-ఎండబెట్టడం"
      ],
      correctAnswerIndex: 1,
      explanation: "ఉత్తరాఖండ్ నుండి బెరినాగ్ టీని తయారు చేయడంలో ప్రత్యేకమైన ప్రక్రియ ఆకులను ఘన ద్రవ్యరాశిగా కుదించడం.",
    ),
    Question(
      questionText: "ఉత్తరాఖండ్ లాల్ చావల్‌ను ఏది ప్రత్యేకం చేస్తుంది?",
      options: [
        "ఇది పురోలా ప్రాంతంలో సేంద్రీయంగా పండిస్తారు",
        "ఇది ఒక నల్ల సోయాబీన్",
        "ఇది రెడ్ రైస్ వేరియంట్",
        "ఇది హిమాలయన్ రేగుట ఫైబర్స్ నుండి తయారు చేయబడింది"
      ],
      correctAnswerIndex: 2,
      explanation: "ఉత్తరాఖండ్ లాల్ చావల్ ఎర్ర బియ్యం రకం, మరియు దీనిని పురోలా ప్రాంతంలో సేంద్రీయంగా పండిస్తారు.",
    ),

    Question(
      questionText: "నవంబర్ 1, 1956న ఏ రాష్ట్రం పేరు కర్ణాటకగా మార్చబడింది?",
      options: [
        "తమిళనాడు",
        "ఆంధ్రప్రదేశ్",
        "మైసూర్",
        "కేరళ"
      ],
      correctAnswerIndex: 2,
      explanation: "నవంబర్ 1, 1956న, మైసూర్ రాష్ట్రం కర్ణాటకగా పేరు మార్చబడింది.",
    ),

    Question(
      questionText: "ఏ కేంద్రపాలిత ప్రాంతం నవంబర్ 1, 1956న దాని ప్రత్యేక వలస చరిత్ర మరియు సంస్కృతిని హైలైట్ చేస్తూ ఏర్పాటైంది?",
      options: [
        "డామన్ మరియు డయ్యూ",
        "చండీగఢ్",
        "పుదుచ్చేరి",
        "లక్షద్వీప్"
      ],
      correctAnswerIndex: 2,
      explanation: "పాండిచ్చేరి అని కూడా పిలువబడే పుదుచ్చేరి, దాని ప్రత్యేక వలస చరిత్ర మరియు సంస్కృతిని హైలైట్ చేస్తూ నవంబర్ 1, 1956న సృష్టించబడింది.",
    ),
    Question(
      questionText: "EdelGive హురున్ ఇండియా ఫిలాంత్రోపీ లిస్ట్ 2023 ప్రకారం, ₹5 కోట్లకు మించి విరాళాలు ఇచ్చే భారతీయుల సంఖ్య గణనీయంగా పెరిగింది?",
      options: [
        "30%",
        "50%",
        "59%",
        "75%"
      ],
      correctAnswerIndex: 2,
      explanation: "EdelGive హురున్ ఇండియా ఫిలాంత్రోపీ లిస్ట్ 2023 ప్రకారం, ₹5 కోట్ల కంటే ఎక్కువ విరాళాలు ఇచ్చే భారతీయుల సంఖ్యలో 59% గణనీయమైన పెరుగుదల ఉంది.",
    ),


    Question(
      questionText: "గత సంవత్సరం 'ది సెవెన్ మూన్స్ ఆఫ్ మాలి అల్మేడా' కోసం బుకర్ బహుమతిని ఎవరు గెలుచుకున్నారు?",
      options: [
        "షెహన్ కరుణతిలక",
        "అన్నా బర్న్స్",
        "లించ్",
        "మైఖేల్ డగ్లస్"
      ],
      correctAnswerIndex: 0,
      explanation: "గత సంవత్సరం 'ది సెవెన్ మూన్స్ ఆఫ్ మాలి అల్మేడా' కోసం షెహన్ కరుణతిలక బుకర్ ప్రైజ్ గెలుచుకున్నారు.",
    ),

    Question(
      questionText: "2023లో ఏ నవల బుకర్ ప్రైజ్ గెలుచుకుంది?",
      options: [
        "ది బీ స్టింగ్",
        "వెస్ట్రన్ లేన్",
        "ప్రవక్త పాట",
        "దిస్ అదర్ ఈడెన్",
      ],
      correctAnswerIndex:2,
      explanation: "2023లో బుకర్ ప్రైజ్ గెలుచుకున్న నవల గురించిన సమాచారం.",
    ),

    Question(
      questionText: "ఇటీవల ఏ దేశానికి చెందిన ఆంగ్‌కోర్ వాట్ ప్రపంచంలోని 8వ అద్భుతం అనే బిరుదును పొందింది?",
      options: [
        "కంబోడియా",
        "ఇటలీ",
        "శ్రీలంక",
        "భారతదేశం"
      ],
      correctAnswerIndex: 0,
      explanation: "కంబోడియాలో ఉన్న ఆంగ్కోర్ వాట్ ఇటీవలే ప్రపంచంలోని 8వ అద్భుతం అనే బిరుదును పొందింది.",
    ),

    Question(
      questionText: "ఐఎఫ్‌ఎఫ్‌ఐ 2023లో 'ఎండ్‌లెస్ బోర్డర్స్' చిత్రానికి గోల్డెన్ పీకాక్‌ను ఎవరు గెలుచుకున్నారు?",
      options: [
        "రిషబ్ శెట్టి",
        "పూరియా రహీమి సామ్",
        "మెలానీ థియరీ",
        "మైఖేల్ డగ్లస్"
      ],
      correctAnswerIndex: 1,
      explanation: "'ఎండ్‌లెస్ బోర్డర్స్' IFFI 2023లో గోల్డెన్ పీకాక్‌ని గెలుచుకుంది మరియు ఆ చిత్రానికి ఉత్తమ నటుడిగా పూరియా రహిమి సామ్ అవార్డును గెలుచుకున్నారు.",
    ),

    Question(
      questionText: "COP28 ఎక్కడ జరగాలి?",
      options: [
        "గోవా, ఇండియా",
        "దుబాయ్, యుఎఇ",
        "గ్లాస్గో, UK",
        "శ్రీలంక"
      ],
      correctAnswerIndex: 1,
      explanation: "COP28 దుబాయ్, యునైటెడ్ అరబ్ ఎమిరేట్స్‌లో జరగాల్సి ఉంది.",
    ),

    Question(
      questionText: "ఇటీవల ఏ చారిత్రక ప్రదేశం ఇటలీలోని పాంపీని అధిగమించి ప్రపంచంలోని 8వ అద్భుతం అనే బిరుదును పొందింది?",
      options: [
        "అంగ్కోర్ వాట్",
        "ది బీ స్టింగ్",
        "వెస్ట్రన్ లేన్",
        "ప్రవక్త పాట"
      ],
      correctAnswerIndex: 0,
      explanation: "కంబోడియాలో ఉన్న ఆంగ్కోర్ వాట్ ఇటీవలే ప్రపంచంలోని 8వ అద్భుతం అనే బిరుదును పొందింది.",
    ),

    Question(
      questionText: "IFFI 2023లో అవార్డు గెలుచుకున్న మొదటి కన్నడ చిత్రం ఏది?",
      options: [
        "అంతులేని సరిహద్దులు",
        "కాంతారా",
        "ఫూల్స్ పార్టీ",
        "ది ఫెదర్ వెయిట్"
      ],
      correctAnswerIndex: 1,
      explanation: "ఐఎఫ్‌ఎఫ్‌ఐ 2023లో అవార్డు గెలుచుకున్న మొదటి కన్నడ చిత్రంగా 'కాంతారా' చరిత్ర సృష్టించింది.",
    ),
    Question(
      questionText: "IFFI 2023లో సత్యజిత్ రే లైఫ్‌టైమ్ అచీవ్‌మెంట్ అవార్డుతో ఎవరు సత్కరించబడ్డారు?",
      options: [
        "మైఖేల్ డగ్లస్",
        "రిషబ్ శెట్టి",
        "పూరియా రహీమి సామ్",
        "రాబర్ట్ కొలోడ్నీ"
      ],
      correctAnswerIndex: 0,
      explanation: "ఐఎఫ్‌ఎఫ్‌ఐ 2023లో మైఖేల్ డగ్లస్‌ను సత్యజిత్ రే లైఫ్‌టైమ్ అచీవ్‌మెంట్ అవార్డుతో సత్కరించారు.",
    ),
    Question(
      questionText: "2050 నాటికి 'నెట్-జీరో ఎమిషన్స్' ఏమి సాధించాలని లక్ష్యంగా పెట్టుకుంది?",
      options: [
        "గ్రీన్‌హౌస్ వాయు ఉద్గారాలను పెంచండి",
        "2050 నాటికి గ్రీన్‌హౌస్ వాయువుల విడుదలను వాటి తొలగింపుతో సమతుల్యం చేయండి",
        "వాతావరణ మార్పు యొక్క పరిణామాలను విస్మరించండి",
        "అటవీ నరికివేతను ప్రోత్సహించండి"
      ],
      correctAnswerIndex: 1,
      explanation: "2050 నాటికి నికర-సున్నా ఉద్గారాలు' గ్రీన్‌హౌస్ వాయువుల విడుదలను 2050 నాటికి వాటి తొలగింపుతో సమతుల్యం చేయడం లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "రాజు సూర్యవర్మన్ II ఎవరు మరియు అతను దేనికి ప్రసిద్ధి చెందాడు?",
      options: [
        "ఒక ప్రముఖ హాలీవుడ్ నటుడు",
        "ది ఫెదర్ వెయిట్' దర్శకుడు",
        "అంగ్కోర్ వాట్ నిర్మాణానికి ప్రసిద్ధి చెందిన ఖైమర్ సామ్రాజ్యం యొక్క రాజు",
        "ఐఎఫ్‌ఎఫ్‌ఐ 2023లో భారతీయ చలనచిత్ర నిర్మాత గౌరవించబడ్డారు"
      ],
      correctAnswerIndex: 2,
      explanation: "సూర్యవర్మన్ II ఖైమర్ సామ్రాజ్యం యొక్క రాజు, అంగ్కోర్ వాట్ ఆలయ సముదాయాన్ని నిర్మించడంలో ప్రసిద్ధి చెందాడు.",
    ),
    Question(
      questionText: "అంగ్కోర్ వాట్ యొక్క చారిత్రక ప్రాముఖ్యత ఏమిటి?",
      options: [
        "ఇది ఒక ప్రధాన రాజకీయ సంఘర్షణకు వేదిక",
        "ఇది ఖైమర్ సామ్రాజ్యానికి రాజధానిగా పనిచేసింది",
        "ఇది హిందూ దేవాలయం నుండి బౌద్ధ అభయారణ్యంగా రూపాంతరం చెందింది",
        "ఇది 18వ శతాబ్దంలో నిర్మించబడింది"
      ],
      correctAnswerIndex: 2,
      explanation: "అంగ్కోర్ వాట్ యొక్క చారిత్రక ప్రాముఖ్యత హిందూ దేవాలయం నుండి బౌద్ధ అభయారణ్యంగా మార్చడాన్ని కలిగి ఉంటుంది.",
    ),

    Question(
      questionText: "అంగ్కోర్ వాట్ గోడలపై ఏమి చిత్రీకరించబడింది?",
      options: [
        "అర్థం లేని యాదృచ్ఛిక చిత్రాలు",
        "హిందూ ఇతిహాసాలు, చారిత్రక సంఘటనలు మరియు ఖైమర్ ప్రజల రోజువారీ జీవితంలో దృశ్యాలు",
        "రాజకీయ ప్రచారం",
        "నైరూప్య కళ"
      ],
      correctAnswerIndex: 1,
      explanation: "అంగ్కోర్ వాట్ గోడలు హిందూ ఇతిహాసాలు, చారిత్రక సంఘటనలు మరియు రోజువారీ జీవితంలోని దృశ్యాలను వర్ణించే explanationాత్మక బాస్-రిలీఫ్‌లతో అలంకరించబడ్డాయి.",
    ),

    Question(
      questionText: "RBI సమీక్ష ప్రకారం ప్రాంతీయ గ్రామీణ బ్యాంకులకు (RRB) కొత్త బల్క్ డిపాజిట్ పరిమితి ఏమిటి?",
      options: [
        "రూ. 10 లక్షలు",
        "రూ. 25 లక్షలు",
        "రూ. 50 లక్షలు",
        "రూ. 1 కోటి"
      ],
      correctAnswerIndex: 3,
      explanation: "RBI సమీక్ష ప్రకారం RRBలకు బల్క్ డిపాజిట్ పరిమితి రూ. 15 లక్షల నుండి రూ. 1 కోటికి పెంచబడింది.",
    ),
    Question(
      questionText: "ఫిబ్రవరి 1, 2024 నుండి ఏ రెండు బ్యాంకులు విలీనం కాబోతున్నాయి?",
      options: [
        "ఫిన్‌కేర్ స్మాల్ ఫైనాన్స్ బ్యాంక్ మరియు HDFC బ్యాంక్",
        "AU స్మాల్ ఫైనాన్స్ బ్యాంక్ మరియు ICICI బ్యాంక్",
        "యాక్సిస్ బ్యాంక్ మరియు కోటక్ మహీంద్రా బ్యాంక్",
        "ఫిన్‌కేర్ స్మాల్ ఫైనాన్స్ బ్యాంక్ మరియు AU స్మాల్ ఫైనాన్స్ బ్యాంక్"
      ],
      correctAnswerIndex: 3,
      explanation: "ఫిన్‌కేర్ స్మాల్ ఫైనాన్స్ బ్యాంక్ ఫిబ్రవరి 1, 2024 నుండి AU స్మాల్ ఫైనాన్స్ బ్యాంక్‌తో విలీనం కానుంది.",
    ),

    Question(
      questionText: "రిలయన్స్ రిటైల్ సహకారంతో SBI కార్డ్ ప్రవేశపెట్టిన కో-బ్రాండెడ్ క్రెడిట్ కార్డ్ పేరు ఏమిటి?",
      options: [
        "SBI-రిటైల్ కార్డ్",
        "రిలయన్స్-SBI గోల్డ్ కార్డ్",
        "SBI-రిలయన్స్ లైఫ్‌స్టైల్ కార్డ్",
        "రిలయన్స్ SBI కార్డ్"
      ],
      correctAnswerIndex: 3,
      explanation: "SBI కార్డ్ రిలయన్స్ రిటైల్ సహకారంతో కో-బ్రాండెడ్ రిలయన్స్ SBI కార్డ్‌ను పరిచయం చేసింది.",
    ),

    Question(
      questionText: "నేషనల్ పెన్షన్ సిస్టమ్ (NPS) ఉపసంహరణల కోసం పెన్షన్ ఫండ్ రెగ్యులేటరీ అండ్ డెవలప్‌మెంట్ అథారిటీ (PFRDA) ఏ కొత్త నియమ మార్పులను ప్రవేశపెట్టింది?",
      options: [
        "పదవీ విరమణ నిధుల నిర్వహణలో తగ్గిన వశ్యత",
        "NPS ఫండ్ ఉపసంహరణల కోసం 'పెన్నీ డ్రాప్' ధృవీకరణ పరిచయం",
        "NPS ఉపసంహరణ నియమాలలో మార్పులు లేవు",
        "NPS చందాదారులకు తప్పనిసరి వార్షిక కొనుగోలు"
      ],
      correctAnswerIndex: 1,
      explanation: "PFRDA 'పెన్నీ డ్రాప్' ధృవీకరణను ప్రవేశపెట్టింది మరియు NPS ఉపసంహరణల కోసం పదవీ విరమణ నిధుల నిర్వహణలో వశ్యతను పెంచింది.",
    ),

    Question(
      questionText: "రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) జిల్లా కేంద్ర సహకార బ్యాంకుల (DCCBలు) గురించి ఏ ముఖ్యమైన ప్రకటన చేసింది?",
      options: [
        "అనుమతి లేకుండా శాఖలను తెరవడానికి వారికి అనుమతి ఉంది",
        "వారు ఇప్పుడు ముందస్తు RBI అనుమతి లేకుండానే వేతనం లేని శాఖలను మూసివేయవచ్చు",
        "అవి ఇతర బ్యాంకులతో విలీనం కావాలి",
        "వారు వారి స్వంత కరెన్సీని జారీ చేయవచ్చు"
      ],
      correctAnswerIndex: 1,
      explanation: "DCCBలు ఇప్పుడు RBI నుండి ముందస్తు అనుమతి తీసుకోకుండానే వేతనం లేని శాఖలను మూసివేయడానికి అనుమతించబడ్డాయి.",
    ),

    Question(
      questionText: "సరిహద్దు చెల్లింపు లావాదేవీలను సులభతరం చేసే సంస్థలకు సంబంధించి RBI నుండి ఇటీవలి ఆదేశం ఏమిటి?",
      options: [
        "వారు భారతదేశంలో పనిచేయకుండా నిషేధించబడ్డారు",
        "వారు నెలవారీ నివేదికలను RBIకి సమర్పించాలి",
        "వారు అంతర్జాతీయ ద్రవ్య నిధి (IMF)లో నమోదు చేసుకోవాలి",
        "వాటిని నేరుగా RBI నియంత్రిస్తుంది"
      ],
      correctAnswerIndex: 3,
      explanation: "సీమాంతర చెల్లింపు లావాదేవీలను సులభతరం చేసే అన్ని సంస్థలను నేరుగా నియంత్రించేందుకు RBI తన నిర్ణయాన్ని ప్రకటించింది.",
    ),

    Question(
      questionText: "అక్టోబర్ 31, 2023 నాటికి, RBI ప్రకారం ₹2,000 డినామినేషన్ నోట్ల ఉపసంహరణ స్థితి ఏమిటి?",
      options: [
        "రూ.2,000 నోట్లన్నీ ఉపసంహరించబడ్డాయి",
        "చలామణిలో ఉన్న ₹2,000 నోట్లలో 97% పైగా తిరిగి వచ్చాయి",
        "₹2,000 నోట్లు ఇకపై చట్టబద్ధం కాదు",
        "స్థితిపై సమాచారం అందించబడలేదు"
      ],
      correctAnswerIndex: 1,
      explanation: "అక్టోబర్ 31, 2023 నాటికి, RBI ప్రకారం చెలామణిలో ఉన్న ₹2,000 నోట్లలో 97% పైగా తిరిగి వచ్చాయి.",
    ),

    Question(
      questionText: "లావాదేవీలు మరియు లావాదేవీల విలువ పరంగా అక్టోబర్‌లో UPI ఏ మైలురాయిని సాధించింది?",
      options: [
        "5 బిలియన్ల లావాదేవీలు మరియు రూ. 10 లక్షల కోట్ల లావాదేవీల విలువ",
        "8 బిలియన్ల లావాదేవీలు మరియు రూ. 15 లక్షల కోట్ల లావాదేవీల విలువ",
        "11.4 బిలియన్ లావాదేవీలు మరియు రూ. 17.6 లక్షల కోట్ల లావాదేవీల విలువ",
        "15 బిలియన్ల లావాదేవీలు మరియు రూ. 20 లక్షల కోట్ల లావాదేవీల విలువ"
      ],
      correctAnswerIndex: 2,
      explanation: "అక్టోబర్‌లో, UPI 11.4 బిలియన్ లావాదేవీలను సాధించింది, మొత్తం లావాదేవీ విలువ రూ. 17.6 లక్షల కోట్లను అధిగమించింది.",
    ),

    Question(
      questionText: "డిజిటల్ లెండింగ్ అధిపతి నిష్క్రమించాలని నిర్ణయించుకోవడంతో, ఏ బ్యాంకు తన డిజిటల్ నాయకత్వంలో మార్పును ఎదుర్కొంటోంది?",
      options: [
        "HDFC బ్యాంక్",
        "ICICI బ్యాంక్",
        "యాక్సిస్ బ్యాంక్",
        "బ్యాంక్ ఆఫ్ బరోడా"
      ],
      correctAnswerIndex: 2,
      explanation: "డిజిటల్ లెండింగ్ అధిపతి అఖిల్ హండా వైదొలగాలని నిర్ణయించుకున్నందున బ్యాంక్ ఆఫ్ బరోడా దాని డిజిటల్ నాయకత్వంలో గణనీయమైన మార్పును ఎదుర్కొంటోంది.",
    ),

    Question(
      questionText: "జూరిచ్ ఇన్సూరెన్స్ ఏ బీమా కంపెనీలో గణనీయమైన పెట్టుబడి పెట్టడానికి సిద్ధంగా ఉంది?",
      options: [
        "LIC (లైఫ్ ఇన్సూరెన్స్ కార్పొరేషన్ ఆఫ్ ఇండియా)",
        "కోటక్ మహీంద్రా లైఫ్ ఇన్సూరెన్స్",
        "HDFC లైఫ్",
        "ఇండియా ఫస్ట్ లైఫ్"
      ],
      correctAnswerIndex: 3,
      explanation: "ఇండియా ఫస్ట్ లైఫ్‌లో జ్యూరిచ్ ఇన్సూరెన్స్ కంపెనీ గణనీయమైన పెట్టుబడి పెట్టడానికి సిద్ధంగా ఉంది, ఇది బీమా పరిశ్రమలో గణనీయమైన మార్పును సూచిస్తుంది.",
    ),
    Question(
      questionText: "నవంబర్ 3న, భారతీయ రిజర్వ్ బ్యాంక్ (RBI) అనేక ఆర్థిక సంస్థలపై ద్రవ్య జరిమానాలను ప్రకటించింది. ఏ సంస్థలు పెనాల్టీలను ఎదుర్కొన్నాయి?",
      options: [
        "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా మరియు ICICI బ్యాంక్",
        "పంజాబ్ నేషనల్ బ్యాంక్, ఫెడరల్ బ్యాంక్, కొసమట్టం ఫైనాన్స్, మరియు మెర్సిడెస్-బెంజ్ ఫైనాన్షియల్ సర్వీసెస్ ఇండియా",
        "యాక్సిస్ బ్యాంక్ మరియు HDFC బ్యాంక్",
        "బ్యాంక్ ఆఫ్ బరోడా మరియు కోటక్ మహీంద్రా బ్యాంక్"
      ],
      correctAnswerIndex: 1,
      explanation: "నవంబర్ 3న, పంజాబ్ నేషనల్ బ్యాంక్, ఫెడరల్ బ్యాంక్, కొసమట్టం ఫైనాన్స్ మరియు మెర్సిడెస్-బెంజ్ ఫైనాన్షియల్ సర్వీసెస్ ఇండియాలపై RBI ద్రవ్య పెనాల్టీలను ప్రకటించింది.",
    ),
    Question(
      questionText: "RBI తన 4% వినియోగదారు ధర సూచిక (CPI) లక్ష్యాన్ని సాధించడంలో ఏ సవాలును గుర్తించింది?",
      options: [
        "పెరుగుతున్న వడ్డీ రేట్లు",
        "పెరుగుతున్న ఆహార ధరలు",
        "డబ్బు సరఫరా తగ్గుతోంది",
        "వాణిజ్య అసమతుల్యత"
      ],
      correctAnswerIndex: 2,
      explanation: "RBI తన 4% వినియోగదారుల ధరల సూచీ (CPI) లక్ష్యాన్ని సాధించడానికి పెరుగుతున్న ఆహార ధరల ప్రాథమిక సవాలుగా గుర్తించింది.",
    ),

    Question(
      questionText: "Axis Bank Ltdపై RBI ఎలాంటి గణనీయమైన ద్రవ్య పెనాల్టీ విధించింది?",
      options: [
        "రూ. 50 లక్షలు",
        "రూ. 1 కోటి",
        "రూ. 25 కోట్లు",
        "రూ. 90.92 లక్షలు"
      ],
      correctAnswerIndex: 4,
      explanation: "కీలక ఆదేశాలను పాటించనందుకు యాక్సిస్ బ్యాంక్ లిమిటెడ్‌పై RBI గణనీయమైన ద్రవ్య పెనాల్టీ ₹90.92 లక్షలు విధించింది.",
    ),

    Question(
      questionText: "2023-24 ఆర్థిక సంవత్సరం ప్రారంభ ఏడు నెలల్లో భారతదేశ ఎగుమతి ల్యాండ్‌స్కేప్‌లో ఏ మార్కెట్లు కీలకమైన డ్రైవర్లుగా ఉద్భవించాయి?",
      options: [
        "USA, చైనా మరియు జపాన్",
        "జర్మనీ, ఫ్రాన్స్ మరియు ఆస్ట్రేలియా",
        "నెదర్లాండ్స్, UK మరియు ఆస్ట్రేలియా",
        "బ్రెజిల్, రష్యా మరియు దక్షిణాఫ్రికా"
      ],
      correctAnswerIndex: 3,
      explanation: "FY 2023-24 ప్రారంభ ఏడు నెలల్లో, నెదర్లాండ్స్, UK మరియు ఆస్ట్రేలియా భారతదేశ ఎగుమతి ల్యాండ్‌స్కేప్‌లో కీలకమైన డ్రైవర్లుగా ఉద్భవించాయి.",
    ),

    Question(
      questionText: "డిజిటల్ చెల్లింపుల రంగంలో ఇండస్‌ఇండ్ బ్యాంక్ ఏ ముఖ్యమైన పురోగతిని సాధించింది?",
      options: [
        "కొత్త మొబైల్ బ్యాంకింగ్ యాప్ ప్రారంభం",
        "కాంటాక్ట్‌లెస్ కార్డ్‌ల పరిచయం",
        "కొత్త క్రెడిట్ కార్డ్ ప్రారంభం",
        "UPI ప్లాట్‌ఫారమ్‌లో 'ఇండస్‌ఇండ్ బ్యాంక్ ప్లాటినం రూపే క్రెడిట్ కార్డ్' ప్రారంభం"
      ],
      correctAnswerIndex: 4,
      explanation: "UPI ప్లాట్‌ఫారమ్‌లో ఇండస్‌ఇండ్ బ్యాంక్ తన 'ఇండస్‌ఇండ్ బ్యాంక్ ప్లాటినం రూపే క్రెడిట్ కార్డ్'ని ప్రారంభించడంతో గణనీయమైన పురోగతిని సాధించింది.",
    ),

    Question(
      questionText: "వినూత్న ఆర్థిక పరిష్కారాలను అందించడానికి ఏ ప్రైవేట్ రంగ రుణదాత HDFC లైఫ్‌తో వ్యూహాత్మక భాగస్వామ్యాన్ని ప్రకటించింది?",
      options: [
        "యాక్సిస్ బ్యాంక్",
        "ICICI బ్యాంక్",
        "కోటక్ మహీంద్రా బ్యాంక్",
        "కర్ణాటక బ్యాంక్"
      ],
      correctAnswerIndex: 4,
      explanation: "కర్ణాటక బ్యాంక్, మంగళూరుకు చెందిన ప్రముఖ ప్రైవేట్ రంగ రుణదాత, HDFC లైఫ్‌తో వ్యూహాత్మక భాగస్వామ్యాన్ని ప్రకటించింది.",
    ),

    Question(
      questionText: "ACKO, ఇన్‌సర్‌టెక్ కంపెనీ, దాని 'వాయిస్ ఆఫ్ ది కస్టమర్'గా ఎవరు భాగస్వామ్యం కలిగి ఉన్నారు?",
      options: [
        "అమితాబ్ బచ్చన్",
        "షారుఖ్ ఖాన్",
        "ఆర్ మాధవన్",
        "దీపికా పదుకొనే"
      ],
      correctAnswerIndex: 3,
      explanation: "ACKO, insurtech కంపెనీ, దాని 'వాయిస్ ఆఫ్ ది కస్టమర్'గా ప్రఖ్యాత నటుడు R మాధవన్‌తో భాగస్వామ్యం కలిగి ఉంది.",
    ),

    Question(
      questionText: "RBI దాని పెనాల్టీ సిస్టమ్ పరంగా ఏమి ఆలోచిస్తోంది?",
      options: [
        "పెనాల్టీ వ్యవస్థను రద్దు చేయడం",
        "ఉదారమైన జరిమానాలను ప్రవేశపెట్టడం",
        "పెనాల్టీ మొత్తాలలో సంభావ్య పెరుగుదలతో సమగ్ర సమీక్ష",
        "బాహ్య ఏజెన్సీలకు ఔట్‌సోర్సింగ్ పెనాల్టీ అమలు"
      ],
      correctAnswerIndex: 3,
      explanation: "పెనాల్టీ మొత్తాలలో సంభావ్య పెరుగుదలతో RBI తన పెనాల్టీ వ్యవస్థ యొక్క సమగ్ర సమీక్షను పరిశీలిస్తున్నట్లు నివేదించబడింది.",
    ),

    Question(
      questionText: "భారతదేశం బియ్యం విదేశీ విక్రయాలపై ఆంక్షలను వచ్చే ఏడాదికి ఎందుకు పొడిగించాలని భావిస్తున్నది?",
      options: [
        "ఎగుమతులను పెంచడానికి",
        "దేశీయ సరఫరాలను నిర్వహించడానికి మరియు ధరల పెరుగుదలను అరికట్టడానికి",
        "అంతర్జాతీయ వాణిజ్య ఒప్పందాలకు అనుగుణంగా",
        "దేశీయ బియ్యం వినియోగాన్ని ప్రోత్సహించడానికి"
      ],
      correctAnswerIndex: 2,
      explanation: "దేశీయ సరఫరాలను నిర్వహించడానికి మరియు ధరల పెరుగుదలను అరికట్టడానికి భారతదేశం బియ్యం విదేశీ అమ్మకాలపై ఆంక్షలను పొడిగించాలని ఊహించబడింది.",
    ),

    Question(
      questionText: "గ్లోబల్ స్టార్టప్ ల్యాండ్‌స్కేప్‌లో భారతదేశం యొక్క ప్రస్తుత స్థితి ఏమిటి?",
      options: [
        "రెండవ-అతిపెద్ద హబ్",
        "నాల్గవ-అతిపెద్ద హబ్",
        "ఐదవ-అతిపెద్ద హబ్",
        "మూడవ-అతిపెద్ద హబ్"
      ],
      correctAnswerIndex: 4,
      explanation: "యునైటెడ్ స్టేట్స్ మరియు చైనా తర్వాత గ్లోబల్ స్టార్టప్ ల్యాండ్‌స్కేప్‌లో భారతదేశం మూడవ-అతిపెద్ద హబ్‌గా అవతరించింది.",
    ),

    Question(
      questionText: "ట్రాక్సన్ డేటా ప్రకారం, మహిళల నేతృత్వంలోని స్టార్టప్‌ల జాబితాలో భారతదేశంలోని ఏ నగరం అగ్రస్థానంలో ఉంది?",
      options: [
        "ముంబయి",
        "ఢిల్లీ",
        "బెంగళూరు",
        "కోల్‌కతా"
      ],
      correctAnswerIndex: 3,
      explanation: "ట్రాక్సన్ డేటా ప్రకారం, భారతదేశంలోని మహిళల నేతృత్వంలోని స్టార్టప్‌ల జాబితాలో బెంగళూరు అగ్రస్థానంలో ఉంది.",
    ),
    Question(
        questionText: "IDBI బ్యాంక్ లిమిటెడ్ యొక్క వ్యూహాత్మక విక్రయం కోసం ప్రభుత్వం వేలం ప్రక్రియను ఎందుకు రద్దు చేసింది?",
        options: [
          "బిడ్‌దారుల నుండి ఆసక్తి లేకపోవడం, ఒకే ఒక్క బిడ్‌ను స్వీకరించింది.",
          "ప్రభుత్వ అంచనాలను మించిన పోటీ బిడ్‌లు.",
          "ఆస్తి మదింపు ప్రక్రియతో సమస్యలు.",
          "సమర్థవంతమైన అధికారం నుండి ఆమోదం పొందబడలేదు."
        ],
        correctAnswerIndex: 0,
        explanation: "ఆసక్తి లేకపోవడం వల్ల రద్దు చేయబడింది, ఒకే ఒక్క బిడ్ మాత్రమే స్వీకరించబడింది."
    ),

    Question(
        questionText: "ఇండియన్ ఇన్‌స్టిట్యూట్ ఆఫ్ స్పైసెస్ రీసెర్చ్ అభివృద్ధి చేసిన సంచలనాత్మక నల్ల మిరియాలు రకం పేరు ఏమిటి?",
        options: [
          "IISR చైతన్య",
          "IISR చంద్ర",
          "IISR శక్తి",
          "IISR వికాస్"
        ],
        correctAnswerIndex: 1,
        explanation: "నల్ల మిరియాలు రకానికి 'IISR చంద్ర' అని పేరు పెట్టారు."
    ),

    Question(
        questionText: "నిప్పాన్ లైఫ్ ఇండియా అసెట్ మేనేజ్‌మెంట్ ముంబైలోని ప్రైవేట్ క్రెడిట్ రంగంలోకి ఎందుకు ప్రవేశించింది?",
        options: [
          "బ్యాంకులు మరియు మ్యూచువల్ ఫండ్స్ ద్వారా నియంత్రణ కఠినతరం చేయడానికి.",
          "ప్రమోటర్ ఫండింగ్ నుండి ఉపసంహరించుకోవడానికి.",
          "సెంట్రమ్ మరియు అవెండస్‌తో పోటీ పడేందుకు.",
          "బదులుగా పబ్లిక్ క్రెడిట్‌పై దృష్టి పెట్టండి."
        ],
        correctAnswerIndex: 0,
        explanation: "రెగ్యులేటరీ బిగింపు కారణంగా మారుతున్న ట్రెండ్‌లకు అనుగుణంగా ఈ చర్య జరిగింది."
    ),



    Question(
        questionText: "బాంబే స్టాక్ ఎక్స్ఛేంజ్ (BSE)లో ఇన్వెస్టర్ రిస్క్ రిడక్షన్ యాక్సెస్ (IRRA) ప్లాట్‌ఫారమ్‌ను అధికారికంగా ఎవరు ప్రారంభించారు?",
        options: [
          "మాధబీ పూరీ బుచ్",
          "చంద్ర శేఖర్ ఘోష్",
          "SEBI చీఫ్",
          "నిప్పాన్ లైఫ్ ఇండియా అసెట్ మేనేజ్‌మెంట్"
        ],
        correctAnswerIndex: 0,
        explanation: "SEBI ఛైర్‌పర్సన్ మధబి పూరీ బుచ్, IRRA ప్లాట్‌ఫారమ్‌ను అధికారికంగా ప్రారంభించారు."
    ),

    Question(
        questionText: "మాస్టర్‌కార్డ్ మరియు U GRO క్యాపిటల్ మధ్య సహకారం యొక్క లక్ష్యం ఏమిటి?",
        options: [
          "డిజిటల్ లావాదేవీలను ప్రోత్సహించడానికి",
          "పట్టణ జీవన ప్రమాణాలను పెంపొందించడానికి",
          "పెద్ద వ్యాపారాలకు ఆర్థిక పరిష్కారాలను అందించడానికి",
          "వాతావరణ స్థితిస్థాపకతను పరిష్కరించడానికి"
        ],
        correctAnswerIndex: 0,
        explanation: "చిన్న వ్యాపారాలకు ఆర్థిక పరిష్కారాలను అందించడం మరియు MSMEలు ఎదుర్కొంటున్న మూలధనానికి పరిమిత ప్రాప్యతను అందించడం సహకారం లక్ష్యం."
    ),

    Question(
        questionText: "కొచ్చి కోసం ఆసియన్ డెవలప్‌మెంట్ బ్యాంక్ (ADB) ఆమోదించిన \$170 మిలియన్ రుణం యొక్క ప్రయోజనం ఏమిటి?",
        options: [
          "డిజిటల్ లావాదేవీలను ప్రోత్సహించడానికి",
          "నీటి సరఫరా సేవల ఆధునికీకరణను ఉత్ప్రేరకపరచడానికి",
          "పట్టణ జీవన ప్రమాణాలను పెంపొందించడానికి",
          "వాతావరణ స్థితిస్థాపకతను బలోపేతం చేయడానికి"
        ],
        correctAnswerIndex: 1,
        explanation: "కొచ్చిలో నీటి సరఫరా సేవల ఆధునికీకరణను ఉత్ప్రేరకపరచడం ఈ రుణం లక్ష్యం."
    ),

    Question(
        questionText: "చంద్ర శేఖర్ ఘోష్ ఎన్ని సంవత్సరాలకు బంధన్ బ్యాంక్ మేనేజింగ్ డైరెక్టర్ & చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్ (MD&CEO)గా తిరిగి నియమితులయ్యారు?",
        options: [
          "ఒక సంవత్సరం",
          "రెండు సంవత్సరాలు",
          "మూడు సంవత్సరాలు",
          "ఐదేళ్లు"
        ],
        correctAnswerIndex: 2,
        explanation: "చంద్ర శేఖర్ ఘోష్ మూడేళ్ల కాలానికి తిరిగి నియమించబడ్డారు."
    ),

    Question(
        questionText: "అభ్యుదయ సహకార బ్యాంకుకు సంబంధించి భారతీయ రిజర్వ్ బ్యాంక్ (RBI) ఏ చర్య తీసుకుంది?",
        options: [
          "ఇది బ్యాంకుపై జరిమానాలు విధించింది.",
          "ఇది 12 నెలల పాటు బోర్డును అధిగమించింది.",
          "ఇది బ్యాంకు కోసం రుణాన్ని ఆమోదించింది.",
          "ఇది మరొక బ్యాంకుతో విలీనాన్ని ప్రకటించింది."
        ],
        correctAnswerIndex: 1,
        explanation: "RBI అభ్యుదయ సహకార బ్యాంకు బోర్డును 12 నెలల పాటు భర్తీ చేసింది."
    ),

    Question(
        questionText: "యుఎస్ డాలర్‌తో పోలిస్తే భారత రూపాయి కొత్త కనిష్ట స్థాయి 83.38 వద్ద ముగియడానికి కారణం ఏమిటి?",
        options: [
          "చమురు కంపెనీల నుండి పెరిగిన డాలర్ డిమాండ్",
          "రూపాయిని పెంచడానికి RBI జోక్యం",
          "భారత ఆర్థిక వ్యవస్థలో బలమైన వృద్ధి",
          "అంతర్జాతీయ మార్కెట్‌లో తగ్గిన చమురు ధరలు"
        ],
        correctAnswerIndex: 0,
        explanation: "ఆయిల్ కంపెనీల నుండి పెరిగిన డాలర్ డిమాండ్ కారణంగా రూపాయి పడిపోయింది."
    ),

    Question(
        questionText: "సిటీ బ్యాంక్, బ్యాంక్ ఆఫ్ బరోడా మరియు ఇండియన్ ఓవర్సీస్ బ్యాంక్‌పై రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI) ఎందుకు జరిమానాలు విధించింది?",
        options: [
          "నియంత్రణ నిబంధనలను అధిగమించినందుకు",
          "నియంత్రణ నిబంధనల ఉల్లంఘన కోసం",
          "పేలవమైన పాలనా ప్రమాణాల కోసం",
          "అంతర్జాతీయ ప్రమాణాలను పాటించనందుకు"
        ],
        correctAnswerIndex: 1,
        explanation: "నియంత్రణ నిబంధనలను ఉల్లంఘించినందుకు జరిమానాలు విధించబడ్డాయి."
    ),

    Question(
        questionText: "RBI ద్వారా చెల్లింపుల మౌలిక సదుపాయాల అభివృద్ధి నిధి (PIDF) పథకం యొక్క రెండు సంవత్సరాల పొడిగింపు లక్ష్యం ఏమిటి?",
        options: [
          "వడ్డీ రేట్లు తగ్గించడానికి",
          "డిజిటల్ లావాదేవీలను ప్రోత్సహించడానికి",
          "పట్టణ జీవన ప్రమాణాలను పెంపొందించడానికి",
          "వాతావరణ స్థితిస్థాపకతను బలోపేతం చేయడానికి"
        ],
        correctAnswerIndex: 1,
        explanation: "పొడిగింపు అట్టడుగు స్థాయిలో డిజిటల్ లావాదేవీలను ప్రోత్సహించడం లక్ష్యంగా పెట్టుకుంది."
    ),

    Question(
        questionText: "HDFC సెక్యూరిటీస్ తన మొబైల్ ట్రేడింగ్ యాప్, HDFC SKYని అమెజాన్ వెబ్ సర్వీసెస్ (AWS) క్లౌడ్‌లో ఎందుకు ప్రారంభించింది?",
        options: [
          "మౌలిక సదుపాయాల ఖర్చులను తగ్గించడానికి",
          "నియంత్రణ నిబంధనలను పాటించడం",
          "సైబర్‌ సెక్యూరిటీని మెరుగుపరచడానికి",
          "ఇతర వ్యాపార యాప్‌లతో పోటీ పడేందుకు"
        ],
        correctAnswerIndex: 0,
        explanation: "AWSతో భాగస్వామ్యం వార్షిక IT అవస్థాపన మరియు నిర్వహణ ఖర్చులలో 50% గణనీయమైన తగ్గింపును ఇస్తుందని భావిస్తున్నారు."
    ),

    Question(
        questionText: "భారత ఆర్థిక మార్కెట్లలో పరిష్కార ప్రక్రియలో విప్లవాత్మక మార్పులు తీసుకురావడానికి SEBI యొక్క ప్రణాళిక యొక్క దృష్టి ఏమిటి?",
        options: [
          "వడ్డీ రేట్లు తగ్గించడానికి",
          "వాణిజ్యాల యొక్క ఒకే రోజు పరిష్కారాన్ని అమలు చేయడానికి",
          "డిజిటల్ లావాదేవీలను ప్రోత్సహించడానికి",
          "పట్టణ జీవన ప్రమాణాలను మెరుగుపరచడం"
        ],
        correctAnswerIndex: 1,
        explanation: "మార్చి 2024 నాటికి ట్రేడ్‌ల యొక్క ఒకే రోజు పరిష్కారాన్ని అమలు చేయడానికి SEBI ఒక రోడ్‌మ్యాప్‌పై చురుకుగా పని చేస్తోంది."
    ),

    Question(
        questionText: "రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా యొక్క 'అలర్ట్ లిస్ట్' అనధికార ఫారెక్స్ ట్రేడింగ్ ప్లాట్‌ఫారమ్‌లలో ఎన్ని ఎంటిటీలు చేర్చబడ్డాయి?",
        options: [
          "19",
          "45",
          "56",
          "75"
        ],
        correctAnswerIndex: 3,
        explanation: "తాజా అప్‌డేట్‌లో 19 అదనపు ఎంటిటీలు ఉన్నాయి, మొత్తం సంఖ్యను 75కి తీసుకువచ్చింది."
    ),

    Question(
        questionText: "ఫెడరల్ రిటైర్మెంట్ థ్రిఫ్ట్ ఇన్వెస్ట్‌మెంట్ బోర్డ్ (FRTIB) దాని నుండి మరియు దాని పెట్టుబడి వ్యూహంలోకి మారడానికి ఏమి ప్లాన్ చేస్తుంది?",
        options: [
          "MSCI ACWI ఇండెక్స్ నుండి MSCI EAFE ఇండెక్స్ వరకు",
          "MSCI EAFE ఇండెక్స్ నుండి MSCI ACWI ఇండెక్స్ వరకు",
          "MSCI ACWI ఇండెక్స్ నుండి S&P 500 ఇండెక్స్ వరకు",
          "S&P 500 ఇండెక్స్ నుండి MSCI EAFE ఇండెక్స్ వరకు"
        ],
        correctAnswerIndex: 1,
        explanation: "FRTIB MSCI EAFE ఇండెక్స్ నుండి MSCI ACWI IMI ఎక్స్ USA ఎక్స్ చైనా ఎక్స్ హాంగ్ ఇండెక్స్‌కు మారాలని యోచిస్తోంది."
    ),
    Question(
        questionText: "అక్టోబరులో భారతదేశం యొక్క ముడి చమురు దిగుమతులు మునుపటి నెలతో పోలిస్తే ఎంత శాతం పెరిగాయి?",
        options: [
          "4.8%",
          "5.9%",
          "6.4%",
          "7.2%"
        ],
        correctAnswerIndex: 1,
        explanation: "అక్టోబరులో గత నెలతో పోలిస్తే భారతదేశం యొక్క ముడి చమురు దిగుమతులు 5.9% పెరిగాయి."
    ),

    Question(
        questionText: "2024 ఆర్థిక సంవత్సరంలో భారతదేశానికి S&P గ్లోబల్ రేటింగ్స్ అప్‌గ్రేడ్ చేసిన GDP వృద్ధి అంచనా ఏమిటి?",
        options: [
          "5.5%",
          "6.0%",
          "6.2%",
          "6.4%"
        ],
        correctAnswerIndex: 3,
        explanation: "S&P గ్లోబల్ రేటింగ్స్ FY2024లో భారతదేశం కోసం దాని GDP వృద్ధి అంచనాను 6.4%కి అప్‌గ్రేడ్ చేసింది."
    ),

    Question(
        questionText: "సోషల్ స్టాక్ ఎక్స్ఛేంజీకి సంబంధించి నాట్ ఫర్ ప్రాఫిట్ ఆర్గనైజేషన్ (NPOలు) కోసం సెక్యూరిటీస్ అండ్ ఎక్స్ఛేంజ్ బోర్డ్ ఆఫ్ ఇండియా (SEBI) ఎందుకు ఆమోదం పొందింది?",
        options: [
          "విలీనాలు మరియు సముపార్జనలను సులభతరం చేయడానికి",
          "పబ్లిక్ ఇష్యూ కోసం కనీస ఇష్యూ పరిమాణాన్ని తగ్గించడానికి",
          "నియంత్రణ నిబంధనలను పెంచడానికి",
          "పట్టణ జీవన ప్రమాణాలను మెరుగుపరచడం"
        ],
        correctAnswerIndex: 1,
        explanation: "సోషల్ స్టాక్ ఎక్స్ఛేంజ్‌లో పబ్లిక్ ఇష్యూ కోసం కనీస ఇష్యూ పరిమాణాన్ని తగ్గించడం ద్వారా ఎన్‌పిఓలకు సెబి ఆమోదం తెలిపింది."
    ),
    Question(
        questionText: "S&P గ్లోబల్ రేటింగ్స్ ద్వారా 'చైనా స్లోస్ ఇండియా గ్రోస్' నివేదిక ప్రకారం, 2026 నాటికి భారతదేశానికి అంచనా వేసిన GDP వృద్ధి ఏమిటి?",
        options: [
          "3.8%",
          "4.6%",
          "6.0%",
          "7.0%"
        ],
        correctAnswerIndex: 3,
        explanation: "నివేదిక 2026 నాటికి భారతదేశానికి 7% GDP వృద్ధిని అంచనా వేసింది, ఇది చైనా అంచనా వేసిన 4.6% కంటే ఎక్కువగా ఉంటుంది."
    ),

    Question(
        questionText: "FY24 రెండవ త్రైమాసికంలో మహిళా శ్రామిక శక్తి భాగస్వామ్యంలో చారిత్రాత్మక పెరుగుదల ఏమిటి?",
        options: [
          "18%",
          "20%",
          "22%",
          "24%"
        ],
        correctAnswerIndex: 3,
        explanation: "FY24 రెండవ త్రైమాసికంలో, మహిళా శ్రామిక శక్తి భాగస్వామ్యం ఆల్-టైమ్ గరిష్ట స్థాయి 24%కి చేరుకుంది."
    ),

    Question(
        questionText: "ఆర్గనైజేషన్ ఫర్ ఎకనామిక్ కో-ఆపరేషన్ అండ్ డెవలప్‌మెంట్ (OECD) ద్వారా FY24 మరియు FY25లో భారతదేశ ఆర్థిక వ్యవస్థకు సవరించిన వృద్ధి అంచనా ఏమిటి?",
        options: [
          "6.7% మరియు 6.5%",
          "6.3% మరియు 6.1%",
          "7.0% మరియు 7.2%",
          "5.8% మరియు 5.5%"
        ],
        correctAnswerIndex: 1,
        explanation: "OECD దాని ప్రొజెక్షన్‌ని FY24కి 6.3%కి మరియు FY25కి 6.1%కి సవరించింది."
    ),

    Question(
        questionText: "ఏ ముంబైకి చెందిన సమ్మేళనం దాని ప్రత్యేక ప్రయోజన వాహనం, హాజెల్ ఇన్‌ఫ్రా ద్వారా రిలయన్స్ నావల్ మరియు ఇంజనీరింగ్‌ను కొనుగోలు చేసింది?",
        options: [
          "అదానీ గ్రూప్",
          "టాటా గ్రూప్",
          "స్వాన్ ఎనర్జీ",
          "JSW గ్రూప్"
        ],
        correctAnswerIndex: 2,
        explanation: "స్వాన్ ఎనర్జీ తన ప్రత్యేక ప్రయోజన వాహనం, హాజెల్ ఇన్‌ఫ్రా ద్వారా రిలయన్స్ నావల్ మరియు ఇంజనీరింగ్‌ను కొనుగోలు చేసింది."
    ),

    Question(
        questionText: "పశ్చిమ బెంగాల్ ఇండస్ట్రియల్ డెవలప్‌మెంట్ కార్పొరేషన్. లిమిటెడ్ (WBIDC)తో టాటా మోటార్స్ దాని మధ్యవర్తిత్వంలో ఏ అవార్డును పొందింది?",
        options: [
          "₹500 కోట్లు",
          "₹600 కోట్లు",
          "₹700 కోట్లు",
          "₹766 కోట్లు"
        ],
        correctAnswerIndex: 3,
        explanation: "టాటా మోటార్స్ WBIDC నుండి గణనీయమైన ₹766 కోట్ల మధ్యవర్తిత్వ అవార్డును పొందింది."
    ),

    Question(
        questionText: "భారతదేశంలో లగ్జరీ బ్యూటీ రిటైల్‌ను పునర్నిర్వచించటానికి రిలయన్స్ బ్యూటీ & పర్సనల్ కేర్ లిమిటెడ్‌తో ఏ బ్యూటీ రిటైలర్ భాగస్వామ్యం కలిగి ఉంది?",
        options: [
          "సెఫోరా",
          "MAC సౌందర్య సాధనాలు",
          "లోరియల్",
          "క్లినిక్"
        ],
        correctAnswerIndex: 0,
        explanation: "భారతదేశంలో లగ్జరీ బ్యూటీ రిటైల్‌ను పునర్నిర్వచించడానికి రిలయన్స్ బ్యూటీ & పర్సనల్ కేర్ లిమిటెడ్‌తో సెఫోరా భాగస్వామ్యం కలిగి ఉంది."
    ),

    Question(
        questionText: "2023-2024 సీజన్ కోసం భారతదేశంలోని పత్తి పరిశ్రమ ఎలాంటి సవాలును ఎదుర్కొంటుంది?",
        options: [
          "అధిక వర్షపాతం",
          "గులాబీ తొలుచు పురుగు ముట్టడి",
          "కరువు",
          "కార్మికుల కొరత"
        ],
        correctAnswerIndex: 1,
        explanation: "పత్తి పరిశ్రమ 2023-2024 సీజన్‌లో గులాబీ రంగు పురుగు ముట్టడి వంటి సవాళ్లను ఎదుర్కొంటుంది."
    ),

    Question(
        questionText: "ముద్రా పోర్ట్ ప్రాజెక్ట్ విలువ ఏమిటి మరియు FY25 నాటికి ఏ కార్గో వాల్యూమ్ లక్ష్యాన్ని సాధించాలని లక్ష్యంగా పెట్టుకుంది?",
        options: [
          "రూ. 3,500 కోట్లు; 150 MMT",
          "రూ. 4,000 కోట్లు; 180 MMT",
          "రూ. 4,119 కోట్లు; 200 MMT",
          "రూ. 5,000 కోట్లు; 220 MMT"
        ],
        correctAnswerIndex: 2,
        explanation: "ముద్రా పోర్ట్ ప్రాజెక్ట్ విలువ రూ. 4,119 కోట్లు, మరియు ఇది FY25 నాటికి 200 MMT కార్గో వాల్యూమ్‌ను సాధించాలని లక్ష్యంగా పెట్టుకుంది."
    ),

    Question(
        questionText: "ఇండియన్ ఆయిల్ కార్పొరేషన్ (IOC) ద్వారా మెర్కేటర్ పెట్రోలియం లిమిటెడ్ (MPL) కొనుగోలు యొక్క సుమారు విలువ ఎంత?",
        options: [
          "రూ. 100 కోట్లు",
          "రూ. 148 కోట్లు",
          "రూ. 200 కోట్లు",
          "రూ. 250 కోట్లు"
        ],
        correctAnswerIndex: 1,
        explanation: "IOC ద్వారా మెర్కేటర్ పెట్రోలియం లిమిటెడ్ (MPL) కొనుగోలు విలువ సుమారు రూ. 148 కోట్లు."
    ),

    Question(
        questionText: "భారతదేశంలో టెక్ స్టార్టప్‌లకు మద్దతు ఇవ్వడానికి ఎలక్ట్రానిక్స్ & ఇన్ఫర్మేషన్ టెక్నాలజీ మంత్రిత్వ శాఖ (మెయిటీ) కార్యదర్శి శ్రీ ఎస్ కృష్ణన్ ఏ చొరవను ప్రారంభించారు?",
        options: [
          "డిజిటల్ ఇండియా ఇనిషియేటివ్",
          "స్టార్టప్ ఇండియా",
          "ముందుకు లీప్",
          "భారతదేశం కోసం ఆవిష్కరణలు"
        ],
        correctAnswerIndex: 2,
        explanation: "భారతదేశంలో టెక్ స్టార్టప్‌ల విజయానికి మద్దతు ఇవ్వడానికి మరియు వేగవంతం చేయడానికి LEAP AHEAD చొరవ ప్రారంభించబడింది."
    ),

    Question(
        questionText: "ప్రస్తుత ఆర్థిక సంవత్సరంలో PwC భారతదేశానికి అంచనా వేసిన స్థూల రాబడి ఎంత?",
        options: [
          "రూ. 8,000 కోట్లు",
          "రూ. 9,000 కోట్లు",
          "రూ. 10,000 కోట్లు",
          "రూ. 11,000 కోట్లు"
        ],
        correctAnswerIndex: 1,
        explanation: "ప్రస్తుత ఆర్థిక సంవత్సరంలో స్థూల రాబడి ₹9,000 కోట్లకు మించి ఉంటుందని PwC ఇండియా అంచనా వేస్తోంది."
    ),

    Question(
        questionText: "బ్లూ డార్ట్ ఎక్స్‌ప్రెస్ ఏ వ్యూహాత్మక భాగస్వామ్యాన్ని ప్రకటించింది మరియు ఎంచుకున్న పోస్టాఫీసులలో ఏమి పరిచయం చేయాలనే లక్ష్యంతో ఉంది?",
        options: [
          "FedExతో భాగస్వామ్యం; ఓవర్‌నైట్ షిప్పింగ్ సేవలు",
          "DHLతో భాగస్వామ్యం; ఎక్స్‌ప్రెస్ కొరియర్ సేవలు",
          "ఇండియా పోస్ట్‌తో భాగస్వామ్యం; ఆటోమేటెడ్ డిజిటల్ పార్సెల్ లాకర్స్",
          "UPSతో భాగస్వామ్యం; గ్లోబల్ షిప్పింగ్ సొల్యూషన్స్"
        ],
        correctAnswerIndex: 2,
        explanation: "బ్లూ డార్ట్ ఎక్స్‌ప్రెస్ ఎంపిక చేసిన పోస్టాఫీసుల్లో ఆటోమేటెడ్ డిజిటల్ పార్శిల్ లాకర్‌లను పరిచయం చేయడానికి ఇండియా పోస్ట్‌తో భాగస్వామ్యాన్ని ప్రకటించింది."
    ),

    Question(
        questionText: "స్వతంత్ర మైక్రోఫిన్ ప్రైవేట్ లిమిటెడ్ ఏ ముఖ్యమైన కొనుగోలును చేయడానికి సిద్ధంగా ఉంది మరియు డీల్ యొక్క సుమారు విలువ ఎంత?",
        options: [
          "రిలయన్స్ జియో కొనుగోలు; రూ. 2,000 కోట్లు",
          "చైతన్య ఇండియా ఫిన్ క్రెడిట్ ప్రైవేట్ లిమిటెడ్ కొనుగోలు; రూ. 1,479 కోట్లు",
          "HDFC బ్యాంక్ స్వాధీనం; రూ. 3,500 కోట్లు",
          "యాక్సిస్ బ్యాంక్ స్వాధీనం; రూ. 2,500 కోట్లు"
        ],
        correctAnswerIndex: 1,
        explanation: "స్వతంత్ర మైక్రోఫిన్ ప్రైవేట్ లిమిటెడ్ రూ. 1,479 కోట్ల విలువైన డీల్‌లో చైతన్య ఇండియా ఫిన్ క్రెడిట్ ప్రైవేట్ లిమిటెడ్‌ను కొనుగోలు చేయనుంది."
    ),

    Question(
        questionText: "Paytm యొక్క మాతృ సంస్థ అయిన One 97 కమ్యూనికేషన్స్‌లో ఏ సమ్మేళనం ఇటీవల తన వాటాను ఉపసంహరించుకుంది?",
        options: [
          "రిలయన్స్ ఇండస్ట్రీస్",
          "అదానీ గ్రూప్",
          "టాటా గ్రూప్",
          "బెర్క్‌షైర్ హాత్వే"
        ],
        correctAnswerIndex: 3,
        explanation: "వారెన్ బఫ్ఫెట్ నేతృత్వంలోని బెర్క్‌షైర్ హాత్వే, Paytm యొక్క మాతృ సంస్థ అయిన One 97 కమ్యూనికేషన్స్‌లో తన వాటాను పూర్తిగా ఉపసంహరించుకుంది."
    ),

    Question(
        questionText: "సస్టైనబుల్ ఏవియేషన్ ఫ్యూయల్ (SAF) వినియోగానికి సంబంధించి 2030 నాటికి అసోసియేషన్ ఆఫ్ ఆసియా-పసిఫిక్ ఎయిర్‌లైన్స్ (AAPA) దాని సభ్య ఎయిర్‌లైన్స్ కోసం నిర్దేశించిన లక్ష్యం ఏమిటి?",
        options: [
          "3%",
          "5%",
          "7%",
          "10%"
        ],
        correctAnswerIndex: 1,
        explanation: "2030 నాటికి 5% సస్టైనబుల్ ఏవియేషన్ ఫ్యూయల్ (SAF) వినియోగాన్ని సాధించాలని AAPA తన సభ్య విమానయాన సంస్థలకు లక్ష్యాన్ని నిర్దేశించింది."
    ),

    Question(
      questionText: "స్థిరమైన విమాన ఇంధనంతో వర్జిన్ అట్లాంటిక్ ప్యాసింజర్ జెట్ యొక్క ప్రయోజనం ఏమిటి?",
      options: [
        "అట్లాంటిక్ విమానాలలో కొత్త వేగ రికార్డును సెట్ చేయడానికి.",
        "సుదూర ప్రయాణాల కోసం స్థిరమైన విమాన ఇంధనాన్ని ఉపయోగించడం సాధ్యాసాధ్యాలను పరీక్షించడానికి.",
        "వర్జిన్ అట్లాంటిక్ విమానాల లగ్జరీ మరియు సౌకర్యాన్ని ప్రదర్శించడానికి.",
        "సుదూర ప్రయాణాలకు సంప్రదాయ విమాన ఇంధనాన్ని ఉపయోగించడాన్ని ప్రదర్శించడానికి."
      ],
      correctAnswerIndex: 1,
      explanation: "వర్జిన్ అట్లాంటిక్ ప్యాసింజర్ జెట్ యొక్క ఉద్దేశ్యం స్థిరమైన విమాన ఇంధనంతో ఇంధనం నింపడం, సుదూర ప్రయాణాలకు అటువంటి ఇంధనాన్ని ఉపయోగించడం సాధ్యాసాధ్యాలను పరీక్షించడం, తక్కువ కార్బన్ ఎంపికలకు విమానయాన పరిశ్రమ యొక్క నిబద్ధతను ప్రదర్శిస్తుంది.",
    ),

    Question(
      questionText: "ఇటీవల ఏ దేశం అంతర్జాతీయ సౌర కూటమిలో 95వ సభ్యదేశంగా మారింది?",
      options: [
        "నార్వే",
        "చిలీ",
        "భారతదేశం",
        "థాయిలాండ్"
      ],
      correctAnswerIndex: 1,
      explanation: "చిలీ ఇటీవల అంతర్జాతీయ సౌర కూటమిలో 95వ సభ్యదేశంగా మారింది, సౌరశక్తి సహకారం పట్ల దేశం యొక్క నిబద్ధతను బలపరుస్తుంది.",
    ),

    Question(
      questionText: "ఉత్తరాఖండ్‌లో భారతదేశం యొక్క 'హంగర్ ప్రాజెక్ట్'కి మద్దతు ఇవ్వడానికి నార్వే చొరవ యొక్క ప్రధాన దృష్టి ఏమిటి?",
      options: [
        "సైనిక సామర్థ్యాలను పెంపొందించడం",
        "మహిళా నాయకులకు సాధికారత కల్పించడం మరియు ఆహార భద్రతను పెంపొందించడం",
        "పర్యాటక రంగాన్ని ప్రోత్సహించడం",
        "సహజ వనరులను అన్వేషించడం"
      ],
      correctAnswerIndex: 1,
      explanation: "నార్వే చొరవ మహిళా నాయకులను శక్తివంతం చేయడం, ఆహార భద్రతను పెంపొందించడం మరియు పర్యావరణపరంగా సున్నితమైన ఉత్తరాఖండ్ ప్రాంతంలో పర్యావరణాన్ని పరిరక్షించడం లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "ఇరాన్ యొక్క ప్రాక్సీలుగా పరిగణించబడే రెండు మిలిటెంట్ గ్రూపులు ఇజ్రాయెల్ మరియు దాని ఉత్తర సరిహద్దులో ఇటీవలి దాడులలో పాల్గొన్నాయి?",
      options: [
        "అల్-కస్సామ్ బ్రిగేడ్స్ మరియు హమాస్",
        "హిజ్బుల్లా మరియు అల్-ఖస్సామ్ బ్రిగేడ్స్",
        "M23 తిరుగుబాటుదారులు మరియు ప్రభుత్వ-మద్దతుగల మిలీషియా",
        "FATF మరియు హిజ్బుల్లా"
      ],
      correctAnswerIndex: 1,
      explanation: "హమాస్ (అల్-కస్సామ్ బ్రిగేడ్స్) రాకెట్ దాడిని ప్రారంభించింది మరియు ఇరాన్ యొక్క ప్రాక్సీలుగా పరిగణించబడుతున్న హిజ్బుల్లా ఇజ్రాయెల్‌లోని 19 స్థానాలపై దాడి చేసి, ఇజ్రాయెల్ యొక్క ఉత్తర సరిహద్దులో ఉద్రిక్తతలను పెంచింది.",
    ),

    Question(
      questionText: "దాని పర్యాటక పరిశ్రమను పునరుద్ధరించడానికి థాయిలాండ్ యొక్క వ్యూహం యొక్క దృష్టి ఏమిటి?",
      options: [
        "కఠినమైన వీసా అవసరాలను అమలు చేయడం",
        "భారతీయ మరియు తైవాన్ పౌరులకు వీసా-రహిత ప్రవేశాలను అనుమతించడం",
        "సాంస్కృతిక కార్యక్రమాలను ప్రోత్సహించడం",
        "చైనీస్ పర్యాటకులను ఆకర్షిస్తోంది"
      ],
      correctAnswerIndex: 1,
      explanation: "ఎక్కువ మంది సందర్శకులను ఆకర్షించడానికి విస్తృత వ్యూహంలో భాగంగా భారతదేశం మరియు తైవాన్ పౌరులకు వీసా-రహిత ఎంట్రీలను అనుమతించడం ద్వారా థాయ్‌లాండ్ తన పర్యాటక పరిశ్రమను పునరుజ్జీవింపజేస్తోంది.",
    ),
    Question(
      questionText: "రెండు దేశాల మధ్య పెరుగుతున్న సహకారాన్ని హైలైట్ చేస్తూ చైనా కమ్యూనిస్ట్ పార్టీ ప్రతినిధి బృందం ఇటీవల ఏ దేశాన్ని సందర్శించింది?",
      options: [
        "బంగ్లాదేశ్",
        "సోలమన్ దీవులు",
        "థాయిలాండ్",
        "శ్రీలంక"
      ],
      correctAnswerIndex: 1,
      explanation: "చైనీస్ కమ్యూనిస్ట్ పార్టీ ప్రతినిధి బృందం ఇటీవల సోలమన్ దీవులను సందర్శించింది, చైనా మరియు సోలమన్ దీవుల మధ్య పెరుగుతున్న సహకారాన్ని హైలైట్ చేసింది.",
    ),

    Question(
      questionText: "బంగ్లాదేశ్‌లోని అషుంగంజ్‌లోని స్మారక చిహ్నం ఏ ముఖ్యమైన సంఘటనను స్మరించుకుంటుంది?",
      options: [
        "స్వాతంత్ర్య దినోత్సవం",
        "యుద్ధంలో విజయం",
        "1971లో బంగ్లాదేశ్ విముక్తి యుద్ధం",
        "వ్యవస్థాపన దినోత్సవం"
      ],
      correctAnswerIndex: 2,
      explanation: "బంగ్లాదేశ్‌లోని అషుగంజ్‌లోని స్మారక చిహ్నం, 1971లో బంగ్లాదేశ్ విముక్తి యుద్ధంలో భారతీయ సైనికుల త్యాగాలను స్మరించుకుంటుంది.",
    ),

    Question(
      questionText: "గుజరాత్‌లోని ముంద్రా పవర్ ప్లాంట్‌లో అదానీ పవర్ లిమిటెడ్ గ్రీన్ అమ్మోనియా దహన పైలట్ ప్రాజెక్ట్ యొక్క ప్రాథమిక ప్రయోజనం ఏమిటి?",
      options: [
        "పెరుగుతున్న కార్బన్ పాదముద్ర",
        "వ్యవసాయ పద్ధతులను మెరుగుపరచడం",
        "కార్బన్ పాదముద్రను తగ్గించడం",
        "సాంప్రదాయ ఇంధన వనరులను పరీక్షించడం"
      ],
      correctAnswerIndex: 2,
      explanation: "అదానీ పవర్ లిమిటెడ్ యొక్క గ్రీన్ అమ్మోనియా దహన పైలట్ ప్రాజెక్ట్ దాని కార్బన్ పాదముద్రను తగ్గించడం, స్థిరమైన పద్ధతులను అవలంబించడానికి నిబద్ధతతో సమలేఖనం చేయడం లక్ష్యంగా పెట్టుకుంది.",
    ),

    Question(
      questionText: "AML/CFT సిస్టమ్‌లకు సంబంధించిన 'గ్రే లిస్ట్' నుండి అనేక దేశాలను తొలగించినట్లు ఏ సంస్థ ప్రకటించింది?",
      options: [
        "ఐక్యరాజ్యసమితి",
        "అంతర్జాతీయ ద్రవ్య నిధి (IMF)",
        "ఫైనాన్షియల్ యాక్షన్ టాస్క్ ఫోర్స్ (FATF)",
        "ప్రపంచ ఆరోగ్య సంస్థ (WHO)"
      ],
      correctAnswerIndex: 2,
      explanation: "FATF (ఫైనాన్షియల్ యాక్షన్ టాస్క్ ఫోర్స్) వారి AML/CFT వ్యవస్థలను మెరుగుపరచడంలో గణనీయమైన పురోగతి కారణంగా అనేక దేశాలను 'గ్రే లిస్ట్' నుండి తొలగిస్తున్నట్లు ప్రకటించింది.",
    ),

    Question(
      questionText: "తూర్పు ఆఫ్రికాలోని జాంజిబార్ ద్వీపంలో IIT మద్రాస్ చొరవ యొక్క దృష్టి ఏమిటి?",
      options: [
        "కొత్త పరిశోధనా కేంద్రాన్ని ఏర్పాటు చేయడం",
        "సాంస్కృతిక మార్పిడి కార్యక్రమాలను ప్రోత్సహించడం",
        "అంతర్జాతీయ క్యాంపస్‌ను ఏర్పాటు చేయడం",
        "ఉపగ్రహ ప్రయోగం"
      ],
      correctAnswerIndex: 2,
      explanation: "IIT మద్రాస్ జాంజిబార్ ద్వీపంలో అంతర్జాతీయ క్యాంపస్‌ను స్థాపించింది, ప్రపంచ విద్య మరియు సహకారం యొక్క కొత్త శకంపై దృష్టి సారించింది.",
    ),

    Question(
      questionText: "యునైటెడ్ స్టేట్స్ ఇంటర్నేషనల్ డెవలప్‌మెంట్ ఫైనాన్స్ కార్పొరేషన్ (DFC) శ్రీలంకలో ఏ ఇటీవలి పెట్టుబడి పెట్టింది?",
      options: [
        "\$553 మిలియన్ కంటైనర్ టెర్మినల్ ప్రాజెక్ట్‌లో",
        "\$100 మిలియన్లు పునరుత్పాదక శక్తి ప్రాజెక్టులో",
        "\$1 బిలియన్ హెల్త్‌కేర్ ఇన్‌ఫ్రాస్ట్రక్చర్ ప్రాజెక్ట్‌లో",
        "టెక్నాలజీ స్టార్టప్‌లో \$250 మిలియన్లు"
      ],
      correctAnswerIndex: 0,
      explanation: "యునైటెడ్ స్టేట్స్ ఇంటర్నేషనల్ డెవలప్‌మెంట్ ఫైనాన్స్ కార్పొరేషన్ (DFC) శ్రీలంకలోని కొలంబో పోర్ట్‌లో ఉన్న అదానీ పోర్ట్స్ కంటైనర్ టెర్మినల్ ప్రాజెక్ట్‌లో \$553 మిలియన్ పెట్టుబడి పెట్టింది.",
    ),

    Question(
      questionText: "చైనా తన ఆర్థిక వ్యవస్థపై ప్రభావం చూపుతున్న ఏ ఇటీవలి ఎదురుదెబ్బను ఎదుర్కొంది?",
      options: [
        "వాణిజ్య మిగులు పెరుగుదల",
        "అక్టోబరులో ప్రతి ద్రవ్యోల్బణం తిరిగి",
        "వినియోగదారుల కార్యకలాపాల పెరుగుదల",
        "అంచనాలకు మించి ఆర్థిక వృద్ధి"
      ],
      correctAnswerIndex: 1,
      explanation: "అక్టోబర్‌లో తిరిగి ప్రతి ద్రవ్యోల్బణంలోకి జారుకోవడంతో చైనా ఎదురుదెబ్బను ఎదుర్కొంది, డిమాండ్‌ను ఉత్తేజపరిచేందుకు పనిచేస్తున్న అధికారులకు సవాలుగా నిలిచింది.",
    ),

    Question(
      questionText: "ఇజ్రాయెల్-హమాస్ వివాదానికి సంబంధించి గ్రూప్ ఆఫ్ సెవెన్ (G7) విదేశాంగ మంత్రుల సమావేశాల దృష్టి ఏమిటి?",
      options: [
        "హమాస్‌కు మద్దతు",
        "గాజాలో మానవతా సంక్షోభాన్ని పరిష్కరించడం",
        "ఇజ్రాయెల్ దురాక్రమణకు వాదించడం",
        "సైనిక జోక్యాన్ని ప్రోత్సహించడం"
      ],
      correctAnswerIndex: 1,
      explanation: "G7 విదేశాంగ మంత్రుల సమావేశాలు ఇజ్రాయెల్-హమాస్ సంఘర్షణ మరియు గాజాలో ఏర్పడిన మానవతా సంక్షోభాన్ని పరిష్కరించే లక్ష్యంతో, ఏకీకృత ప్రతిస్పందన యొక్క ప్రాముఖ్యతను నొక్కిచెప్పాయి.",
    ),

    Question(
      questionText: "యూరప్‌లోని సాంప్రదాయ సాయుధ దళాల ఒప్పందం (CFE) నుండి రష్యా అధికారికంగా ఎందుకు వైదొలిగింది?",
      options: [
        "NATO యొక్క విస్తరణ",
        "గ్లోబల్ నిరాయుధీకరణ ప్రయత్నాలు",
        "అణు విస్తరణ గురించి ఆందోళనలు",
        "ఇతర సంతకం చేసిన దేశాలచే ఉల్లంఘన"
      ],
      correctAnswerIndex: 0,
      explanation: "నాటో విస్తరణ సహకారానికి అడ్డంకిగా ఉందని పేర్కొంటూ రష్యా అధికారికంగా యూరప్‌లోని సంప్రదాయ సాయుధ దళాల ఒప్పందం (CFE) నుండి వైదొలిగింది.",
    ),

    Question(
      questionText: "యునైటెడ్ కింగ్‌డమ్ ద్వారా విస్తరించిన సురక్షిత రాష్ట్రాల జాబితాలో భారతదేశాన్ని చేర్చడం వల్ల ప్రయోజనం ఏమిటి?",
      options: [
        "భారతదేశం నుండి పర్యాటకాన్ని పెంచడానికి",
        "అక్రమ వలసదారులను తిరిగి ఇచ్చే ప్రక్రియను వేగవంతం చేయడానికి",
        "సాంస్కృతిక మార్పిడి కార్యక్రమాలను ప్రోత్సహించడానికి",
        "దౌత్య సంబంధాలను బలోపేతం చేయడానికి"
      ],
      correctAnswerIndex: 1,
      explanation: "భారతదేశం నుండి చట్టవిరుద్ధంగా ప్రయాణించిన భారతీయ పౌరులను తిరిగి రప్పించే ప్రక్రియను వేగవంతం చేయడమే యునైటెడ్ కింగ్‌డమ్ యొక్క ప్రణాళిక సురక్షిత రాష్ట్రాల యొక్క విస్తరించిన జాబితాలో భారతదేశాన్ని చేర్చడానికి ఉద్దేశించబడింది.",
    ),
    Question(
      questionText: "భారత ఆర్థిక వ్యవస్థకు సంబంధించి మునుపటి ఆక్రమణదారుల నుండి భారతదేశంలోని బ్రిటిష్ వలసవాదులను ఏది వేరు చేసింది?",
      options: [
        "వారు భారత ఆర్థిక వ్యవస్థలో నిర్మాణాత్మక మార్పులు చేశారు.",
        "వారు భారతదేశ సంపదపై భారీ నివాళులర్పించారు.",
        "వారు భారతీయ పరిశ్రమలను ప్రోత్సహించారు.",
        "అవి భారతదేశ ఆర్థిక వ్యవస్థను ప్రభావితం చేయలేదు."
      ],
      correctAnswerIndex: 0,
      explanation: "మునుపటి ఆక్రమణదారుల వలె కాకుండా, బ్రిటిష్ వలసవాదులు వారి పాలనలో భారత ఆర్థిక వ్యవస్థలో నిర్మాణాత్మక మార్పులు చేశారు.",
    ),

    Question(
      questionText: "ఇటీవల భారత్ మరియు ఆస్ట్రేలియా మధ్య జరిగిన ద్వైపాక్షిక సమావేశంలో, దేని చుట్టూ కేంద్రీకృతమై చర్చలు జరిగాయి?",
      options: [
        "ఆర్థిక సహకారం మరియు వాణిజ్య ఒప్పందాలు.",
        "హైడ్రోగ్రఫీ మరియు జాయింట్ ఎయిర్-టు-ఎయిర్ రీఫ్యూయలింగ్‌లో వ్యూహాత్మక సహకారాలు.",
        "సాంస్కృతిక మార్పిడిని మెరుగుపరచడం.",
        "అంతరిక్ష అన్వేషణలో సహకారం."
      ],
      correctAnswerIndex: 1,
      explanation: "చర్చలు హైడ్రోగ్రఫీలో వ్యూహాత్మక సహకారాలు మరియు ఉమ్మడి గాలి నుండి గాలికి ఇంధనం నింపే సంభావ్యత చుట్టూ కేంద్రీకృతమై ఉన్నాయి.",
    ),

    Question(
      questionText: "అర్జెంటీనా యొక్క ఇటీవలి ప్రెసిడెన్షియల్ రన్‌ఆఫ్‌లో ఎవరు నిర్ణయాత్మక విజయం సాధించారు?",
      options: [
        "ఆర్థిక మంత్రి సెర్గియో మాసా.",
        "జేవియర్ మిలే, ఒక అరాచక-పెట్టుబడిదారీ స్వీయ-వర్ణన.",
        "సాంప్రదాయ రాజకీయ వ్యక్తి.",
        "వామపక్ష పాపులిస్ట్ అభ్యర్థి."
      ],
      correctAnswerIndex: 1,
      explanation: "అర్జెంటీనా యొక్క ఇటీవలి ప్రెసిడెన్షియల్ రన్‌ఆఫ్‌లో జేవియర్ మిలీ, ఒక అరాచక-పెట్టుబడిదారుడు, నిర్ణయాత్మక విజయం సాధించాడు.",
    ),

    Question(
      questionText: "లక్సెంబర్గ్‌లో ప్రధానమంత్రి పాత్రను ఎవరు చేపట్టబోతున్నారు?",
      options: [
        "వ్లాదిమిర్ పుతిన్.",
        "రిచర్డ్ మార్లెస్.",
        "లూక్ ఫ్రైడెన్.",
        "అనురాగ్ సింగ్ ఠాకూర్."
      ],
      correctAnswerIndex: 2,
      explanation: "మాజీ ఆర్థిక మంత్రి లూక్ ఫ్రైడెన్ లక్సెంబర్గ్‌లో ప్రధానమంత్రి పాత్రను స్వీకరించబోతున్నారు.",
    ),

    Question(
      questionText: "రష్యన్ ప్రెసిడెంట్ వ్లాదిమిర్ పుతిన్ ఎప్పుడు వర్చువల్ G20 లీడర్స్ మీటింగ్‌లో పాల్గొంటారు?",
      options: [
        "నవంబర్ 22.",
        "సెప్టెంబర్ 30.",
        "డిసెంబర్ 1.",
        "అక్టోబర్ 15."
      ],
      correctAnswerIndex: 0,
      explanation: "నవంబర్ 22న వర్చువల్ G20 నాయకుల సమావేశంలో వ్లాదిమిర్ పుతిన్ పాల్గొనబోతున్నారు.",
    ),

    Question(
      questionText: "స్వేచ్ఛా వాణిజ్య ఒప్పందం (FTA) కోసం UK మరియు భారతదేశం మధ్య జరిగిన చర్చలలో అపరిష్కృతంగా ఉన్న కీలక సమస్య ఏమిటి?",
      options: [
        "వాణిజ్య సుంకాలు.",
        "కార్మిక హక్కులు.",
        "భౌగోళిక సూచిక (GI) ఉత్పత్తులకు రక్షణ స్థాయి.",
        "సైనిక సహకారం."
      ],
      correctAnswerIndex: 2,
      explanation: "వ్యవసాయ రంగం నుండి జియోగ్రాఫికల్ ఇండికేషన్ (GI) ఉత్పత్తులకు రక్షణ స్థాయి అనేది పరిష్కరించబడని కీలక సమస్య.",
    ),

    Question(
      questionText: "ఎర్ర సముద్రంలో యెమెన్ హౌతీ తిరుగుబాటుదారులు హైజాక్ చేసిన కార్గో షిప్ ఏది?",
      options: [
        "ఫ్రీడం వాయేజర్.",
        "గెలాక్సీ లీడర్.",
        "ఓషన్ ఎక్స్‌ప్లోరర్.",
        "సీ గార్డియన్."
      ],
      correctAnswerIndex: 1,
      explanation: "టర్కీ నుండి భారతదేశానికి వెళ్తున్న కార్గో షిప్ 'గెలాక్సీ లీడర్' ఎర్ర సముద్రంలో యెమెన్ హౌతీ తిరుగుబాటుదారులచే హైజాక్ చేయబడింది.",
    ),

    Question(
      questionText: "శ్రీ అనురాగ్ సింగ్ ఠాకూర్ ప్రారంభించిన ఫిల్మ్ బజార్ దేనిని సూచిస్తుంది?",
      options: [
        "ఒక రాజకీయ శిఖరాగ్ర సమావేశం.",
        "ఒక సైనిక ప్రదర్శన.",
        "ఎ సౌత్ ఏషియన్ ఫిల్మ్ మార్కెట్.",
        "ఒక అంతర్జాతీయ క్రీడా కార్యక్రమం."
      ],
      correctAnswerIndex: 2,
      explanation: "ఫిల్మ్ బజార్ అతిపెద్ద దక్షిణాసియా సినిమా మార్కెట్‌ను సూచిస్తుంది.",
    ),

    Question(
      questionText: "ఇజ్రాయెల్ మరియు హమాస్ మధ్య దౌత్యపరమైన పురోగతి ఏమిటి?",
      options: [
        "వాణిజ్య ఒప్పందాలు.",
        "బందీలు మరియు పాలస్తీనా ఖైదీల విడుదల.",
        "ఉమ్మడి సైనిక వ్యాయామాలు.",
        "ఒక సంవత్సరం పాటు కాల్పుల విరమణ."
      ],
      correctAnswerIndex: 1,
      explanation: "దౌత్యపరమైన పురోగతిలో కనీసం 50 మంది బందీలు మరియు అనేక మంది పాలస్తీనా ఖైదీల విడుదల ఉంటుంది.",
    ),

    Question(
      questionText: "ఇండోనేషియాలో జరిగే ఆసియాన్-ఇండియా మిల్లెట్ ఫెస్టివల్ 2023లో దేనికి ప్రాధాన్యత ఉంది?",
      options: [
        "అంతరిక్ష పరిశోధనము.",
        "పాక వైవిధ్యాన్ని ప్రోత్సహించడం.",
        "అణు నిరాయుధీకరణ.",
        "వాతావరణ మార్పు కార్యక్రమాలు."
      ],
      correctAnswerIndex: 1,
      explanation: "ఆసియాన్-ఇండియా మిల్లెట్ ఫెస్టివల్ 2023 పాక వైవిధ్యాన్ని ప్రోత్సహించడం మరియు స్థిరమైన వ్యవసాయాన్ని ప్రోత్సహించడంపై దృష్టి పెడుతుంది.",
    ),

    Question(
      questionText: "ఉగ్రవాద సంస్థ లష్కరే తోయిబా (LeT) గురించి ఇజ్రాయెల్ అధికారికంగా ఏమి ప్రకటించింది?",
      options: [
        "రాజకీయ పార్టీగా గుర్తింపు.",
        "వారి కారణానికి మద్దతు.",
        "అధికారిక వైఖరి లేదు.",
        "ఉగ్రవాద సంస్థగా ప్రకటన."
      ],
      correctAnswerIndex: 3,
      explanation: "పాకిస్తాన్ ఆధారిత ఉగ్రవాద సంస్థ లష్కరే తోయిబా (ఎల్‌ఈటీ)ని ఇజ్రాయెల్ అధికారికంగా ఉగ్రవాద సంస్థగా ప్రకటించింది.",
    ),

    Question(
      questionText: "చైనాలోని ఆరోగ్య అధికారులు ప్రస్తుతం ఏమి దర్యాప్తు చేస్తున్నారు?",
      options: [
        "COVID-19 కేసులలో పెరుగుదల.",
        "పెద్దలను ప్రభావితం చేసే గుర్తించబడని అనారోగ్యం.",
        "మలేరియా కేసులు.",
        "పిల్లలను ప్రభావితం చేసే గుర్తించబడని అనారోగ్యం కేసులలో పెరుగుదల."
      ],
      correctAnswerIndex: 3,
      explanation: "చైనాలోని ఆరోగ్య అధికారులు ప్రస్తుతం గుర్తించబడని అనారోగ్యం, ముఖ్యంగా పిల్లలను ప్రభావితం చేసే కేసుల పెరుగుదలను పరిశీలిస్తున్నారు.",
    ),

    Question(
      questionText: "UAE ప్రారంభించిన ప్రపంచంలోనే అతిపెద్ద సింగిల్-సైట్ సోలార్ పవర్ ప్లాంట్ పేరు ఏమిటి?",
      options: [
        "సన్‌షైన్ ఒయాసిస్.",
        "సోలారిస్ హెవెన్.",
        "అల్ దఫ్రా సోలార్ ఫోటోవోల్టాయిక్ (PV) ఇండిపెండెంట్ పవర్ ప్రాజెక్ట్.",
        "ఎకోసన్ పారడైజ్."
      ],
      correctAnswerIndex: 2,
      explanation: "UAE ప్రారంభించిన ప్రపంచంలోనే అతిపెద్ద సింగిల్-సైట్ సోలార్ పవర్ ప్లాంట్ అల్ దఫ్రా సోలార్ ఫోటోవోల్టాయిక్ (PV) ఇండిపెండెంట్ పవర్ ప్రాజెక్ట్.",
    ),

    Question(
      questionText: "ఇటీవలి డచ్ ఎన్నికలలో ఎవరు మైలురాయి విజయం సాధించారు?",
      options: [
        "ఏంజెలా మెర్కెల్.",
        "ఇమ్మాన్యుయేల్ మాక్రాన్.",
        "గీర్ట్ వైల్డర్స్.",
        "థెరిసా మే."
      ],
      correctAnswerIndex: 2,
      explanation: "ఫ్రీడమ్ పార్టీ (PVV) నాయకుడు గీర్ట్ వైల్డర్స్ ఇటీవలి డచ్ ఎన్నికలలో మైలురాయి విజయాన్ని సాధించారు.",
    ),

    Question(
      questionText: "న్యూ ఢిల్లీలోని ఆఫ్ఘనిస్తాన్ రాయబార కార్యాలయం శాశ్వతంగా మూసివేస్తున్నట్లు ఎందుకు అధికారికంగా ప్రకటించింది?",
      options: [
        "దౌత్య సంబంధాలు లేకపోవడం.",
        "భారత ప్రభుత్వం నుండి నిరంతర సవాళ్లు.",
        "భద్రతా ఆందోళనలు.",
        "ఆర్థిక ఇబ్బందులు."
      ],
      correctAnswerIndex: 1,
      explanation: "భారత ప్రభుత్వం నుండి నిరంతర సవాళ్లను ప్రధాన కారణంగా పేర్కొంటూ, న్యూఢిల్లీలోని ఆఫ్ఘనిస్తాన్ రాయబార కార్యాలయం తన శాశ్వత మూసివేతను అధికారికంగా ప్రకటించింది.",
    ),

    Question(
      questionText: "ఆర్గనైజేషన్ ఫర్ ఎకనామిక్ కో-ఆపరేషన్ అండ్ డెవలప్‌మెంట్ (OECD) ప్రకారం, 2022లో ఏ దేశం అగ్రగామి సహాయ ప్రదాతగా ఉద్భవించింది?",
      options: [
        "చైనా.",
        "భారతదేశం.",
        "సంయుక్త రాష్ట్రాలు.",
        "రష్యా."
      ],
      correctAnswerIndex: 2,
      explanation: "ఆర్గనైజేషన్ ఫర్ ఎకనామిక్ కో-ఆపరేషన్ అండ్ డెవలప్‌మెంట్ (OECD) ప్రకారం, యునైటెడ్ స్టేట్స్ 2022లో అగ్రగామి సహాయ ప్రదాతగా ఉద్భవించింది.",
    ),

    Question(
      questionText: "డిసెంబరు 1 నుండి భారతదేశం మరియు చైనా నుండి వచ్చే సందర్శకుల కోసం మలేషియా ఏ ఏర్పాటు చేస్తోంది?",
      options: [
        "30 రోజుల వీసా రహిత ప్రయాణం.",
        "వసతిపై ప్రత్యేక తగ్గింపులు.",
        "పొడిగించిన పని అనుమతులు.",
        "తప్పనిసరిగా రోగ అనుమానితులను విడిగా ఉంచాలి."
      ],
      correctAnswerIndex: 0,
      explanation: "డిసెంబర్ 1 నుండి భారతదేశం నుండి వచ్చే సందర్శకులకు మలేషియా 30 రోజుల వీసా రహిత ప్రయాణాన్ని అందిస్తోంది.",
    ),

    Question(
      questionText: "భారతదేశ ద్వైపాక్షిక స్వేచ్ఛా వాణిజ్య ఒప్పందాల (FTAలు) గురించి గ్లోబల్ ట్రేడ్ రీసెర్చ్ ఇనిషియేటివ్ (GTRI) ఏమి సిఫార్సు చేస్తుంది?",
      options: [
        "అన్ని FTAల తక్షణ ముగింపు.",
        "అన్ని దేశాలతో FTAల విస్తరణ.",
        "సింగపూర్ మరియు థాయ్‌లాండ్‌తో ఒప్పందాలపై దృష్టి సారించే సమగ్ర సమీక్ష.",
        "ఇప్పటికే ఉన్న FTAలకు మార్పులు లేవు."
      ],
      correctAnswerIndex: 2,
      explanation: "గ్లోబల్ ట్రేడ్ రీసెర్చ్ ఇనిషియేటివ్ (GTRI) భారతదేశం యొక్క ద్వైపాక్షిక స్వేచ్ఛా వాణిజ్య ఒప్పందాల (FTAలు) సమగ్ర సమీక్షను సిఫార్సు చేసింది, ప్రత్యేకంగా సింగపూర్ మరియు థాయ్‌లాండ్‌తో ఒప్పందాలపై దృష్టి సారిస్తుంది.",
    ),

    Question(
      questionText: "రాబర్ట్ షెట్‌కిన్‌టాంగ్‌కి సంబంధించిన ముఖ్యమైన దౌత్య చర్య ఏమిటి?",
      options: [
        "కొత్త రాయబార కార్యాలయ స్థాపన.",
        "ఐక్యరాజ్యసమితికి రాయబారిగా నియామకం.",
        "రిపబ్లిక్ ఆఫ్ మొజాంబిక్‌కి భారతదేశ తదుపరి హైకమీషనర్‌గా హోదా.",
        "దౌత్య సేవ నుండి రాజీనామా."
      ],
      correctAnswerIndex: 2,
      explanation: "ఫెడరల్ డెమోక్రటిక్ రిపబ్లిక్ ఆఫ్ ఇథియోపియాకు ప్రస్తుత భారత రాయబారి రాబర్ట్ షెట్కిన్‌టాంగ్, రిపబ్లిక్ ఆఫ్ మొజాంబిక్‌కు తదుపరి భారత హైకమీషనర్‌గా నియమించబడ్డారు.",
    ),

    Question(
      questionText: "UKలో కనుగొనబడిన H1N2 లేదా పిగ్ వైరస్ యొక్క మొదటి మానవ కేసు ఏమిటి?",
      options: [
        "తీవ్రమైన అనారోగ్యం మరణానికి దారి తీస్తుంది.",
        "పూర్తి కోలుకోవడంతో తేలికపాటి అనారోగ్యం.",
        "లక్షణం లేని కేసు.",
        "కొనసాగుతున్న సమస్యలతో తీవ్రమైన అనారోగ్యం."
      ],
      correctAnswerIndex: 1,
      explanation: "UKలో కనుగొనబడిన H1N2 లేదా పిగ్ వైరస్ యొక్క మొదటి మానవ కేసు తేలికపాటి అనారోగ్యాన్ని అనుభవించింది మరియు పూర్తిగా కోలుకుంది.",
    ),

    Question(
      questionText: "న్యూ సౌత్ వేల్స్ లిబరల్ సెనేట్ రేసులో విజయం సాధించడం ద్వారా గణనీయమైన రాజకీయ పునరాగమనాన్ని ఎవరు సాధించారు?",
      options: [
        "ఏంజెలా మెర్కెల్.",
        "ఇమ్మాన్యుయేల్ మాక్రాన్.",
        "గీర్ట్ వైల్డర్స్.",
        "డేవ్ శర్మ."
      ],
      correctAnswerIndex: 3,
      explanation: "న్యూ సౌత్ వేల్స్ లిబరల్ సెనేట్ రేసులో విజయం సాధించడం ద్వారా భారత సంతతికి చెందిన రాజకీయ నాయకుడు డేవ్ శర్మ గణనీయమైన రాజకీయ పునరాగమనాన్ని పొందారు.",
    ),

    Question(
      questionText: "న్యూజిలాండ్‌లో ఇటీవల ఎన్నికైన ప్రభుత్వం ధూమపానాన్ని నిషేధించే లక్ష్యంతో ఏ సంచలనాత్మక చట్టాన్ని రద్దు చేసింది?",
      options: [
        "బహిరంగ ప్రదేశాలలో ధూమపానంపై ఆంక్షలు.",
        "క్రమంగా పెరుగుతున్న ధూమపాన వయస్సు.",
        "సిగరెట్ ఉత్పత్తిపై నిషేధం.",
        "తప్పనిసరి ధూమపాన వ్యతిరేక ప్రచారాలు."
      ],
      correctAnswerIndex: 1,
      explanation: "న్యూజిలాండ్ యొక్క ఇటీవల ఎన్నికైన ప్రభుత్వం భవిష్యత్ తరాలకు ధూమపానాన్ని నిషేధించే లక్ష్యంతో తన సంచలనాత్మక చట్టాన్ని విడిచిపెట్టాలని నిర్ణయించుకుంది, ఇది క్రమంగా పెరుగుతున్న ధూమపాన వయస్సును స్థాపించింది.",
    ),

    Question(
      questionText: "మంగళవారం ఉదయం ఇండోనేషియాలోని అనక్ క్రకటౌ అగ్నిపర్వతం వద్ద ఏ ముఖ్యమైన సంఘటన జరిగింది?",
      options: [
        "ప్రభావం లేని శాంతియుత విస్ఫోటనం.",
        "అగ్నిపర్వత వాయువుల విడుదల.",
        "గత సంవత్సరం ఏప్రిల్ నుండి అగ్నిపర్వత కార్యకలాపాలు అధికమయ్యాయి.",
        "కొత్త అగ్నిపర్వత ద్వీపం ఏర్పడటం."
      ],
      correctAnswerIndex: 2,
      explanation: "ఇండోనేషియా యొక్క అనక్ క్రకటౌ అగ్నిపర్వతం మంగళవారం ఉదయం ఒక శక్తివంతమైన విస్ఫోటనాన్ని ఆవిష్కరించింది, ఇది గత సంవత్సరం ఏప్రిల్ నుండి అధిక అగ్నిపర్వత కార్యకలాపాల కొనసాగింపును సూచిస్తుంది.",
    ),

    Question(
      questionText: "ఆసియాన్ ఇండియా గ్రాస్‌రూట్స్ ఇన్నోవేషన్ ఫోరమ్ 2023 యొక్క దృష్టి ఏమిటి?",
      options: [
        "అంతరిక్ష పరిశోధనము.",
        "సాంస్కృతిక మార్పిడిల ప్రచారం.",
        "దేశాల మధ్య సంబంధాలను బలోపేతం చేయడం.",
        "అట్టడుగు స్థాయిలో సైన్స్, టెక్నాలజీ మరియు ఇన్నోవేషన్ (STI)."
      ],
      correctAnswerIndex: 3,
      explanation: "ఆసియాన్ ఇండియా గ్రాస్‌రూట్స్ ఇన్నోవేషన్ ఫోరమ్ 2023 యొక్క దృష్టి దేశాల మధ్య సంబంధాలను బలోపేతం చేయడం మరియు సైన్స్, టెక్నాలజీ మరియు ఇన్నోవేషన్ (STI) రంగాలలో అట్టడుగు స్థాయిలో సామాజిక ఆవిష్కరణలను ప్రోత్సహించడం.",
    ),

    Question(
      questionText: "2015లో నేపాల్ రాజ్యాంగం వివక్షకు సంబంధించి ఎలాంటి సాహసోపేతమైన చర్య తీసుకుంది?",
      options: [
        "వివక్ష ప్రస్తావన లేదు.",
        "లింగం ఆధారంగా వివక్ష నిషేధం.",
        "మతం ఆధారంగా వివక్ష నిషేధం.",
        "లైంగిక ధోరణి ఆధారంగా వివక్ష నిషేధం."
      ],
      correctAnswerIndex: 3,
      explanation: "2015లో ఆమోదించబడిన నేపాల్ రాజ్యాంగం, లైంగిక ధోరణి ఆధారంగా వివక్షను స్పష్టంగా నిషేధించడం ద్వారా సాహసోపేతమైన చర్య తీసుకుంది.",
    ),

    Question(
      questionText: "ఎగ్జిక్యూటివ్ సెంటర్ (TEC), ఫ్లెక్సిబుల్ వర్క్‌స్పేస్ ప్రొవైడర్ ఏయే ప్రాంతాలు విస్తరణ కోసం వ్యూహాత్మకంగా దృష్టి సారిస్తున్నాయి?",
      options: [
        "ఉత్తర అమెరికా మరియు యూరప్.",
        "లాటిన్ అమెరికా మరియు ఆఫ్రికా.",
        "భారతదేశం మరియు మధ్యప్రాచ్యం.",
        "ఆసియా-పసిఫిక్ మరియు ఆస్ట్రేలియా."
      ],
      correctAnswerIndex: 2,
      explanation: "కార్యనిర్వాహక కేంద్రం (TEC) వ్యూహాత్మకంగా దాని అత్యంత వేగంగా అభివృద్ధి చెందుతున్న మార్కెట్లు, భారతదేశం మరియు మధ్యప్రాచ్యంలో సుమారుగా 500,000 చ.అ.లను జోడించే ప్రణాళికలతో దృష్టి సారించింది.",
    ),

    Question(
      questionText: "టర్కిష్ రిపబ్లిక్ తన 100వ వార్షికోత్సవాన్ని ఎలా జరుపుకుంది?",
      options: [
        "గ్రాండ్ గాలా రిసెప్షన్.",
        "మిలిటరీ కవాతు.",
        "బాణాసంచా మరియు డ్రోన్ ప్రదర్శనతో వేడుకలను అణచివేసింది.",
        "అంతర్జాతీయ సంగీత ఉత్సవం."
      ],
      correctAnswerIndex: 2,
      explanation: "టర్కిష్ రిపబ్లిక్ తన 100వ వార్షికోత్సవాన్ని సాపేక్షంగా అణచివేయబడిన వేడుకతో ఇస్తాంబుల్‌లో బాణసంచా మరియు డ్రోన్ ప్రదర్శన మరియు 100 నౌకాదళ నౌకల ఊరేగింపుతో జరుపుకుంది, కానీ గొప్ప గాలా రిసెప్షన్ లేదు.",
    ),

    Question(
      questionText: "ప్రధాని నరేంద్ర మోడీ గుజరాత్‌లోని మెహసానా జిల్లాలో ఏ అభివృద్ధి కార్యక్రమాలను ప్రారంభిస్తారు?",
      options: [
        "రోడ్డు నిర్మాణ ప్రాజెక్టులు.",
        "విద్యా కార్యక్రమాలు.",
        "పునరుత్పాదక ఇంధన ప్రాజెక్టులు.",
        "రూ.5,950 కోట్ల విలువైన ప్రాజెక్ట్‌లు."
      ],
      correctAnswerIndex: 3,
      explanation: "ప్రధానమంత్రి నరేంద్ర మోడీ గుజరాత్‌లోని మెహసానా జిల్లాలో ₹5,950 కోట్ల విలువైన వివిధ అభివృద్ధి ప్రాజెక్టులను ప్రారంభించనున్నారు మరియు ప్రారంభిస్తారు.",
    ),

    Question(
      questionText: "నేషనల్ మెడికల్ కమిషన్ మిషన్ యొక్క దృష్టి ఏమిటి?",
      options: [
        "వైద్య శాస్త్రాలలో పరిశోధన.",
        "వైద్య విద్యార్థులకు ఆర్థిక సహాయం అందించడం.",
        "ప్రతి వైద్యుడికి ఒక ప్రత్యేక గుర్తింపు సంఖ్యను కేటాయించడం.",
        "కొత్త వైద్య కళాశాలల ఏర్పాటు."
      ],
      correctAnswerIndex: 2,
      explanation: "నేషనల్ మెడికల్ కమిషన్ (NMC) 2024 చివరి నాటికి దేశంలోని ప్రతి వైద్యునికి ఒక ప్రత్యేక గుర్తింపు సంఖ్యను కేటాయించే మిషన్‌ను ప్రారంభించింది.",
    ),

    Question(
      questionText: "2022-23 ఆర్థిక సంవత్సరంలో భారతదేశ శ్రామిక శక్తిలో మహిళల శాతం ఎంత?",
      options: [
        "23 శాతం.",
        "30 శాతం.",
        "37 శాతం.",
        "45 శాతం."
      ],
      correctAnswerIndex: 2,
      explanation: "భారత శ్రామికశక్తిలో మహిళల భాగస్వామ్యం గణనీయమైన పెరుగుదలను చూసింది, 2022-23 ఆర్థిక సంవత్సరంలో 37 శాతానికి చేరుకుంది.",
    ),

    Question(
      questionText: "హిందుస్థాన్ టైమ్స్ లీడర్‌షిప్ సమ్మిట్ సందర్భంగా అశ్విని వైష్ణవ్ వివరించిన ప్రధాన బలాలు మరియు వృద్ధి సామర్థ్యం ఏమిటి?",
      options: [
        "భారతదేశ సాంస్కృతిక వారసత్వం మరియు పాక వైవిధ్యం.",
        "సెమీకండక్టర్ మరియు టెక్నాలజీ రంగాలలో చొరవ.",
        "5G మరియు 6G నెట్‌వర్క్‌లలో ప్రపంచ పురోగతి.",
        "శక్తి సామర్థ్యంలో సంచలనాత్మక కార్యక్రమాలు."
      ],
      correctAnswerIndex: 1,
      explanation: "హిందుస్తాన్ టైమ్స్ లీడర్‌షిప్ సమ్మిట్ సందర్భంగా అశ్విని వైష్ణవ్ భారతదేశం యొక్క ప్రధాన బలాలు, వృద్ధి సామర్థ్యం మరియు సెమీకండక్టర్ మరియు టెక్నాలజీ రంగాలలో కీలక కార్యక్రమాలను వివరించారు.",
    ),

    Question(
      questionText: "వరల్డ్ ఫుడ్ ఇండియా 2023 యొక్క ప్రాముఖ్యత ఏమిటి మరియు ఈవెంట్‌ను ఎవరు ప్రారంభిస్తారు?",
      options: [
        "ఇది సాంస్కృతిక వారసత్వాన్ని ప్రోత్సహిస్తుంది మరియు అశ్విని వైష్ణవ్ చేత ప్రారంభించబడింది.",
        "ఇది ప్రపంచ ఆహార సంభావ్యతపై దృష్టి పెడుతుంది మరియు నరేంద్ర మోడీచే ప్రారంభించబడింది.",
        "ఇది సమర్థవంతమైన అభ్యర్థి మరియు ఎన్నికల నిర్వహణను నొక్కి చెబుతుంది.",
        "ఇది పీయూష్ గోయల్ ద్వారా వ్యవసాయ-ఆహార రంగంలో చొరవలను ఆవిష్కరించింది."
      ],
      correctAnswerIndex: 1,
      explanation: "వరల్డ్ ఫుడ్ ఇండియా 2023 సంస్కృతి, వంటకాలు మరియు వాణిజ్యాన్ని ఏకం చేస్తుంది, చర్చలు, భాగస్వామ్యాలు మరియు వ్యవసాయ-ఆహార రంగ పెట్టుబడులకు వేదికను అందిస్తుంది. దీనిని ప్రధాన మంత్రి నరేంద్ర మోడీ ప్రారంభిస్తారు.",
    ),

    Question(
      questionText: "ENCORE అంటే ఏమిటి మరియు ఈ సాఫ్ట్‌వేర్‌ను ఎవరు అభివృద్ధి చేసారు?",
      options: [
        "సమర్థవంతమైన అభ్యర్థి మరియు ఎన్నికల నిర్వహణ కోసం సమగ్ర సాఫ్ట్‌వేర్ సూట్ EESL చే అభివృద్ధి చేయబడింది.",
        "అశ్విని వైష్ణవ్ అభివృద్ధి చేసిన సెమీకండక్టర్ పరిశ్రమ కోసం ఒక సాఫ్ట్‌వేర్.",
        "EESL ద్వారా శక్తి సామర్థ్యంలో ఒక సంచలనాత్మక చొరవ.",
        "భారత ఎన్నికల సంఘం అభివృద్ధి చేసిన ఎన్నికల నిర్వహణ కోసం ఒక సాఫ్ట్‌వేర్."
      ],
      correctAnswerIndex: 3,
      explanation: "ENCORE అనేది సమర్థవంతమైన అభ్యర్థి మరియు ఎన్నికల నిర్వహణ కోసం రూపొందించబడిన ఒక సమగ్ర సాఫ్ట్‌వేర్ సూట్. దీనిని భారత ఎన్నికల సంఘం అభివృద్ధి చేసింది.",
    ),

    Question(
      questionText: "నవంబర్ 2, 2023న ఎనర్జీ ఎఫిషియెన్సీ సర్వీసెస్ లిమిటెడ్ (EESL) ఆవిష్కరించిన రెండు సంచలనాత్మక కార్యక్రమాలు ఏమిటి?",
      options: [
        "నేషనల్ ఎఫిషియెంట్ కుకింగ్ ప్రోగ్రామ్ (NECP) మరియు ఎనర్జీ ఎఫిషియెంట్ ఫ్యాన్స్ ప్రోగ్రామ్ (EEFP).",
        "సెమీకండక్టర్ మరియు టెక్నాలజీ ఇనిషియేటివ్స్.",
        "వరల్డ్ ఫుడ్ ఇండియా మరియు ENCORE.",
        "ఇండియా మాన్యుఫ్యాక్చరింగ్ షో అండ్ మేక్ ఇన్ ఇండియా."
      ],
      correctAnswerIndex: 0,
      explanation: "EESL నవంబర్ 2, 2023న నేషనల్ ఎఫిషియెంట్ కుకింగ్ ప్రోగ్రామ్ (NECP) మరియు ఎనర్జీ ఎఫిషియెంట్ ఫ్యాన్స్ ప్రోగ్రామ్ (EEFP) అనే రెండు సంచలనాత్మక కార్యక్రమాలను ఆవిష్కరించింది.",
    ),

    Question(
      questionText: "శ్రీ రాజ్‌నాథ్ సింగ్ ప్రారంభించిన 'ఇండియా మాన్యుఫ్యాక్చరింగ్ షో' యొక్క ప్రధాన అంశం ఏమిటి?",
      options: [
        "5G మరియు 6G నెట్‌వర్క్‌లలో ప్రపంచ పురోగతి.",
        "మేక్ ఇన్ ఇండియా, మేక్ ఫర్ ది వరల్డ్.",
        "సమర్థవంతమైన అభ్యర్థి మరియు ఎన్నికల నిర్వహణ.",
        "స్థానికంగా తయారు చేసిన ఉత్పత్తుల ప్రచారం."
      ],
      correctAnswerIndex: 1,
      explanation: "ఇండియా మాన్యుఫ్యాక్చరింగ్ షో' యొక్క కేంద్ర ఇతివృత్తం 'మేక్ ఇన్ ఇండియా, మేక్ ఫర్ ది వరల్డ్,' భారతదేశ ఆర్థిక దృశ్యంలో చిన్న తరహా పరిశ్రమల ప్రాముఖ్యతను నొక్కి చెబుతుంది.",
    ),

    Question(
      questionText: "ఇండియా మొబైల్ కాంగ్రెస్ 2023లో కేంద్ర కమ్యూనికేషన్ & ఐటీ మంత్రి అశ్విని వైష్ణవ్ ఏ ప్రకటన చేశారు?",
      options: [
        "భారత్' అట్టా ప్రారంభం.",
        "2024లో వరల్డ్ టెలికమ్యూనికేషన్ స్టాండర్డైజేషన్ అసెంబ్లీ (WTSA)కి భారతదేశం ఆతిథ్యం ఇస్తుంది.",
        "బెంగళూరులో మూడు రోజుల 'ఇండియా మాన్యుఫ్యాక్చరింగ్ షో' ప్రారంభోత్సవం.",
        "ముంబై నుండి కోస్టా సెరెనా యొక్క తొలి ప్రయాణాన్ని ఫ్లాగ్ చేయడం."
      ],
      correctAnswerIndex: 1,
      explanation: "2024లో ఇండియా మొబైల్ కాంగ్రెస్ 2023లో వరల్డ్ టెలికమ్యూనికేషన్ స్టాండర్డైజేషన్ అసెంబ్లీ (WTSA)కి భారతదేశం ఆతిథ్యం ఇస్తుందని అశ్విని వైష్ణవ్ ప్రకటించారు.",
    ),

    Question(
      questionText: "భారతదేశం యొక్క మొట్టమొదటి అంతర్జాతీయ క్రూయిజ్ లైనర్ కోస్టా సెరెనా యొక్క తొలి ప్రయాణాన్ని ఎవరు ప్రారంభించారు మరియు అది ఎక్కడ జరిగింది?",
      options: [
        "న్యూ ఢిల్లీలో నరేంద్ర మోడీ.",
        "అశ్విని వైష్ణవ్ ఇన్ ముంబై.",
        "శ్రీ సర్బానంద సోనోవాల్ బెంగళూరులో.",
        "పియూష్ గోయల్ రాజ్‌కోట్, గుజరాత్."
      ],
      correctAnswerIndex: 2,
      explanation: "కేంద్ర నౌకాశ్రయాలు, షిప్పింగ్ & జలమార్గాల మంత్రి శ్రీ సర్బానంద సోనోవాల్, ముంబై నుండి కోస్టా సెరెనా యొక్క తొలి ప్రయాణాన్ని ఫ్లాగ్ చేశారు, ఇది భారతదేశ క్రూజింగ్ మరియు టూరిజం పరిశ్రమలో పరివర్తన దశను సూచిస్తుంది.",
    ),

    Question(
      questionText: "ప్రధాని నరేంద్ర మోడీ శ్రీ సోమనాథ్ ట్రస్ట్ (SST) ఛైర్మన్‌గా ఎన్నుకోబడి ఎంతకాలం ఉన్నారు?",
      options: [
        "ఒక సంవత్సరం.",
        "రెండు సంవత్సరాలు.",
        "మూడు సంవత్సరాలు.",
        "ఐదేళ్లు."
      ],
      correctAnswerIndex: 3,
      explanation: "ప్రధానమంత్రి నరేంద్ర మోడీ శ్రీ సోమనాథ్ ట్రస్ట్ (SST) యొక్క ఛైర్మన్‌గా ఐదేళ్ల కాలానికి ఎన్నుకోబడ్డారు, ఇది ట్రస్ట్ ఛైర్మన్ యొక్క సాంప్రదాయ ఒక సంవత్సరం పదవీకాలం నుండి గణనీయమైన నిష్క్రమణను సూచిస్తుంది.",
    ),

    Question(
      questionText: "వినియోగదారులకు సరసమైన గోధుమ పిండిని అందించడానికి పీయూష్ గోయల్ ఏ ముఖ్యమైన చొరవను ప్రారంభించారు?",
      options: [
      "నేషనల్ ఎఫిషియెంట్ కుకింగ్ ప్రోగ్రామ్ (NECP).",
      "ఎనర్జీ ఎఫిషియెంట్ ఫ్యాన్స్ ప్రోగ్రామ్ (EEFP).",
      "వోకల్ ఫర్ లోకల్ కింద 'భారత్' అట్ట.",
    "దీపావళి ఉత్సవ్' గ్రామశిల్ప, కన్నాట్ ప్లేస్‌లోని ఖాదీ లాంజ్."
      ],
      correctAnswerIndex: 2,
      explanation: "పీయూష్ గోయల్ 'భారత్' బ్రాండ్ గోధుమ పిండిని ప్రారంభించారు, మార్కెట్ ధరలకు సరసమైన ప్రత్యామ్నాయాన్ని అందించడం మరియు 'వోకల్ ఫర్ లోకల్' చొరవ కింద రైతులు మరియు వినియోగదారులకు మద్దతు ఇవ్వడం లక్ష్యంగా పెట్టుకున్నారు.",
    ),

    Question(
      questionText: "పశుసంవర్ధక మరియు పాడిపరిశ్రమ శాఖ యొక్క పెవిలియన్ ప్రారంభోత్సవం దేనికి సంకేతం?",
      options: [
        "భారతదేశపు గొప్ప ఆహార సంస్కృతికి సంబంధించిన వేడుక.",
        "స్థిరమైన వ్యవసాయం మరియు పశువుల పద్ధతుల పట్ల నిబద్ధత.",
        "శక్తి సామర్థ్యంలో ఒక సంచలనాత్మక చొరవ.",
        "అత్యాధునిక సాంకేతికతలు మరియు ఆవిష్కరణలను ప్రదర్శించడానికి ఒక వేదిక."
      ],
      correctAnswerIndex: 1,
      explanation: "పశుసంవర్ధక మరియు పాడిపరిశ్రమ శాఖ యొక్క పెవిలియన్ ప్రారంభోత్సవం స్థిరమైన వ్యవసాయం మరియు పశువుల పద్ధతులకు నిబద్ధతను సూచిస్తుంది.",
    ),

    Question(
      questionText: "గోండాల్, రాజ్‌కోట్ గుజరాత్‌లో ఇటీవలి అభివృద్ధిలో భారత్ బొటానిక్స్ ఏమి ప్రకటించింది?",
      options: [
        "సుప్రీంకోర్టు ప్రాంగణంలో ఒక ప్రత్యేకమైన స్థాపన.",
        "సరయు నదిపై సౌరశక్తితో నడిచే 'మినీ-క్రూయిజ్' షిప్.",
        "వుడ్-ప్రెస్డ్ కోల్డ్ ఆయిల్ ప్రాసెసింగ్ ఫెసిలిటీ ఓపెనింగ్.",
        "IFFI గోవాలో VFX మరియు టెక్ పెవిలియన్ ప్రారంభోత్సవం."
      ],
      correctAnswerIndex: 2,
      explanation: "భారత్ బొటానిక్స్ గుజరాత్‌లోని రాజ్‌కోట్‌లోని గోండాల్‌లో అత్యాధునిక వుడ్ ప్రెస్డ్ కోల్డ్ ఆయిల్ ప్రాసెసింగ్ సదుపాయాన్ని ప్రారంభించినట్లు ప్రకటించింది.",
    ),

    Question(
      questionText: "ఛత్రపతి శివాజీ మహారాజ్ విగ్రహం ఎక్కడ ప్రారంభించబడింది మరియు అది దేనిని సూచిస్తుంది?",
      options: [
        "బెంగళూరు; భారతదేశం యొక్క గొప్ప ఆహార సంస్కృతి యొక్క వేడుక.",
        "కుప్వారా జిల్లా, జమ్మూ మరియు కాశ్మీర్; సాంస్కృతిక గర్వానికి చిహ్నం.",
        "రవిదాస్ ఘాట్, వారణాసి; స్థిరమైన శక్తి పరిష్కారాలను అవలంబించడంలో గణనీయమైన పురోగతి.",
        "కన్నాట్ ప్లేస్, న్యూఢిల్లీ; ఫిల్మ్ మేకింగ్ టెక్నాలజీని ప్రదర్శించడానికి ఒక వేదిక."
      ],
      correctAnswerIndex: 1,
      explanation: "సాంస్కృతిక గర్వానికి ప్రతీకగా జమ్మూ కాశ్మీర్‌లోని కుప్వారా జిల్లాలో ఛత్రపతి శివాజీ మహారాజ్ విగ్రహాన్ని ఆవిష్కరించారు.",
    ),

    Question(
      questionText: "న్యూ ఢిల్లీలోని కన్నాట్ ప్లేస్‌లో ఖాదీ మరియు విలేజ్ ఇండస్ట్రీస్ కమిషన్ (KVIC) ఏ చొరవను ప్రారంభించింది?",
      options: [
        "దీపావళి ఉత్సవ్' గ్రామశిల్ప.",
        "భారత పార్లమెంటు శీతాకాల సమావేశాలు.",
        "ది 'భారత్' బ్రాండ్ గోధుమ పిండి.",
        "ది ఇంటర్నేషనల్ టూరిజం మార్ట్ ఇన్ షిల్లాంగ్, మేఘాలయ."
      ],
      correctAnswerIndex: 0,
      explanation: "KVIC చైర్మన్ శ్రీ మనోజ్ కుమార్ నాయకత్వంలో, న్యూఢిల్లీలోని కన్నాట్ ప్లేస్‌లో 'దీపావళి ఉత్సవ్' గ్రామశిల్ప, ఖాదీ లాంజ్ ప్రారంభించబడింది.",
    ),

    Question(
      questionText: "భారత పార్లమెంటు శీతాకాల సమావేశాలు ఎప్పుడు సమావేశమవుతాయి?",
      options: [
        "నవంబర్ 2 నుండి నవంబర్ 22 వరకు.",
        "నవంబర్ 15.",
        "నవంబర్ 21 నుండి 23, 2023 వరకు.",
        "డిసెంబర్ 4 నుండి డిసెంబర్ 22 వరకు."
      ],
      correctAnswerIndex: 3,
      explanation: "కేంద్ర పార్లమెంటరీ వ్యవహారాల మంత్రి ప్రహ్లాద్ జోషి నవంబర్ 9న ప్రకటించిన ప్రకారం, భారత పార్లమెంటు శీతాకాల సమావేశాలు డిసెంబర్ 4 నుండి డిసెంబర్ 22 వరకు సమావేశమవుతాయి.",
    ),

    Question(
      questionText: "బాణసంచాలో బేరియం మరియు ఇతర నిషేధిత రసాయనాల వాడకంపై భారత సుప్రీం కోర్టు తన ఆదేశాలకు సంబంధించి ఏ explanation ఇచ్చింది?",
      options: [
        "ఆదేశం జాతీయ రాజధాని ప్రాంతానికి మాత్రమే వర్తిస్తుంది.",
        "ఆదేశం మొత్తం దేశానికి వర్తిస్తుంది.",
        "వ్యవసాయంలో నిషేధిత రసాయనాల వినియోగానికి ఆదేశం వర్తిస్తుంది.",
        "తయారీలో నిషేధిత రసాయనాల వినియోగానికి ఆదేశం వర్తిస్తుంది."
      ],
      correctAnswerIndex: 1,
      explanation: "బాణసంచాలో బేరియం మరియు ఇతర నిషేధిత రసాయనాల వాడకాన్ని నిషేధిస్తూ భారత అత్యున్నత న్యాయస్థానం తన ఆదేశం జాతీయ రాజధాని ప్రాంతానికి మాత్రమే కాకుండా దేశం మొత్తానికి వర్తిస్తుందని స్పష్టం చేసింది.",
    ),

    Question(
      questionText: "సుప్రీంకోర్టు ప్రాంగణంలో 'మిట్టి కేఫ్'ని ఎవరు ప్రారంభించారు మరియు దాని ప్రత్యేకత ఏమిటి?",
      options: [
        "నరేంద్ర మోడీ; ఇది వికలాంగులచే నిర్వహించబడుతుంది.",
        "DY చంద్రచూడ్; ఇది పూర్తిగా వైకల్యాలున్న వ్యక్తులచే నిర్వహించబడుతుంది.",
        "అనురాగ్ సింగ్ ఠాకూర్; ఇది ఆరోగ్యకరమైన జీవనాన్ని ప్రోత్సహించే ఒక ప్రత్యేకమైన స్థాపన.",
        "పర్షోత్తం రూపాలా; ఇది సాంస్కృతిక అహంకారానికి చిహ్నం."
      ],
      correctAnswerIndex: 1,
      explanation: "భారత ప్రధాన న్యాయమూర్తి (CJI) DY చంద్రచూడ్ 'మిట్టి కేఫ్'ను ప్రారంభించారు, ఇది సర్వోన్నత న్యాయస్థాన ప్రాంగణంలో పూర్తిగా వికలాంగులచే నిర్వహించబడే ఒక ప్రత్యేకమైన స్థాపన.",
    ),

    Question(
      questionText: "దీపోత్సవ్ ఏడవ ఎడిషన్ సందర్భంగా అయోధ్య ఏ రికార్డు సృష్టించింది?",
      options: [
        "ఒకే చోట ఏకకాలంలో పెద్ద సంఖ్యలో దీపాలను వెలిగించినందుకు ప్రపంచ రికార్డు.",
        "మినీ-క్రూయిజ్ షిప్‌ల యొక్క పొడవైన కవాతు రికార్డు.",
        "ఒక ఆర్థిక సంవత్సరంలో అత్యధిక సంఖ్యలో పేటెంట్లు మంజూరు చేయబడిన రికార్డు.",
        "ఇంటర్నేషనల్ టూరిజం మార్ట్‌ను 11వ సారి నిర్వహించడం రికార్డు."
      ],
      correctAnswerIndex: 0,
      explanation: "అయోధ్య దీపోత్సవం యొక్క ఏడవ ఎడిషన్ సందర్భంగా ఒకే చోట పెద్ద సంఖ్యలో దీపాలను ఒకేసారి వెలిగించినందుకు కొత్త ప్రపంచ రికార్డును నెలకొల్పింది.",
    ),

    Question(
      questionText: "ప్రధాన మంత్రి నరేంద్ర మోడీ ప్రత్యేకంగా హాని కలిగించే గిరిజన సమూహాల (PVTGలు) కోసం ఏ సంచలనాత్మక పథకాన్ని ప్రారంభించబోతున్నారు?",
      options: [
        "PM-PVTG డెవలప్‌మెంట్ మిషన్.",
        "ఉలిహతు గ్రామంలో PM సందర్శన.",
        "సంపీడన బయోగ్యాస్‌ను సహజ వాయువుతో కలపడం.",
        "ఇంటర్నేషనల్ షుగర్ ఆర్గనైజేషన్ (ISO) చైర్మన్."
      ],
      correctAnswerIndex: 0,
      explanation: "ప్రధానమంత్రి నరేంద్ర మోడీ PM-PVTG డెవలప్‌మెంట్ మిషన్‌ను ప్రారంభించబోతున్నారు, ఇది ప్రత్యేకంగా హాని కలిగించే గిరిజన సమూహాలకు (PVTGs) చెందిన సుమారు 28 లక్షల మంది ప్రజల సమగ్ర అభివృద్ధిని ప్రోత్సహించే లక్ష్యంతో ఒక సంచలనాత్మక పథకం.",
    ),

    Question(
      questionText: "నవంబర్ 15న ప్రధానమంత్రి నరేంద్ర మోదీ ఏ చారిత్రక పర్యటన చేయబోతున్నారు?",
      options: [
        "IFFI గోవాలో VFX మరియు టెక్ పెవిలియన్ ప్రారంభోత్సవం.",
        "PM-PVTG డెవలప్‌మెంట్ మిషన్‌ను ప్రారంభించడం.",
        "భగవాన్ బిర్సా ముండా జన్మస్థలమైన ఉలిహతు గ్రామాన్ని సందర్శించడం.",
        "ISO యొక్క భారతదేశం యొక్క ఛైర్మన్‌షిప్ యొక్క ప్రకటన."
      ],
      correctAnswerIndex: 2,
      explanation: "నవంబర్ 15వ తేదీన భగవాన్ బిర్సా ముండా జన్మస్థలమైన ఉలిహతు గ్రామాన్ని సందర్శించిన మొదటి ప్రధానమంత్రిగా ప్రధాని నరేంద్ర మోదీ చరిత్ర సృష్టించనున్నారు.",
    ),

    Question(
      questionText: "ఇండో-పసిఫిక్ ప్రాంతీయ సంభాషణలో ఆర్థిక మంత్రి నిర్మలా సీతారామన్ ఏ ఆర్థిక అంచనా వేశారు?",
      options: [
        "2027 నాటికి భారతదేశం జపాన్ మరియు జర్మనీలను అధిగమించి ప్రపంచంలో మూడవ అతిపెద్ద ఆర్థిక వ్యవస్థగా అవతరిస్తుంది.",
        "2027 నాటికి భారతదేశం ప్రపంచంలోనే అతిపెద్ద ఆర్థిక వ్యవస్థగా అవతరిస్తుంది.",
        "2027 నాటికి భారతదేశ ఆర్థిక వ్యవస్థ క్షీణతను ఎదుర్కొంటుంది.",
        "2070 నాటికి భారతదేశం నికర సున్నా ఉద్గారాలను సాధిస్తుంది."
      ],
      correctAnswerIndex: 0,
      explanation: "2027 నాటికి భారతదేశం జపాన్ మరియు జర్మనీలను అధిగమించి ప్రపంచంలో మూడవ అతిపెద్ద ఆర్థిక వ్యవస్థగా అవతరిస్తుందని ఆర్థిక మంత్రి నిర్మలా సీతారామన్ అంచనా వేశారు.",
    ),

    Question(
      questionText: "వారణాసికి చెందిన అలకనంద క్రూజ్ పవిత్రమైన సరయూ నదిలో పయనీర్ చేయడానికి ఏ ప్రత్యేకమైన సేవను ఏర్పాటు చేసారు?",
      options: [
        "చెక్కతో నొక్కిన కోల్డ్ ఆయిల్ ప్రాసెసింగ్ సౌకర్యాన్ని తెరవడం.",
        "సంపీడన బయోగ్యాస్‌ను సహజ వాయువుతో కలపడం.",
        "సౌరశక్తితో నడిచే 'మినీ-క్రూయిజ్' నౌకలను ప్రారంభించడం.",
        "ఇంటర్నేషనల్ షుగర్ ఆర్గనైజేషన్ (ISO) చైర్మన్."
      ],
      correctAnswerIndex: 2,
      explanation: "వారణాసికి చెందిన అలకనంద క్రూజ్ పవిత్రమైన సరయూ నదిలో సౌరశక్తితో నడిచే 'మినీ-క్రూయిజ్' నౌకల యొక్క విశిష్ట సేవలకు మార్గదర్శకత్వం వహించడానికి సిద్ధంగా ఉంది.",
    ),

    Question(
      questionText: "ప్రస్తుత ఆర్థిక సంవత్సరంలో భారతీయ పేటెంట్ కార్యాలయం ఏ అపూర్వమైన మైలురాయిని సాధించింది?",
      options: [
        "IFFI గోవాలో VFX మరియు టెక్ పెవిలియన్ ప్రారంభోత్సవం.",
        "సంపీడన బయోగ్యాస్‌ను సహజ వాయువుతో కలపడం.",
        "రికార్డ్-బ్రేకింగ్ 41,010 పేటెంట్లను మంజూరు చేయడం.",
        "సౌరశక్తితో నడిచే 'మినీ-క్రూయిజ్' నౌకలను ప్రారంభించడం."
      ],
      correctAnswerIndex: 2,
      explanation: "భారత పేటెంట్ కార్యాలయం ప్రస్తుత ఆర్థిక సంవత్సరంలో నవంబర్ 15 వరకు రికార్డు స్థాయిలో 41,010 పేటెంట్లను మంజూరు చేయడం ద్వారా అపూర్వమైన మైలురాయిని సాధించింది.",
    ),

    Question(
      questionText: "ఆయుష్మాన్ భారత్ హెల్త్ అండ్ వెల్నెస్ సెంటర్లకు కొత్త పేరు ఏమిటి?",
      options: [
        "ఆయుష్మాన్ ఆరోగ్య మందిర్",
        "ఆరోగ్యం పరమం ధనం",
        "హెల్త్ అండ్ వెల్నెస్ మందిర్",
        "ఆయుష్మాన్ ఆరోగ్య కేంద్రం"
      ],
      correctAnswerIndex: 0,
      explanation: "ఆయుష్మాన్ భారత్ హెల్త్ అండ్ వెల్నెస్ సెంటర్లకు రీబ్రాండెడ్ పేరు 'ఆయుష్మాన్ ఆరోగ్య మందిర్'.",
    ),

    Question(
      questionText: "భారతదేశంలోని ఏ నగరం 287-కిమీల వృత్తాకార రైల్వే అభివృద్ధికి సాక్ష్యంగా ఉంది?",
      options: [
        "ముంబయి",
        "బెంగళూరు",
        "ఢిల్లీ",
        "చెన్నై"
      ],
      correctAnswerIndex: 1,
      explanation: "బెంగళూరు 287-కిమీల వృత్తాకార రైల్వే అభివృద్ధికి సాక్ష్యంగా ఉంది.",
    ),

    Question(
      questionText: "కొచ్చిలో 'క్లాసిక్ ఇంపీరియల్' అనే లగ్జరీ క్రూయిజ్ నౌకను ఎవరు ప్రారంభించారు?",
      options: [
        "అశ్విని వైష్ణవ్",
        "నితిన్ గడ్కరీ",
        "స్మృతి జుబిన్ ఇరానీ",
        "మనోజ్ సిన్హా"
      ],
      correctAnswerIndex: 1,
      explanation: "కొచ్చిలో 'క్లాసిక్ ఇంపీరియల్' అనే లగ్జరీ క్రూయిజ్ నౌకను నితిన్ గడ్కరీ వాస్తవంగా ప్రారంభించారు.",
    ),

    Question(
      questionText: "ఇటీవల ఏ కేంద్ర మంత్రి అంగన్‌వాడీ ప్రోటోకాల్ దివ్యాంగుల పిల్లలను ప్రారంభించారు?",
      options: [
        "నితిన్ గడ్కరీ",
        "అశ్విని వైష్ణవ్",
        "స్మృతి జుబిన్ ఇరానీ",
        "రాజేంద్ర విశ్వనాథ్ అర్లేకర్"
      ],
      correctAnswerIndex: 2,
      explanation: "కేంద్ర మహిళా మరియు శిశు అభివృద్ధి మరియు మైనారిటీ వ్యవహారాల మంత్రి స్మృతి జుబిన్ ఇరానీ అంగన్‌వాడీ ప్రోటోకాల్ దివ్యాంగ్ చిల్డ్రన్‌ను ప్రారంభించారు.",
    ),

    Question(
      questionText: "భారతీయ రైల్వేలలో ఆటోమేటిక్ రైలు తాకిడి ఎగవేత వ్యవస్థ 'కవాచ్'ని అమలు చేయడానికి ఏ రెండు బహుళజాతి సంస్థలకు ఆమోదం లభించింది?",
      options: [
        "సిమెన్స్ AG మరియు క్యోసాన్ ఎలక్ట్రిక్ మాన్యుఫ్యాక్చరింగ్ కో",
        "మేధా సర్వో డ్రైవ్‌లు మరియు HBL పవర్ సిస్టమ్స్",
        "NTPC REL మరియు కెర్నెక్స్ మైక్రోసిస్టమ్స్",
        "కాండే నాస్ట్ ట్రావెలర్ మరియు జైపూర్ లిటరేచర్ ఫెస్టివల్"
      ],
      correctAnswerIndex: 0,
      explanation: "జర్మనీ నుండి సిమెన్స్ AG మరియు జపాన్ నుండి క్యోసాన్ ఎలక్ట్రిక్ మాన్యుఫ్యాక్చరింగ్ కంపెనీ భారతీయ రైల్వేలలో 'కవాచ్'ని మోహరించడానికి అనుమతి పొందాయి.",
    ),

    Question(
      questionText: "క్రిసిల్ నివేదిక ప్రకారం, 2023-24 ఆర్థిక సంవత్సరంలో భారతదేశంలోని 18 అతిపెద్ద రాష్ట్రాలకు మూలధన వ్యయంలో అంచనా పెరుగుదల ఎంత?",
      options: [
        "10-12%",
        "14-16%",
        "18-20%",
        "22-24%"
      ],
      correctAnswerIndex: 2,
      explanation: "క్రిసిల్ నివేదిక 2023-24 ఆర్థిక సంవత్సరంలో భారతదేశంలోని 18 అతిపెద్ద రాష్ట్రాలకు మూలధన వ్యయంలో 18-20% పెరుగుదలను అంచనా వేసింది.",
    ),

    Question(
      questionText: "భారతదేశంలోని ఏ రాష్ట్రం ఇడుక్కిలో హాల్‌మార్కింగ్ కేంద్రాన్ని ప్రారంభించింది, దాని మొత్తం 14 జిల్లాల్లో ఇటువంటి కేంద్రాలను స్థాపించిన మొదటి రాష్ట్రం?",
      options: [
        "కర్ణాటక",
        "కేరళ",
        "తమిళనాడు",
        "మహారాష్ట్ర"
      ],
      correctAnswerIndex: 1,
      explanation: "కేరళ ఇడుక్కిలో హాల్‌మార్కింగ్ కేంద్రాన్ని ప్రారంభించింది, భారతదేశంలోని మొత్తం 14 జిల్లాల్లో ఇటువంటి కేంద్రాలను కలిగి ఉన్న మొదటి రాష్ట్రంగా దాని స్థానాన్ని పదిలపరుచుకుంది.",
    ),

    Question(
      questionText: "అక్టోబర్ 28, 2023న మణిపూర్ ముఖ్యమంత్రి ఎన్ బీరెన్ సింగ్ ఏ ముఖ్యమైన కార్యక్రమంలో పాల్గొన్నారు?",
      options: [
        "కర్ణాటక రాజ్యోత్సవ",
        "మేరా హౌచొంగ్బా వేడుకలు",
        "ఉత్తరాఖండ్ వ్యవస్థాపక దినోత్సవం",
        "జ్ఞానోదయ ఎక్స్‌ప్రెస్ ప్రారంభం"
      ],
      correctAnswerIndex: 1,
      explanation: "మణిపూర్ ముఖ్యమంత్రి ఎన్ బీరెన్ సింగ్ అక్టోబర్ 28, 2023న మేరా హౌచొంగ్బా వేడుకల్లో పాల్గొన్నారు.",
    ),

    Question(
      questionText: "నవంబర్ 1, 2023, కర్ణాటక చరిత్రలో దేనిని సూచిస్తుంది?",
      options: [
        "ఉత్తరాఖండ్ వ్యవస్థాపక దినోత్సవం",
        "మేరా హౌచొంగ్బా వేడుకలు",
        "కర్ణాటక ఏర్పడి 50వ వార్షికోత్సవం",
        "జ్ఞానోదయ ఎక్స్‌ప్రెస్ ప్రారంభం"
      ],
      correctAnswerIndex: 2,
      explanation: "నవంబర్ 1, 2023, కన్నడ-మాట్లాడే ప్రాంతాలను ఒకే రాష్ట్రంగా విలీనం చేయడాన్ని జరుపుకుంటూ, కర్ణాటక ఏర్పడి 50 ఏళ్లు పూర్తయింది.",
    ),

    Question(
      questionText: "రాష్ట్ర శాసనసభ ఆమోదించిన బిల్లుల విషయంలో గవర్నర్ వైఫల్యం గురించి ప్రకటించాలని కోరుతూ ఏ రాష్ట్ర ప్రభుత్వం భారత సుప్రీంకోర్టును ఆశ్రయించింది?",
      options: [
        "కేరళ",
        "ఉత్తరాఖండ్",
        "కర్ణాటక",
        "అస్సాం"
      ],
      correctAnswerIndex: 0,
      explanation: "రాష్ట్ర శాసనసభ ఆమోదించిన బిల్లుల విషయంలో గవర్నర్ వైఫల్యం గురించి ప్రకటించాలని కోరుతూ కేరళ ప్రభుత్వం సుప్రీంకోర్టును ఆశ్రయించింది.",
    ),

    Question(
      questionText: "కేరళ పర్యాటకం ప్రారంభించిన మైక్రోసైట్‌ల ప్రయోజనం ఏమిటి?",
      options: [
        "క్రూయిజ్ టూరిజంను ప్రోత్సహించడానికి",
        "సాహిత్యం జరుపుకోవడానికి",
        "తీర్థయాత్ర పర్యాటకాన్ని ప్రోత్సహించడానికి",
        "నీటి సంరక్షణను పెంపొందించడానికి"
      ],
      correctAnswerIndex: 2,
      explanation: "కేరళ టూరిజం రాష్ట్ర వారసత్వం మరియు మతపరమైన గమ్యస్థానాలకు ప్రాధాన్యతనిస్తూ తీర్థయాత్ర పర్యాటకాన్ని ప్రోత్సహించడానికి మైక్రోసైట్‌లను ప్రారంభించింది.",
    ),

    Question(
      questionText: "జైపూర్ లిటరేచర్ ఫెస్టివల్ యొక్క 17వ ఎడిషన్ ఎప్పుడు జరుగుతుంది?",
      options: [
        "డిసెంబర్ 1 నుండి డిసెంబర్ 10, 2023 వరకు",
        "ఫిబ్రవరి 1 నుండి ఫిబ్రవరి 5, 2024 వరకు",
        "నవంబర్ 9, 2023",
        "అక్టోబర్ 28, 2023"
      ],
      correctAnswerIndex: 1,
      explanation: "జైపూర్ లిటరేచర్ ఫెస్టివల్ యొక్క 17వ ఎడిషన్ ఫిబ్రవరి 1 నుండి ఫిబ్రవరి 5, 2024 వరకు జరగనుంది.",
    ),

    Question(
      questionText: "NTPC యొక్క ఏ అనుబంధ సంస్థ గుజరాత్‌లోని కచ్‌లోని దయాపర్‌లో 50 MW విండ్ ఫామ్‌ను తన మొదటి ప్రాజెక్ట్ యొక్క వాణిజ్య కార్యకలాపాలను ప్రకటించింది?",
      options: [
        "NTPC REL",
        "మేధా సర్వో డ్రైవ్స్",
        "కెర్నెక్స్ మైక్రోసిస్టమ్స్",
        "HBL పవర్ సిస్టమ్స్"
      ],
      correctAnswerIndex: 0,
      explanation: "NTPC రెన్యూవబుల్ ఎనర్జీ లిమిటెడ్ (NTPC REL) గుజరాత్‌లోని కచ్‌లోని దయాపర్‌లో 50 మెగావాట్ల విండ్ ఫామ్‌ను తన మొదటి ప్రాజెక్ట్ యొక్క వాణిజ్య కార్యకలాపాలను ప్రకటించింది.",
    ),

    Question(
      questionText: "నవంబర్ 9 ఉత్తరాఖండ్ యొక్క ప్రాముఖ్యత ఏమిటి?",
      options: [
        "జ్ఞానోదయ ఎక్స్‌ప్రెస్ ప్రారంభం",
        "స్థాపన దినోత్సవం",
        "యూనిఫాం సివిల్ కోడ్ అమలు",
        "బీహార్ రిజర్వేషన్ సవరణ బిల్లుకు ఆమోదం"
      ],
      correctAnswerIndex: 1,
      explanation: "నవంబర్ 9వ తేదీన ఉత్తరాఖండ్ వ్యవస్థాపక దినోత్సవం, మరియు అధ్యక్షురాలు ద్రౌపది ముర్ము ఈ కార్యక్రమంలో పాల్గొన్నారు, 23 సంవత్సరాలలో ఒక రాష్ట్రపతి ఉత్తరాఖండ్ వ్యవస్థాపక దినోత్సవంలో భాగం కావడం ఇదే మొదటి ఉదాహరణ.",
    ),

    Question(
      questionText: "ఏకరీతి సివిల్ కోడ్‌ను అమలు చేయడంలో భారతదేశంలో ఏ రాష్ట్రం మొదటి స్థానంలో ఉంది?",
      options: [
        "ఉత్తరాఖండ్",
        "కేరళ",
        "అస్సాం",
        "మేఘాలయ"
      ],
      correctAnswerIndex: 0,
      explanation: "యూనిఫాం సివిల్ కోడ్‌ను అమలు చేసిన భారతదేశంలో మొదటి రాష్ట్రంగా ఉత్తరాఖండ్ అవతరిస్తుంది.",
    ),

    Question(
      questionText: "అస్సాంలో SEBA మరియు AHSEC విలీనం ద్వారా ఏర్పడిన సమ్మేళన సంస్థ యొక్క కొత్త పేరు ఏమిటి?",
      options: [
        "అస్సాం సెకండరీ ఎడ్యుకేషన్ బోర్డ్",
        "అస్సాం హయ్యర్ సెకండరీ ఎడ్యుకేషన్ కౌన్సిల్",
        "అస్సాం స్టేట్ స్కూల్ ఎడ్యుకేషన్ బోర్డ్",
        "అస్సాం స్కూల్ ఎడ్యుకేషన్ కౌన్సిల్"
      ],
      correctAnswerIndex: 2,
      explanation: "అసోంలో SEBA మరియు AHSEC విలీనం ద్వారా ఏర్పడిన సమ్మేళన సంస్థ ఇప్పుడు 'అస్సాం స్టేట్ స్కూల్ ఎడ్యుకేషన్ బోర్డ్'గా పిలువబడుతుంది.",
    ),

    Question(
      questionText: "కాండే నాస్ట్ ట్రావెలర్స్ 2024లో ఆసియాలో సందర్శించడానికి ఉత్తమమైన ప్రదేశాల జాబితాలో కేరళలోని ఏ నగరం స్థానం సంపాదించింది?",
      options: [
        "తిరువనంతపురం",
        "కొచ్చి",
        "కోజికోడ్",
        "అలప్పుళ"
      ],
      correctAnswerIndex: 1,
      explanation: "కాండే నాస్ట్ ట్రావెలర్ యొక్క 2024లో ఆసియాలో సందర్శించడానికి ఉత్తమమైన ప్రదేశాల జాబితాలో కొచ్చి స్థానం సంపాదించింది.",
    ),

    Question(
      questionText: "కత్రా రైల్వే స్టేషన్ నుండి జమ్మూ కాశ్మీర్ లెఫ్టినెంట్ గవర్నర్ మనోజ్ సిన్హా ఫ్లాగ్ ఆఫ్ చేసిన ప్రత్యేకమైన ప్రాజెక్ట్ ఏమిటి?",
      options: [
        "జ్ఞానోదయ ఎక్స్‌ప్రెస్",
        "ఏకరీతి పౌర స్మృతి",
        "బీహార్ రిజర్వేషన్ సవరణ బిల్లు",
        "కాలేజ్ ఆన్ వీల్స్"
      ],
      correctAnswerIndex: 3,
      explanation: "జమ్మూ మరియు కాశ్మీర్ లెఫ్టినెంట్ గవర్నర్ మనోజ్ సిన్హా కత్రా రైల్వే స్టేషన్ నుండి 'కాలేజ్ ఆన్ వీల్స్' ప్రాజెక్ట్‌ను జెండా ఊపి ప్రారంభించారు.",
    ),

    Question(
      questionText: "బీహార్ రిజర్వేషన్ సవరణ బిల్లు దేనిని ఆమోదించింది?",
      options: [
        "వెనుకబడిన తరగతులకు 50% రిజర్వేషన్",
        "వెనుకబడిన, అత్యంత వెనుకబడిన తరగతులు, ఎస్సీలు మరియు ఎస్టీలకు 65% రిజర్వేషన్లు",
        "హలాల్ సర్టిఫైడ్ ఉత్పత్తులపై నిషేధం",
        "ఘోల్ చేపను గుజరాత్ రాష్ట్ర చేపగా ప్రకటించడం"
      ],
      correctAnswerIndex: 1,
      explanation: "బీహార్ రిజర్వేషన్ సవరణ బిల్లు వెనుకబడిన, అత్యంత వెనుకబడిన తరగతులు, ఎస్సీలు మరియు ఎస్టీల రిజర్వేషన్ కోటాను 50% నుండి 65%కి పెంచడాన్ని ఆమోదించింది.",
    ),

    Question(
      questionText: "ఉత్తరప్రదేశ్ ప్రభుత్వం ఏ తక్షణ నిషేధాన్ని విధించింది?",
      options: [
        "పాల ఉత్పత్తుల ఉత్పత్తిపై నిషేధం",
        "సౌందర్య ఉత్పత్తుల అమ్మకాలపై నిషేధం",
        "హలాల్ సర్టిఫైడ్ ఉత్పత్తులపై నిషేధం",
        "బేకరీ వస్తువుల పంపిణీపై నిషేధం"
      ],
      correctAnswerIndex: 2,
      explanation: "రాష్ట్రంలో హలాల్ ధృవీకరించబడిన ఉత్పత్తుల ఉత్పత్తి, నిల్వ, పంపిణీ మరియు అమ్మకాలపై ఉత్తర ప్రదేశ్ ప్రభుత్వం తక్షణ నిషేధాన్ని విధించింది.",
    ),

    Question(
      questionText: "ఏ చేప గుజరాత్ రాష్ట్ర చేపగా అధికారికంగా ప్రకటించబడింది?",
      options: [
        "ఘోల్",
        "రోహు",
        "హిల్సా",
        "కాట్లా"
      ],
      correctAnswerIndex: 0,
      explanation: "ఘోల్' చేప గుజరాత్ రాష్ట్ర చేపగా అధికారికంగా ప్రకటించబడింది.",
    ),

    Question(
      questionText: "జల్ జీవన్ మిషన్ కింద మేఘాలయ ముఖ్యమంత్రి కాన్రాడ్ కె. సంగ్మా ఏ ప్రచారాన్ని ప్రారంభించారు?",
      options: [
        "జ్ఞానోదయ ఎక్స్‌ప్రెస్",
        "ఏకరీతి పౌర స్మృతి",
        "మేఘాలయ వాటర్ స్మార్ట్ కిడ్ క్యాంపెయిన్",
        "బీహార్ రిజర్వేషన్ సవరణ బిల్లు"
      ],
      correctAnswerIndex: 2,
      explanation: "మేఘాలయ ముఖ్యమంత్రి కాన్రాడ్ కె. సంగ్మా జల్ జీవన్ మిషన్ కింద 'మేఘాలయ వాటర్ స్మార్ట్ కిడ్ క్యాంపెయిన్'ని ప్రారంభించారు.",
    ),



    Question(
      questionText: "కేరళ యొక్క రెస్పాన్సిబుల్ టూరిజం (RT) మిషన్ ఏ ప్రపంచ గుర్తింపును సాధించింది?",
      options: [
        "కాండే నాస్ట్ ట్రావెలర్స్ జాబితాలో చేర్చడం",
        "UNWTO ద్వారా కేస్ స్టడీస్",
        "ఆసియాలో సందర్శించడానికి ఉత్తమ స్థలాలు",
        "కేరళ టూరిజం ద్వారా మైక్రోసైట్ల ప్రారంభం"
      ],
      correctAnswerIndex: 1,
      explanation: "యునైటెడ్ నేషన్స్ వరల్డ్ టూరిజం ఆర్గనైజేషన్ (UNWTO) క్యూరేటెడ్ కేస్ స్టడీస్ యొక్క ప్రతిష్టాత్మక జాబితాలో స్థానం సంపాదించడం ద్వారా కేరళ యొక్క రెస్పాన్సిబుల్ టూరిజం (RT) మిషన్ ప్రపంచ ప్రశంసలను సాధించింది.",
    ),

    Question(
      questionText: "ప్రపంచంలోని మొట్టమొదటి 3డి-ముద్రిత దేవాలయం ఎక్కడ ఉంది?",
      options: [
        "వారణాసి",
        "కోల్‌కతా",
        "బూరుగుపల్లి, సిద్దిపేట జిల్లా",
        "తిరువనంతపురం"
      ],
      correctAnswerIndex: 2,
      explanation: "ప్రపంచంలోని మొట్టమొదటి 3D-ప్రింటెడ్ ఆలయం తెలంగాణలోని సిద్దిపేట జిల్లా, బూరుగుపల్లిలో ఉంది.",
    ),

    Question(
      questionText: "హార్న్‌బిల్ ఫెస్టివల్ 2023 ఎప్పుడు జరగాలి?",
      options: [
        "ఫిబ్రవరి 1 నుండి ఫిబ్రవరి 5, 2024 వరకు",
        "డిసెంబర్ 1 నుండి డిసెంబర్ 10, 2023 వరకు",
        "నవంబర్ 9, 2023",
        "అక్టోబర్ 28, 2023"
      ],
      correctAnswerIndex: 1,
      explanation: "హార్న్‌బిల్ ఫెస్టివల్ 2023 శుక్రవారం, డిసెంబర్ 1, 2023 నుండి ఆదివారం, డిసెంబర్ 10, 2023 వరకు జరగాల్సి ఉంది.",
    ),





  ];
  int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

  late Timer _examTimer;

  @override
  void initState() {
    super.initState();
    _loadLikedData();
    //_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
    _startriversTimer();
  }
  void _startriversTimer() {
    _examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
      setState(() {
        _elapsedTimeInSeconds++;
      });
    });
  }

  Future<void> _loadLikedData() async {
    // Load liked questions data here
    // ...
  }

  void _nextQuestion() {
    setState(() {
      if (_currentQuestionIndex < _questions.length - 1) {
        _currentQuestionIndex++;
        _selectedAnswerIndex = null;
      } else {
        // All questions have been answered, navigate to results screen
        _navigateToResults();
      }
    });
  }

  void _previousQuestion() {
    setState(() {
      if (_currentQuestionIndex > 0) {
        _currentQuestionIndex--;
        _selectedAnswerIndex = null;
      }
    });
  }

  void _navigateToResults() {
    // Navigate to results screen
    _examTimer.cancel(); // Cancel the exam timer before navigating
    Navigator.of(context).pushReplacement(
      MaterialPageRoute(
        builder: (context) => ResultsScreen(
          userAnswers: _userAnswers,
          questions: _questions,
          elapsedTimeInSeconds: _elapsedTimeInSeconds,
        ),
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
        backgroundColor: Colors.blueAccent,
      ),
      body: GestureDetector(
        onVerticalDragEnd: (details) {
          if (details.velocity.pixelsPerSecond.dy < 0) {
            // Swipe up detected, move to the next question
            _nextQuestion();
          } else if (details.velocity.pixelsPerSecond.dy > 0) {
            // Swipe down detected, move to the previous question
            _previousQuestion();
          }
        },
        onHorizontalDragEnd: (details) {
          if (details.primaryVelocity! > 0) {
            _previousQuestion();
          } else if (details.primaryVelocity! < 0) {
            _nextQuestion();
          }
        },
        child: ListView(
          padding: EdgeInsets.all(16.0),
          children: [
            MyBannerAdWidget(), // Add the banner ad here
            Text(
              "Question ${_currentQuestionIndex + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              _questions[_currentQuestionIndex].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),
            ..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
              final optionIndex = entry.key;
              final optionText = entry.value;
              return InkWell( // Added this InkWell
                onTap: () {
                  setState(() {
                    _selectedAnswerIndex = optionIndex;
                    _userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
                  });
                },
                child: ListTile(
                  title: Text(optionText),
                  leading: Radio<int>(
                    value: optionIndex,
                    groupValue: _selectedAnswerIndex,
                    onChanged: (int? value) {
                      setState(() {
                        _selectedAnswerIndex = value;
                        _userAnswers[_currentQuestionIndex] = value; // Store user's answer
                      });
                    },
                  ),
                ),
              );
            }).toList(),
            // Show correct answer if an option is selected
            // Show correct answer if an option is selected
            if (_selectedAnswerIndex != null)
              Text(
                "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.green, // Set your desired color here
                ),
              ),
            MyBannerAdWidget(), // Add the banner ad here

          ],

        ),
      ),
      bottomNavigationBar: Container(
        color: Colors.red[400],
        child: Theme(
          data: Theme.of(context).copyWith(
            canvasColor: Colors.blueAccent[200],
          ),
          child: BottomNavigationBar(
            type: BottomNavigationBarType.fixed,
            items: const [
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
                label: '',
              ),
            ],
            onTap: (index) {
              if (index == 0) {
                _previousQuestion();
              } else if (index == 1) {
                _nextQuestion();
              }
            },
          ),
        ),
      ),
      // Overall exam timer display

      // Overall exam timer display
      // Overall exam timer display
      persistentFooterButtons: [
        Text(
          'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
      ],

    );
  }
  @override
  void dispose() {
    // Dispose of the exam timer when the widget is disposed
    _examTimer.cancel();
    super.dispose();
  }
}

class ResultsScreen extends StatelessWidget {
  final int elapsedTimeInSeconds;
  final List<int?> userAnswers;
  final List<Question> questions;

  ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


  int calculateScore() {
    int score = 0;
    for (int i = 0; i < questions.length; i++) {
      if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
        score++;
      }
    }
    return score;
  }
  String formatElapsedTime(int seconds) {
    int minutes = seconds ~/ 60;
    int remainingSeconds = seconds % 60;
    return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
  }
  @override
  Widget build(BuildContext context) {
    final int score = calculateScore();
    final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
    return Scaffold(
      appBar: AppBar(
        title: Text("Results"),
        actions: [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text("Completed Time: $completedTime" ),
          ),
        ],
      ),
      body: ListView(
        padding: EdgeInsets.all(16.0),
        children: [
          MyBannerAdWidget(), // Add the banner ad here
          Text(
            "Your Score: $score/${questions.length}",
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16.0),
          for (int i = 0; i < questions.length; i++) ...[
            Text(
              "Question ${i + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              questions[i].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 8.0),
            Text(
              "Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              "Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 16.0),
            Text(
              "Explanation: ${questions[i].explanation}",
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),

          ],
        ],
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: november_te(),
  ));
}
