import 'package:flutter/material.dart';
import 'dart:async';

import '../path_to_my_banner_ad_widget.dart'; // Import the dart:async package

class Question {
  final String questionText;
  final List<String> options;
  final int correctAnswerIndex;
  final String explanation;

  Question({
    required this.questionText,
    required this.options,
    required this.correctAnswerIndex,
    required this.explanation,
  });
}

class october_te extends StatefulWidget {
  final String? userIdentifier;

  october_te({Key? key, this.userIdentifier}) : super(key: key);

  @override
  State<october_te> createState() => _october_teState();
}

class _october_teState extends State<october_te> {
  int? _selectedAnswerIndex;
  int _currentQuestionIndex = 0;
  List<int?> _userAnswers = List.filled(200, null); // Initialize with the number of questions

  List<Question> _questions = [


    Question(
      questionText: "న్యూ ఢిల్లీలో జరగాల్సిన తొమ్మిదో P20 సమ్మిట్ యొక్క థీమ్ ఏమిటి?",
      options:["ఒక భూమి, ఒక కుటుంబం, ఒక భవిష్యత్తు కోసం పార్లమెంటులు", "పర్యాటకం ద్వారా ఆర్థిక వృద్ధిని నడపటం", "భారతదేశం మరియు UK మధ్య ద్వైపాక్షిక సంబంధాలను మెరుగుపరచడం", "2023లో గ్లోబల్ హెల్త్ యాక్షన్"],
      correctAnswerIndex:0,
      explanation: "న్యూఢిల్లీలో జరిగిన తొమ్మిదవ P20 సమ్మిట్ యొక్క థీమ్ 'ఒక భూమి, ఒక కుటుంబం, ఒక భవిష్యత్తు కోసం పార్లమెంటులు', ఒక కుటుంబం వలె ప్రపంచం యొక్క పరస్పర అనుసంధానాన్ని నొక్కి చెబుతుంది.",
    ),
    Question(
      questionText: "16వ అర్బన్ మొబిలిటీ ఇండియా కాన్ఫరెన్స్ మరియు ఎగ్జిబిషన్ 2023 యొక్క థీమ్ ఏమిటి?",
      options:["ప్రకాశవంతమైన భవిష్యత్తు కోసం వీధి వ్యాపారులకు సాధికారత కల్పించడం", "ఈ-కామర్స్ వినియోగదారుల రక్షణలో ఆవిష్కరణలు", "సమీకృత మరియు స్థితిస్థాపక పట్టణ రవాణా", "మైక్రో-క్రెడిట్ పథకాల ద్వారా లింగ సమానత్వాన్ని సాధించడం"],
      correctAnswerIndex:2,
      explanation: "16వ అర్బన్ మొబిలిటీ ఇండియా కాన్ఫరెన్స్ మరియు ఎగ్జిబిషన్ 2023 యొక్క థీమ్ 'ఇంటిగ్రేటెడ్ అండ్ రెసిలెంట్ అర్బన్ ట్రాన్స్‌పోర్ట్,' పట్టణ రవాణా యొక్క క్లిష్టమైన అంశాలను ప్రస్తావిస్తుంది.",
    ),
    Question(
      questionText: "ప్రధాన మంత్రి నరేంద్ర మోడీ అధ్యక్షతన ICT ఆధారిత వేదిక ప్రగతి యొక్క ప్రాథమిక ప్రయోజనం ఏమిటి?",
      options:["విద్యాపరమైన అవకాశాలను మెరుగుపరచడం", "వన్యప్రాణుల సంరక్షణ కార్యక్రమాలను సమీక్షించడం", "విపత్తు ప్రమాద తగ్గింపును సమన్వయం చేయడం", "గవర్నెన్స్ మరియు ప్రాజెక్ట్ పర్యవేక్షణను క్రమబద్ధీకరించడం"],
      correctAnswerIndex:3,
      explanation: "ప్రో-యాక్టివ్ గవర్నెన్స్ అండ్ టైమ్లీ ఇంప్లిమెంటేషన్' అంటే ప్రగతి, పాలనను క్రమబద్ధీకరించడానికి మరియు క్లిష్టమైన ప్రాజెక్టుల అమలును వేగవంతం చేయడానికి ICT-ఆధారిత వేదికగా పనిచేస్తుంది.",
    ),
    Question(
      questionText: "నేవల్ ఇన్నోవేషన్ అండ్ ఇండిజినైజేషన్ సెమినార్, స్వావ్లంబాన్‌లో నావికా సాంకేతికతలో ఎలాంటి సంచలనాత్మక పరిణామాలు ప్రదర్శించబడతాయని భావిస్తున్నారు?",
      options:["ఎయిర్-టు-ఎయిర్ మిస్సైల్స్", "అటానమస్ వెపనైజ్డ్ బోట్ స్వార్మ్స్ మరియు అటానమస్ వెస్సెల్ అండర్ వాటర్ (AUV)", "మిగ్-21 ఫైటర్ జెట్‌ల రిటైర్మెంట్", "భారత నౌకాదళంలో నాయకత్వ మార్పు"],
      correctAnswerIndex:1,
      explanation: "భారత నావికాదళం స్వావ్లాంబన్ సెమినార్‌లో రెండు విశేషమైన ప్లాట్‌ఫారమ్‌లను ఆవిష్కరించడానికి సిద్ధంగా ఉంది: అటానమస్ వెపనైజ్డ్ బోట్ స్వార్మ్స్ మరియు అటానమస్ వెసెల్ అండర్ వాటర్ (AUV).",
    ),
    Question(
      questionText: "భారత నావికాదళం తన సిబ్బంది యొక్క వృత్తిపరమైన మరియు వ్యక్తిగత అభివృద్ధిని గుర్తించి మరియు మెరుగుపరచడానికి ఇటీవల చేపట్టిన పరివర్తనాత్మక చొరవ ఏమిటి?",
      options:["ఆత్మనిర్భర్ భారత్ ప్రోగ్రామ్‌లు", "జాయింట్ హ్యుమానిటేరియన్ అసిస్టెన్స్ అండ్ డిజాస్టర్ రిలీఫ్ ఎక్సర్సైజ్", "ఇండియన్ మిలిటరీ హెరిటేజ్ ఫెస్టివల్", "'360 డిగ్రీ అప్రైజల్ మెకానిజం'"],
      correctAnswerIndex:3,
      explanation: "భారత నౌకాదళం తన సిబ్బంది యొక్క వృత్తిపరమైన మరియు వ్యక్తిగత అభివృద్ధిని గుర్తించి మరియు మెరుగుపరచడానికి '360 డిగ్రీ అప్రైజల్ మెకానిజం'ని ప్రారంభించింది.",
    ),
    Question(
      questionText: "ప్రపంచంలోని అత్యంత ఎత్తైన యుద్దభూమి అయిన సియాచిన్ గ్లేసియర్ వద్ద ఎలాంటి సంచలనాత్మక అభివృద్ధి జరిగింది?",
      options:["మానవరహిత వైమానిక వాహనాల కొనుగోలు", "మొబైల్ టవర్ ఇన్‌స్టాలేషన్", "కేంబ్రియన్ పెట్రోల్ పోటీలో పాల్గొనడం", "వేల్స్‌లో సైనిక పరాక్రమ ప్రదర్శన"],
      correctAnswerIndex:1,
      explanation: "సియాచిన్ గ్లేసియర్ ఒక మొబైల్ టవర్‌ను ఏర్పాటు చేసింది, 15,500 అడుగుల ఎత్తులో ఉన్న సైనికులకు మెరుగైన మొబైల్ కమ్యూనికేషన్‌ను అందించింది, దీనిని భారత సైన్యం యొక్క ఫైర్ అండ్ ఫ్యూరీ కార్ప్స్ భారత్ సంచార్ నిగమ్ లిమిటెడ్ (BSNL) సహకారంతో సాధించాయి." ,
    ),
    Question(
      questionText: "అక్టోబర్ 20, 2023న ఇండియన్ నేవీకి సంబంధించి ఏ ముఖ్యమైన సంఘటన జరిగింది?",
      options:["ప్రాజెక్ట్ ఉద్భవ్ లాంచ్", "ఇండియన్ మిలిటరీ హెరిటేజ్ ఫెస్టివల్", "ట్రాన్స్‌ఫర్ ఆఫ్ యార్డ్ 12706 (ఇంఫాల్)", "మిలాన్-24 మల్టీలెటరల్ నేవల్ ఎక్సర్సైజ్"],
      correctAnswerIndex:2,
      explanation: "అత్యాధునిక స్టెల్త్ గైడెడ్ మిస్సైల్ డిస్ట్రాయర్, యార్డ్ 12706 (ఇంఫాల్) అధికారికంగా అక్టోబర్ 20, 2023న భారత నౌకాదళానికి బదిలీ చేయబడింది, ఇది భారతదేశ స్వదేశీ నౌకానిర్మాణ సామర్థ్యాలలో ఒక ప్రధాన మైలురాయిని సూచిస్తుంది.",
    ),
    Question(
      questionText: "రాకెట్ లాంచర్‌లను గుర్తించదగిన ఖచ్చితత్వంతో తటస్థీకరించడానికి ఇజ్రాయెల్ దళాలు ఏ అత్యాధునిక వ్యవస్థను ప్రవేశపెట్టాయి?",
      options:["స్టీల్ స్టింగ్", "మాగెల్లాన్ యూనిట్", "ఐరన్ స్టింగ్", "ఎయిర్ ఫోర్స్ సహకారం"],
      correctAnswerIndex:2,
      explanation: "ఇజ్రాయెల్ దళాలు అత్యాధునిక ఐరన్ స్టింగ్ వ్యవస్థను ప్రవేశపెట్టాయి, ఇది రాకెట్ లాంచర్‌లను విశేషమైన ఖచ్చితత్వంతో తటస్థీకరించడానికి రూపొందించబడింది, ఈ సాంకేతికతను మొట్టమొదటిసారిగా ఉపయోగించడాన్ని సూచిస్తుంది.",
    ),
    Question(
      questionText: "భారత సైన్యం ద్వారా భారతదేశపు మొట్టమొదటి వెర్టికల్ విండ్ టన్నెల్ (VWT) ఎక్కడ ప్రారంభించబడింది?",
      options:["హిమాచల్ ప్రదేశ్", "గుజరాత్", "భరూచ్", "స్పెషల్ ఫోర్సెస్ ట్రైనింగ్ స్కూల్"],
      correctAnswerIndex:0,
      explanation: "భారత సైన్యం హిమాచల్ ప్రదేశ్‌లోని స్పెషల్ ఫోర్సెస్ ట్రైనింగ్ స్కూల్ (SFTS)లో తన మొదటి వర్టికల్ విండ్ టన్నెల్ (VWT)ని ప్రారంభించింది. ఈ అత్యాధునిక సదుపాయం మిలిటరీ ట్రైనీలకు వారి పోరాట రహిత పతనం (CFF) నైపుణ్యాలను మెరుగుపరచడానికి నియంత్రిత వాతావరణాన్ని అందిస్తుంది. నిజ జీవితంలో ఉచిత పతనం పరిస్థితులను అనుకరించడం ద్వారా.",
    ),
    Question(
      questionText: "టీ అంటే ఏమిటిఅతను కజకిస్తాన్‌కు భారత సైన్యం మరియు భారత వైమానిక దళం యొక్క మిషన్ లక్ష్యం?",
      options:["శాంతి పరిరక్షక మిషన్", "మానవతా సహాయం", "జాయింట్ మిలిటరీ ఎక్సర్సైజ్ (KAZIND-2023)", "కౌంటర్ టెర్రరిజం ఆపరేషన్"],
      correctAnswerIndex:2,
      explanation: "భారత సైన్యం మరియు భారత వైమానిక దళానికి చెందిన బృందం కజకిస్తాన్‌లోని ఓటర్‌లో జాయింట్ మిలిటరీ ఎక్సర్సైజ్ 'KAZIND-2023' 7వ ఎడిషన్‌లో పాల్గొంటోంది.",
    ),
    Question(
      questionText: "ఏ ఆర్థిక సంస్థ తన ఫైనాన్షియల్ ఇన్‌క్లూజన్ కస్టమర్‌ల కోసం 'మొబైల్ హ్యాండ్‌హెల్డ్ పరికరం'ని పరిచయం చేసింది?",
      options:["స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI)", "రిజర్వ్ బ్యాంక్ ఆఫ్ ఇండియా (RBI)", "YES బ్యాంక్", "ICICI బ్యాంక్"],
      correctAnswerIndex:0,
      explanation: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) తన ఫైనాన్షియల్ ఇన్‌క్లూజన్ కస్టమర్‌లకు యాక్సెసిబిలిటీ మరియు సౌలభ్యాన్ని పెంపొందించడానికి ఒక సంచలనాత్మక చర్యగా 'మొబైల్ హ్యాండ్‌హెల్డ్ డివైజ్'ని ప్రవేశపెట్టింది.",
    ),
    Question(
      questionText: "కోకా-కోలా ఇండియా ఏ సుస్థిరత చొరవను ప్రకటించింది మరియు ఇది పర్యావరణం మరియు భారతీయ వినియోగదారుల మార్కెట్‌పై ఎలా ప్రభావం చూపుతుందని భావిస్తున్నారు?",
      options:["కొత్త పానీయాల పరిచయం", "పూర్తిగా రీసైకిల్ చేయబడిన PET బాటిళ్ల ప్రారంభం", "శక్తి రంగంలోకి విస్తరణ", "నైపుణ్య అభివృద్ధికి NSDCతో సహకారం"],
      correctAnswerIndex:1,
      explanation: "కోకా-కోలా ఇండియా తన సుస్థిరత చొరవలో భాగంగా తన ఫ్లాగ్‌షిప్ కోకా-కోలా బ్రాండ్ కోసం పూర్తిగా రీసైకిల్ చేయబడిన PET బాటిళ్లను విడుదల చేస్తున్నట్లు ప్రకటించింది. ఈ చర్య పర్యావరణం మరియు భారతీయ వినియోగదారుల మార్కెట్ రెండింటిపై సానుకూల ప్రభావాన్ని చూపుతుందని భావిస్తున్నారు.",
    ),
    Question(
      questionText: "మలేషియా రాజకుటుంబాలు ఇటీవల ఏ చారిత్రక సంఘటనను నిర్ణయించాయి మరియు కొత్త రాజుగా ఎవరు ఎన్నికయ్యారు?",
      options:[
        "ప్రధానమంత్రి ఎన్నిక",
        "ప్రధాన న్యాయమూర్తి నియామకం",
        "కొత్త రాజు ఎంపిక",
        "రాజ్యాంగ మండలి ఏర్పాటు"
      ],
      correctAnswerIndex:2,
      explanation: "మలేషియా రాజకుటుంబాలు ఇటీవల జోహోర్ రాష్ట్రానికి చెందిన సుల్తాన్ ఇబ్రహీం ఇస్కందర్‌ను దేశానికి కొత్త రాజుగా ఎన్నుకున్నాయి.",
    ),
    Question(
      questionText: "అక్టోబర్ 9, 2023 నాటికి భారతదేశం నికర ప్రత్యక్ష పన్ను వసూళ్లు పెరగడానికి కారణం ఏమిటి?",
      options:["కార్పొరేట్ పన్నులలో పెరుగుదల", "వ్యక్తిగత ఆదాయపు పన్ను ఆదాయాలలో తగ్గుదల", "కార్పొరేట్ పన్నులలో తగ్గుదల", "వ్యక్తిగత ఆదాయపు పన్ను ఆదాయాలలో పెరుగుదల"],
      correctAnswerIndex:3,
      explanation: "అక్టోబర్ 9 నాటికి భారతదేశం నికర ప్రత్యక్ష పన్నుల వసూళ్లలో 21.8% గణనీయమైన వృద్ధి రేటును సాధించింది, వ్యక్తిగత ఆదాయపు పన్ను రాబడిలో 32.5% పెరుగుదల ప్రధానంగా చెప్పబడింది.",
    ),
    Question(
      questionText: "2023 మరియు 2024లో భారతదేశ ఆర్థిక వృద్ధి గురించి UNCTAD చేసిన అంచనా ఏమిటి?",
      options:["2023లో 6.3%, 2024లో 6.6%", "2023లో 6.6%, 2024లో 6.2%", "2023లో 6.2%, 2024లో 6%", "2023లో 6%, 2024లో 6.3%" ],
      correctAnswerIndex:1,
      explanation: "UNCTAD భారతదేశ ఆర్థిక వృద్ధి అంచనాను 2023లో 6.6%కి సవరించింది మరియు 2024లో 6.2% మందగమనాన్ని అంచనా వేసింది.",
    ),
    Question(
      questionText: "భారతదేశంలో ఏ రంగం దేశీయ మరియు అంతర్జాతీయ డిమాండ్‌లో గణనీయమైన వృద్ధిని సాధించింది, సెప్టెంబర్ 2023లో 13 సంవత్సరాల గరిష్ట స్థాయికి చేరుకుంది?",
      options:["తయారీ రంగం", "సేవల రంగం", "వ్యవసాయ రంగం", "రిటైల్ రంగం"],
      correctAnswerIndex:1,
      explanation: "S&P గ్లోబల్ మార్కెట్ ఇంటెలిజెన్స్ సర్వే ఆధారిత పర్చేజింగ్ మేనేజర్స్ ఇండెక్స్ (PMI) ప్రకారం, భారతదేశంలోని సేవల రంగం దేశీయ మరియు అంతర్జాతీయ డిమాండ్‌లో గణనీయమైన వృద్ధిని సాధించింది, ఇది 13 సంవత్సరాల గరిష్ట స్థాయికి చేరుకుంది.",
    ),
    Question(
      questionText: "ఆర్థిక సంవత్సరం ఏప్రిల్-జూన్ త్రైమాసికంలో, MoSPI ద్వారా పీరియాడిక్ లేబర్ ఫోర్స్ సర్వే ప్రకారం భారతదేశంలో పట్టణ నిరుద్యోగ రేటు ఎంత?",
      options:["5.2%", "6.6%", "8.3%", "9.9%"],
      correctAnswerIndex:1,
      explanation: "ఆర్థిక సంవత్సరం ఏప్రిల్-జూన్ త్రైమాసికంలో, భారతదేశంలో పట్టణ నిరుద్యోగిత రేటు 6.6%కి పడిపోయిందని, గణాంకాలు మరియు కార్యక్రమాల అమలు మంత్రిత్వ శాఖ (MoSPI) నివేదించింది.",
    ),
    Question(
      questionText: "గర్భధారణ సమయంలో సహాయాన్ని అందించాలనే లక్ష్యంతో ఏ భారతీయ కంపెనీ తన మహిళల డెలివరీ భాగస్వాముల కోసం ప్రసూతి బీమా పథకాన్ని ప్రవేశపెట్టింది?",
      options:["టాటా మోటార్స్", "కోకా-కోలా ఇండియా", "స్వాన్ ఎనర్జీ", "జొమాటో"],
      correctAnswerIndex:3,
      explanation: "జొమాటో తన మహిళల డెలివరీ భాగస్వాముల కోసం ప్రసూతి బీమా పథకాన్ని ప్రవేశపెట్టింది, గర్భధారణ సమయంలో మహిళలకు సహాయక చొరవగా మరియు పరిశ్రమలో ఈ రకమైన మొదటిది.",
    ),
    Question(
      questionText: "ఫ్రైట్ టైగర్‌లో టాటా మోటార్స్ వాటాను కొనుగోలు చేయడం వెనుక ఉద్దేశ్యం ఏమిటి?",
      options:["పునరుత్పాదక ఇంధన ప్రాజెక్టులను బలోపేతం చేయడానికి", "ట్రక్ మరియు సరుకు రవాణా పర్యావరణ వ్యవస్థను మెరుగుపరచడానికి", "దాని ఆటోమోటివ్ తయారీని విస్తరించడానికి", "పూర్తి యాజమాన్యంలోని అనుబంధ సంస్థను స్థాపించడానికి"],
      correctAnswerIndex:1,
      explanation: "ఎండ్-టు-ఎండ్ లాజిస్టిక్స్ సొల్యూషన్స్ ద్వారా ట్రక్ మరియు ఫ్రైట్ ఎకోసిస్టమ్‌ను పునర్నిర్మించాలనే లక్ష్యంతో ఫ్రైట్ టైగర్‌లో టాటా మోటార్స్ వాటాను కొనుగోలు చేసింది.",
    ),
    Question(
      questionText: "లడఖ్‌లో భారీ పునరుత్పాదక ఇంధన ప్రాజెక్టు కోసం గ్రీన్ ఎనర్జీ కారిడార్ (GEC) ఫేజ్-IIని ఏ ప్రభుత్వ కమిటీ ఆమోదించింది?",
      options: ["క్యాబినెట్ కమిటీ ఆన్ ఎకనామిక్ అఫైర్స్ (CCEA)", "నేషనల్ స్కిల్ డెవలప్‌మెంట్ కార్పొరేషన్ (NSDC)", "కేంద్ర వాణిజ్య & పరిశ్రమల మంత్రి", "స్కిల్ డెవలప్‌మెంట్ & ఎంట్రప్రెన్యూర్‌షిప్ మంత్రిత్వ శాఖ"],
    correctAnswerIndex:0,
    explanation: "లడఖ్‌లో 13-గిగావాట్ల (GW) రెన్యూవబుల్ ఎనర్జీ (RE) ప్రాజెక్ట్ కోసం ఆర్థిక వ్యవహారాల క్యాబినెట్ కమిటీ (CCEA) గ్రీన్ ఎనర్జీ కారిడార్ (GEC) ఫేజ్-IIని మంజూరు చేసింది.",
    ),
    Question(
      questionText: "ప్రఖ్యాత వీడియో గేమ్ డెవలపర్ అయిన యాక్టివిజన్ బ్లిజార్డ్ కొనుగోలును ఏ ప్రధాన సమ్మేళనం విజయవంతంగా పూర్తి చేసింది?",
      options:["కోకా-కోలా ఇండియా", "టాటా మోటార్స్", "మైక్రోసాఫ్ట్", "ఇండియన్ ఆయిల్ కార్పొరేషన్"],
      correctAnswerIndex:2,
      explanation: "మైక్రోసాఫ్ట్ ఆక్టివిజన్ బ్లిజార్డ్ కొనుగోలును పూర్తి చేసింది, ఇది 69 బిలియన్ డాలర్ల విలువైన దాని అతిపెద్ద డీల్‌ను మరియు గేమింగ్ పరిశ్రమలోకి గణనీయమైన ప్రవేశాన్ని కలిగి ఉంది.",
    ),
    Question(
      questionText: "విదేశీ వాణిజ్య విధానం (FTP) 2023 కింద సిస్టమ్ ఆధారిత ఆటోమేటిక్ 'స్టేటస్ హోల్డర్' సర్టిఫికేట్‌లను జారీ చేయడాన్ని ఏ ప్రభుత్వ చొరవ లక్ష్యంగా పెట్టుకుంది?",
      options:["క్యాబినెట్ కమిటీ ఆన్ ఎకనామిక్ అఫైర్స్ (CCEA)", "నేషనల్ స్కిల్ డెవలప్‌మెంట్ కార్పొరేషన్ (NSDC)", "కేంద్ర వాణిజ్య & పరిశ్రమల మంత్రి", "స్కిల్ డెవలప్‌మెంట్ & ఎంట్రప్రెన్యూర్‌షిప్ మంత్రిత్వ శాఖ"],
      correctAnswerIndex:2,
      explanation: "విదేశీ వాణిజ్య విధానం (FTP) 2023 కింద సిస్టమ్ ఆధారిత ఆటోమేటిక్ 'స్టేటస్ హోల్డర్' సర్టిఫికేట్‌లను జారీ చేసే చొరవను కేంద్ర వాణిజ్య & పరిశ్రమల మంత్రి ఆవిష్కరించారు.",
    ),
    Question(
      questionText: "REC లిమిటెడ్ కొత్తగా ప్రవేశపెట్టిన 'SUGAM REC' మొబైల్ అప్లికేషన్ యొక్క ప్రయోజనం ఏమిటి?",
      options:["పునరుత్పాదక ఇంధన ప్రాజెక్టులను ప్రోత్సహించడానికి", "REC యొక్క 54EC క్యాపిటల్ గెయిన్ ట్యాక్స్ మినహాయింపు బాండ్లలో పెట్టుబడిని సులభతరం చేయడానికి", "విద్యుత్ రంగ ఫైనాన్సింగ్‌లో డిజిటల్ ఆవిష్కరణలను మెరుగుపరచడానికి", "పెట్టుబడిదారులకు లాజిస్టిక్ పరిష్కారాలకు మద్దతు ఇవ్వడానికి"],
      correctAnswerIndex:1,
      explanation: "REC లిమిటెడ్ ద్వారా 'SUGAM REC' మొబైల్ అప్లికేషన్ ప్రత్యేకంగా REC యొక్క 54EC క్యాపిటల్ గెయిన్ ట్యాక్స్ మినహాయింపు బాండ్‌ల కోసం పెట్టుబడి ప్రక్రియను సులభతరం చేయడానికి రూపొందించబడింది.",
    ),
    Question(
      questionText: "ఏ ప్రభుత్వ రంగ సంస్థ పునరుత్పాదక ఇంధన ప్రాజెక్టులపై దృష్టి సారించడానికి NLC ఇండియా గ్రీన్ ఎనర్జీ లిమిటెడ్ (NIGEL) అని పిలవబడే పూర్తి-యాజమాన్య అనుబంధ సంస్థను స్థాపించింది?",
      options:["ఇండియన్ ఆయిల్ కార్పొరేషన్", "స్వాన్ ఎనర్జీ", "టాటా మోటార్స్", "NLC ఇండియా"],
      correctAnswerIndex:3,
      explanation: "NLC ఇండియా, నవరత్న ప్రభుత్వ రంగ సంస్థ, భారతదేశ స్థిరమైన ఇంధన ప్రయాణంలో కీలక పాత్ర పోషించడానికి NLC ఇండియా గ్రీన్ ఎనర్జీ లిమిటెడ్ (NIGEL)ని స్థాపించింది." ,
    ),
    Question(
      questionText: "మధ్యప్రదేశ్‌లోని గ్వాలియర్‌లో దివ్యాంగుల కోసం హైటెక్ స్పోర్ట్స్ ట్రైనింగ్ సెంటర్‌ను ప్రధానమంత్రి నరేంద్ర మోదీ ఏ తేదీన ప్రారంభించారు?",
      options:["అక్టోబర్ 2", "అక్టోబర్ 4", "అక్టోబర్ 30", "జనవరి 22, 2024"],
      correctAnswerIndex:1,
      explanation: "అక్టోబర్ 4న మధ్యప్రదేశ్‌లోని గ్వాలియర్‌లో దివ్యాంగజన్ కోసం హైటెక్ స్పోర్ట్స్ ట్రైనింగ్ సెంటర్‌ను ప్రధాని నరేంద్ర మోదీ ప్రారంభించారు. వికలాంగులకు క్రీడల్లో సమాన అవకాశాలు కల్పించడం ఈ కార్యక్రమం లక్ష్యం.",
    ),
    Question(
      questionText: "భారతదేశంలోని ఏ రాష్ట్రం సారక్క సెంట్రల్ ట్రైబల్ యూనివర్శిటీకి స్థానం కల్పిస్తుంది?",
      options:["తెలంగాణ", "తమిళనాడు", "మధ్యప్రదేశ్", "గుజరాత్"],
      correctAnswerIndex:0,
      explanation: "కేంద్ర మంత్రివర్గం ఆమోదించిన సారక్క సెంట్రల్ ట్రైబల్ యూనివర్శిటీ, తెలంగాణలో, ప్రత్యేకంగా ములుగు జిల్లాలో ఏర్పాటు చేయబడుతుంది. గిరిజన విద్య మరియు అభివృద్ధిపై దృష్టి పెట్టడం విశ్వవిద్యాలయం లక్ష్యం.",
    ),
    Question(
      questionText: "ఇటీవల ఎలక్ట్రానిక్స్ మరియు ఇన్ఫర్మేషన్ టెక్నాలజీ మంత్రిత్వ శాఖ ప్రవేశపెట్టిన డిజిటల్ ఇండియా చట్టం 2023 లక్ష్యం ఏమిటి?",
      options:["క్రీడా శిక్షణా కేంద్రాలను నియంత్రించడానికి", "ఆయుర్వేదాన్ని ప్రోత్సహించడానికి", "పౌరులు సురక్షితంగా తిరిగి రావడానికి", "భారతదేశం యొక్క డిజిటల్ రంగాన్ని పరిపాలించడానికి"],
      correctAnswerIndex:3,
      explanation: "డిజిటల్ ఇండియా చట్టం 2023 భారతదేశంలో డిజిటల్ చట్టాలను సమన్వయం చేయడం మరియు ఏకీకృతం చేయడం, దేశం యొక్క డిజిటల్ ల్యాండ్‌స్కేప్‌ను నియంత్రించడానికి చట్టపరమైన ఫ్రేమ్‌వర్క్‌ను అందించడం లక్ష్యంగా పెట్టుకుంది. ఇది డిజిటల్ గవర్నెన్స్ మరియు సైబర్ క్రైమ్‌లకు సంబంధించిన ఇతర కీలక చట్టాలతో పాటు పనిచేస్తుంది.",
    ),
    Question(
      questionText: "పసిఫిక్ ఆసియా ట్రావెల్ అసోసియేషన్ (PATA) ట్రావెల్ మార్ట్ 2023 కోసం న్యూఢిల్లీలో ఏ మంత్రిత్వ శాఖ ప్రారంభ వేడుకను నిర్వహించింది?",
      options:["మినిస్ట్రీ ఆఫ్ టూరిజం", "మినిస్ట్రీ ఆఫ్ ఎడ్యుకేషన్", "మినిస్ట్రీ ఆఫ్ ఆయుష్", "మినిస్ట్రీ ఆఫ్ స్కిల్ డెవలప్‌మెంట్ & ఎంట్రప్రెన్యూర్‌షిప్"],
      correctAnswerIndex:0,
      explanation: "భారత పర్యాటక మంత్రిత్వ శాఖ, పసిఫిక్ ఆసియా ట్రావెల్ అసోసియేషన్ (PATA) ట్రావెల్ మార్ట్ 2023 ప్రారంభ వేడుకను న్యూఢిల్లీలో నిర్వహించింది. ఈ ఈవెంట్ ఆసియా-పసిఫిక్ ప్రాంతంలో పర్యాటకం మరియు ప్రయాణాన్ని ప్రోత్సహించడం లక్ష్యంగా పెట్టుకుంది.",
    ),
    Question(
      questionText: "విద్యా మంత్రిత్వ శాఖ మరియు భారత ప్రభుత్వం ప్రారంభించిన 'వన్ నేషన్ వన్ స్టూడెంట్ ఐడి కార్డ్' అని పిలవబడే APAAR ID దేనిని కేంద్రీకరించాలని లక్ష్యంగా పెట్టుకుంది?",
      options:["స్పోర్ట్స్ డేటా", "అకడమిక్ డేటా", "టూరిజం సమాచారం", "డిజిటల్ చట్టాలు"],
      correctAnswerIndex:1,
      explanation: "APAAR ID, లేదా 'వన్ నేషన్ వన్ స్టూడెంట్ ID కార్డ్' విద్యారంగాన్ని డిజిటల్‌గా కేంద్రీకరించడం లక్ష్యంగా పెట్టుకుందివిద్యార్థుల కోసం డిగ్రీలు, స్కాలర్‌షిప్‌లు, రివార్డ్‌లు మరియు ఇతర క్రెడిట్‌లతో సహా డేటా. ఈ కార్యక్రమం విద్యా మంత్రిత్వ శాఖ మరియు భారత ప్రభుత్వ చొరవ.",
    ),
    Question(
      questionText: "ఇటీవల భారత్ ప్రారంభించిన ఆపరేషన్ అజయ్ ప్రయోజనం ఏమిటి?",
      options:["ఆయుర్వేద దినోత్సవాన్ని జరుపుకోవడానికి", "డిజిటల్ చట్టాలను ప్రోత్సహించడానికి", "ఇజ్రాయెల్ నుండి పౌరులు సురక్షితంగా తిరిగి రావడానికి", "గిరిజన విశ్వవిద్యాలయాన్ని ప్రారంభించేందుకు"],
      correctAnswerIndex:2,
      explanation: "ఆపరేషన్ అజయ్ అనేది ఈ ప్రాంతంలో కొనసాగుతున్న పరిణామాల మధ్య ఇజ్రాయెల్ నుండి భారతీయ పౌరులు సురక్షితంగా తిరిగి రావడానికి ఉద్దేశించిన ఒక అంకితమైన చొరవ. విదేశాలలో ఉన్న తమ జాతీయుల భద్రత మరియు శ్రేయస్సును నిర్ధారించడంలో ప్రభుత్వ నిబద్ధతను ఇది నొక్కి చెబుతుంది.",
    ),
    Question(
      questionText: "ప్రధానమంత్రి నరేంద్ర మోడీ నాయకత్వంలోని కేంద్ర మంత్రివర్గం ఆమోదించిన ఏ సంస్థ, భారతదేశంలో యువత అభివృద్ధికి కీలకమైన యంత్రాంగంగా పనిచేయాలని లక్ష్యంగా పెట్టుకుంది?",
      options:["నేషనల్ కోఆపరేటివ్ ఎక్స్‌పోర్ట్స్ లిమిటెడ్", "మేరా యువ భారత్", "ఇండియాస్కిల్స్ 2023-24", "ఖాదీ అండ్ విలేజ్ ఇండస్ట్రీస్ కమీషన్"],
      correctAnswerIndex:1,
      explanation: "భారతదేశంలో యువత అభివృద్ధికి కీలకమైన యంత్రాంగాన్ని రూపొందించడానికి రూపొందించబడిన స్వయంప్రతిపత్త సంస్థ 'మేరా యువ భారత్' (MY భారత్) స్థాపనకు కేంద్ర మంత్రివర్గం ఆమోదించింది. ఇది జాతీయ యువజన విధానానికి అనుగుణంగా ఉంటుంది మరియు వయస్సు మధ్య వ్యక్తులను లక్ష్యంగా చేసుకుంటుంది 15-29",
    ),
    Question(
      questionText: "ఇటీవల ప్రధాని నరేంద్ర మోదీ ప్రారంభించిన 37వ జాతీయ క్రీడల ప్రాముఖ్యత ఏమిటి?",
      options:["ఇది గోవా సంస్కృతి మరియు గుర్తింపును సూచిస్తుంది", "ఇది బిర్సా ముండా జన్మదినాన్ని జరుపుకుంటుంది", "ఇది ప్రభుత్వ పథకాలను ప్రోత్సహిస్తుంది", "ఇది గ్రీన్ ఎనర్జీలో భారతదేశం సాధించిన విజయాలను ప్రదర్శిస్తుంది"],
      correctAnswerIndex:0,
      explanation: "37వ జాతీయ క్రీడలను గోవాలో ప్రధాన మంత్రి నరేంద్ర మోదీ అధికారికంగా ప్రారంభించారు. ఈ కార్యక్రమం గోవా సంస్కృతి మరియు గుర్తింపును గుర్తించింది, ముఖ్యమంత్రి ప్రమోద్ సావంత్ సంప్రదాయ కుంబీ శాలువాతో ప్రధానిని సత్కరించారు.",
    ),
    Question(
      questionText: "స్కిల్ డెవలప్‌మెంట్ & ఎంటర్‌ప్రెన్యూర్‌షిప్ మంత్రిత్వ శాఖ ద్వారా ఆవిష్కరించబడిన ఇండియా స్కిల్స్ 2023-24 ప్రోగ్రామ్ దేనిని సాధించాలని లక్ష్యంగా పెట్టుకుంది?",
      options:["ఆయుర్వేద దినోత్సవాన్ని జరుపుకోవడానికి", "డిజిటల్ చట్టాలను ప్రోత్సహించడానికి", "ఇజ్రాయెల్ నుండి పౌరులు సురక్షితంగా తిరిగి రావడానికి", "నైపుణ్య అభివృద్ధిలో భారీ పురోగతిని సాధించడానికి"],
      correctAnswerIndex:3,
      explanation: "స్కిల్ డెవలప్‌మెంట్ & ఎంటర్‌ప్రెన్యూర్‌షిప్ మంత్రిత్వ శాఖ ఆవిష్కరించిన ఇండియా స్కిల్స్ 2023-24 ప్రోగ్రామ్, నైపుణ్యాభివృద్ధిలో భారీ ప్రగతిని సాధించాలని లక్ష్యంగా పెట్టుకుంది. ఇది వరల్డ్ స్కిల్స్ 2022 పోటీలో భారతదేశం 11వ స్థానాన్ని ఆక్రమించింది మరియు క్వాంటం ఆవశ్యకతను నొక్కి చెప్పింది. నైపుణ్య సముపార్జన.",
    ),
    Question(
      questionText: "న్యూఢిల్లీలోని ప్రగతి మైదాన్‌లోని భారత్ మండపంలో ప్రధాని నరేంద్ర మోదీ ఏ ప్రతిష్టాత్మక కార్యక్రమాన్ని ప్రారంభించారు?",
      options:["ఇండియా మొబైల్ కాంగ్రెస్", "ఎనర్జీ టెక్నాలజీ మీట్", "ఇంటర్నేషనల్ ఫిల్మ్ ఫెస్టివల్ ఆఫ్ ఇండియా", "నేషనల్ గేమ్స్"],
      correctAnswerIndex:0,
      explanation: "ప్రధాని నరేంద్ర మోదీ భారతదేశ మొబైల్ కాంగ్రెస్ 7వ ఎడిషన్‌ను న్యూఢిల్లీలోని ప్రగతి మైదాన్‌లోని భారత్ మండపంలో ప్రారంభించారు. ఈ కార్యక్రమం అత్యాధునిక సాంకేతికతలను ప్రదర్శించడానికి మరియు ఆవిష్కరణలను ప్రోత్సహించడానికి టెలికమ్యూనికేషన్ పరిశ్రమలోని ప్రముఖ వ్యక్తులను ఒకచోట చేర్చింది.",
    ),
    Question(
      questionText: "ఇటీవల భారతదేశంలో ఏ నగరం హెల్త్‌వే పేరుతో మొదటి సోలార్ రూఫ్ సైక్లింగ్ ట్రాక్‌ను ప్రారంభించింది?",
      options:["ముంబై", "ఢిల్లీ", "హైదరాబాద్", "చెన్నై"],
      correctAnswerIndex:2,
      explanation: "హైదరాబాద్, భారతదేశం, దాని మొదటి సోలార్ రూఫ్ సైక్లింగ్ ట్రాక్, హెల్త్‌వేని సగర్వంగా ప్రారంభించింది.",
    ),
    Question(
      questionText: "రాజస్థాన్‌లో 810 మెగావాట్ల సోలార్ ఫోటోవోల్టాయిక్ పవర్ ప్రాజెక్ట్‌ను భద్రపరచడం ద్వారా ఏ సెంట్రల్ పబ్లిక్ సెక్టార్ ఎంటర్‌ప్రైజ్ (CPSE) ఇటీవల పునరుత్పాదక ఇంధన రంగంలో విశేషమైన ఘనతను సాధించింది?",
      options:["ONGC", "NTPC", "BHEL", "NLC ఇండియా లిమిటెడ్ (NLCIL)"],
      correctAnswerIndex:3,
      explanation: "బొగ్గు మంత్రిత్వ శాఖ ఆధ్వర్యంలోని నవరత్న సెంట్రల్ పబ్లిక్ సెక్టార్ ఎంటర్‌ప్రైజ్ (CPSE) అయిన NLC ఇండియా లిమిటెడ్ (NLCIL), రాజస్థాన్ రాజ్యం ప్రదానం చేసిన 810 మెగావాట్ల సోలార్ ఫోటోవోల్టాయిక్ పవర్ ప్రాజెక్ట్‌ను పొందడం ద్వారా ఇటీవల పునరుత్పాదక ఇంధన రంగంలో అద్భుతమైన ఫీట్‌ను సాధించింది. విద్యుత్ ఉత్పాదన్ నిగమ్ లిమిటెడ్ (RRVUNL).",
    ),
    Question(
      questionText: "స్వచ్ఛ భారత్ మిషన్ కింద, ఏ ప్రాంతంలోని అన్ని 6,650 గ్రామాలు బహిరంగ మలవిసర్జన రహిత (ODF) ప్లస్ మోడల్‌గా ప్రకటించబడ్డాయి?",
      options:["ఉత్తర ప్రదేశ్", "జార్ఖండ్", "కేరళ", "జమ్మూ మరియు కాశ్మీర్"],
      correctAnswerIndex:3,
      explanation: "స్వచ్ఛ భారత్ మిషన్ కింద జమ్మూ కాశ్మీర్‌లోని 6,650 గ్రామాలు బహిరంగ మలవిసర్జన రహిత (ఓడిఎఫ్) ప్లస్ మోడల్‌గా ప్రకటించబడ్డాయి.",
    ),

    Question(
      questionText: "mRNA వ్యాక్సిన్‌లపై చేసిన కృషికి గాను 2023లో ఫిజియాలజీ లేదా మెడిసిన్‌లో నోబెల్ బహుమతిని ఎవరికి అందించారు?",
      options:["పియరీ అగోస్టిని మరియు ఫెరెన్క్ క్రౌజ్", "కటాలిన్ కరికో మరియు డ్రూ వీస్మాన్", "మౌంగి జి. బావెండి మరియు లూయిస్ ఇ. బ్రూస్", "జోన్ ఫోస్సే"],
      correctAnswerIndex:1,
      explanation: "కటాలిన్ కారికో మరియు డ్రూ వీస్‌మాన్‌లకు ఫిజియాలజీ లేదా మెడిసిన్‌లో నోబెల్ బహుమతి లభించిందిఇ 2023లో mRNA వ్యాక్సిన్‌లపై వారి మార్గదర్శక పని కోసం.",
    ),
    Question(
      questionText: "గ్లోబల్ హంగర్ ఇండెక్స్ 2023లో, 125 దేశాలలో భారతదేశం యొక్క ర్యాంకింగ్ ఏమిటి?",
      options:["81వ", "69వ", "111వ", "60వ"],
      correctAnswerIndex:2,
      explanation: "గ్లోబల్ హంగర్ ఇండెక్స్ 2023లో భారతదేశం 125 దేశాలలో 111వ స్థానంలో ఉంది, ఇది 2022లో 107వ స్థానం నుండి క్షీణించింది.",
    ),
    Question(
      questionText: "గ్లోబల్ రిమోట్ వర్క్ ఇండెక్స్ (GRWI)లో, 108 దేశాలలో భారతదేశం యొక్క ర్యాంకింగ్ ఏమిటి మరియు ఇది మునుపటి సంవత్సరంతో ఎలా పోల్చబడుతుంది?",
      options:["64వ, 15 స్థానాల క్షీణత", "77వ, 10 స్థానాల మెరుగుదల", "55వ, మునుపటి సంవత్సరం కంటే మార్పు లేదు", "88వ, 5 స్థానాల క్షీణత"],
      correctAnswerIndex:0,
      explanation: "గ్లోబల్ రిమోట్ వర్క్ ఇండెక్స్ (GRWI)లో 108 దేశాలలో భారతదేశం 64వ స్థానంలో ఉంది, ఇది గత సంవత్సరం కంటే 15 స్థానాలు గణనీయంగా క్షీణించింది.",
    ),
    Question(
      questionText: "ISRO యొక్క గగన్‌యాన్ ప్రోగ్రామ్ కోసం టెస్ట్ వెహికల్-D1 (TV-D1) ప్రయోగం యొక్క క్లిష్టమైన మిషన్ లక్ష్యాలు ఏమిటి?",
      options:[
        "కమ్యూనికేషన్ ఉపగ్రహాలను మోహరించడానికి",
        "గ్రహ వాతావరణాలను అధ్యయనం చేయడానికి",
        "క్రూ ఎస్కేప్ సిస్టమ్ (CES)ని మూల్యాంకనం చేయడానికి",
        "డీప్ స్పేస్ ఎక్స్‌ప్లోరేషన్ సిస్టమ్‌లను పరీక్షించడానికి"
      ],
      correctAnswerIndex:2,
      explanation: "టెస్ట్ వెహికల్-D1 (TV-D1) లాంచ్ యొక్క క్లిష్టమైన మిషన్ లక్ష్యాలు ఇతర లక్ష్యాలతో పాటు క్రూ ఎస్కేప్ సిస్టమ్ (CES) యొక్క మూల్యాంకనాన్ని కలిగి ఉన్నాయి.",
    ),
    Question(
      questionText: "'విజన్ ఇండియా@2047' ప్రణాళిక యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
      options:["2047 నాటికి 30 ట్రిలియన్ డాలర్ల ఆర్థిక వ్యవస్థను సాధించడం", "భారతదేశం మధ్య-ఆదాయ ఉచ్చులో పడకుండా నిరోధించడం", "అంతర్దృష్టి కోసం ఆలోచనా నాయకులతో సంప్రదించడం", "ప్రాంతీయ అసమానతలను పరిష్కరించడం"],
      correctAnswerIndex:1,
      explanation: "విజన్ ఇండియా@2047' ప్రణాళిక యొక్క ప్రాథమిక లక్ష్యం భారతదేశం మధ్య-ఆదాయ ఉచ్చులో పడకుండా నిరోధించడం మరియు 2047 నాటికి అభివృద్ధి చెందిన దేశంగా అభివృద్ధి చెందేలా చేయడం.",
    ),
    Question(
      questionText: "2023లో బ్యాలన్ డి'ఓర్ ఎవరు గెలుచుకున్నారు?",
      options:["క్రిస్టియానో రొనాల్డో", "ఎమిలియానో మార్టినెజ్", "ఐటానా బోన్మాటి", "లియోనెల్ మెస్సీ"],
      correctAnswerIndex:3,
      explanation: "లియోనెల్ మెస్సీ 2023లో తన ఎనిమిదవ బాలన్ డి'ఓర్‌ను పొందాడు, ఈ ప్రతిష్టాత్మక ఫుట్‌బాల్ అవార్డు కోసం కొత్త రికార్డును నెలకొల్పాడు.",
    ),
    Question(
      questionText: "ఒఎన్‌డిసి నెట్‌వర్క్ గిఫ్ట్ కార్డ్‌ను ఏ బ్యాంక్ పరిచయం చేసింది, భారతదేశంలో అలాంటి కార్డును జారీ చేసిన మొదటి బ్యాంక్‌గా నిలిచింది?",
      options:["స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI)", "ICICI బ్యాంక్", "YES బ్యాంక్", "యూనియన్ బ్యాంక్ ఆఫ్ ఇండియా"],
      correctAnswerIndex:2,
      explanation: "YES బ్యాంక్ ONDC నెట్‌వర్క్ గిఫ్ట్ కార్డ్‌ను పరిచయం చేయడం ద్వారా డిజిటల్ వాణిజ్య రంగంలో గణనీయమైన పురోగతిని సాధించింది, ఓపెన్ నెట్‌వర్క్ ఫర్ డిజిటల్ కామర్స్ (ONDC) భాగస్వామ్యంతో ఇటువంటి కార్డును జారీ చేసిన భారతదేశంలో మొదటి బ్యాంక్‌గా అవతరించింది.",
    ),
    Question(
      questionText: "ఫెడరల్ బ్యాంక్ ఎవరి 106వ జన్మదినోత్సవం సందర్భంగా కేరళలోని మూక్కన్నూర్ గ్రామంలో 'మూక్కన్నూర్ మిషన్'ని ప్రారంభించింది?",
      options:["K.P హార్మిస్", "కృష్ణ శ్రీనివాసన్", "డా. మైఖేల్ దేబబ్రత పాత్ర", "జాక్‌పే"],
      correctAnswerIndex:0,
      explanation: "ఫెడరల్ బ్యాంక్ తన దూరదృష్టి గల వ్యవస్థాపకుడు K.P హార్మిస్ యొక్క 106వ జన్మదినోత్సవం సందర్భంగా 'మూక్కన్నూర్ మిషన్'ని ప్రారంభించింది, ఇది సమాజ అభివృద్ధి, పర్యావరణ స్థిరత్వం మరియు డిజిటల్ పరివర్తనకు దాని నిబద్ధతకు నిదర్శనం.",
    ),
    Question(
      questionText: "FICCI ద్వారా ఆర్థిక ఔట్‌లుక్ సర్వే ప్రకారం, FY24లో భారతదేశ ఆర్థిక వ్యవస్థకు అంచనా వేసిన వృద్ధి రేటు ఎంత?",
      options:["5.8%", "6.3%", "6.7%", "7.2%"],
      correctAnswerIndex:1,
      explanation: "FICCI ఎకనామిక్ ఔట్‌లుక్ సర్వే FY24లో భారతదేశ ఆర్థిక వ్యవస్థకు 6.3% వృద్ధి రేటును అంచనా వేసింది, బ్యాంకింగ్, ఆర్థిక సేవలు మరియు పరిశ్రమ రంగాలలోని ప్రముఖ ఆర్థికవేత్తల అంతర్దృష్టుల ఆధారంగా.",
    ),
    Question(
      questionText: "కోకా-కోలా ఇండియా ఇటీవల తన ఫ్లాగ్‌షిప్ కోకా-కోలా బ్రాండ్ కోసం ఏ సుస్థిరత చొరవను ప్రారంభించింది?",
      options:["ప్లాస్టిక్ తగ్గింపు ప్రచారం", "రీసైకిల్డ్ PET బాటిల్స్", "కార్బన్ న్యూట్రల్ ప్రొడక్షన్", "బయోడిగ్రేడబుల్ ప్యాకేజింగ్"],
      correctAnswerIndex:1,
      explanation: "కోకా-కోలా ఇండియా తన ఫ్లాగ్‌షిప్ కోకా-కోలా బ్రాండ్ కోసం పూర్తిగా రీసైకిల్ చేసిన పిఇటి బాటిళ్లను ప్రారంభించడం ద్వారా సుస్థిరత చొరవను ఆవిష్కరించింది.",
    ),
    Question(
      questionText: "ఆగ్నేయాసియాలో మొట్టమొదటి హై-స్పీడ్ రైల్వేను ఇటీవల ఏ దేశం ప్రారంభించింది?",
      options:["భారతదేశం", "ఇండోనేషియా", "పాకిస్తాన్", "బంగ్లాదేశ్"],
      correctAnswerIndex:1,
      explanation: "ఇండోనేషియా అధ్యక్షుడు జోకో విడోడో ఆగ్నేయాసియాలో మొట్టమొదటి హై-స్పీడ్ రైల్వేను ప్రారంభించారు, ఇది దేశం యొక్క మౌలిక సదుపాయాల అభివృద్ధికి ఒక ముఖ్యమైన మైలురాయి.",
    ),
    Question(
      questionText: "శ్రీలంక తన పర్యాటక రంగాన్ని పునరుజ్జీవింపజేయడానికి ఏ ముఖ్యమైన చర్య తీసుకుంది?",
      options:[
        "ఏడు దేశాల నుండి వచ్చే పర్యాటకులకు వీసా రుసుము మాఫీ చేయడం",
        "స్వేచ్ఛా వాణిజ్య ఒప్పందాలపై తిరిగి చర్చలు జరపడం",
        "హై-స్పీడ్ రైల్వే ప్రారంభోత్సవం",
        "చైనీస్ కంపెనీలపై ఆంక్షలు విధించడం"
      ],
      correctAnswerIndex:0,
      explanation: "శ్రీలంక తన పర్యాటక రంగాన్ని పునరుజ్జీవింపజేయడానికి భారతదేశంతో సహా ఏడు దేశాల నుండి వచ్చే పర్యాటకులకు వీసా రుసుములను మాఫీ చేసిందిr.",
    ),
    Question(
      questionText: "యునైటెడ్ స్టేట్స్‌లోని ప్రతినిధుల సభ స్పీకర్‌గా ఎవరు ఎన్నికయ్యారు?",
      options:["మైక్ జాన్సన్", "రాబర్ట్ ఫికో", "సుల్తాన్ ఇబ్రహీం ఇస్కందర్", "ఆంటోనియో గుటెర్రెస్"],
      correctAnswerIndex:0,
      explanation: "లూసియానాకు చెందిన రిపబ్లికన్ కాంగ్రెస్ సభ్యుడు మైక్ జాన్సన్ యునైటెడ్ స్టేట్స్‌లోని ప్రతినిధుల సభ స్పీకర్‌గా ఎన్నికయ్యారు.",
    ),
    Question(
      questionText: "తరతరాల అంతరాన్ని పూడ్చేందుకు మరియు సాంప్రదాయ వస్త్రంపై ఆసక్తిని పెంపొందించడానికి ఖాదీ మరియు గ్రామ పరిశ్రమల కమిషన్ (KVIC) ఏ చొరవ తీసుకుంది?",
      options:["నేషనల్ టర్మరిక్ బోర్డ్", "డిజిటల్ ఇండియా యాక్ట్ 2023", "PATA ట్రావెల్ మార్ట్ 2023", "IIT ఢిల్లీలో పునరుద్ధరించిన ఖాదీ ఇండియా అవుట్‌లెట్"],
      correctAnswerIndex:3,
      explanation: "తరాల అంతరాన్ని తగ్గించడానికి మరియు సాంప్రదాయ వస్త్రంపై ఆసక్తిని పునరుద్ధరించడానికి ఖాదీ మరియు విలేజ్ ఇండస్ట్రీస్ కమిషన్ (KVIC) ఢిల్లీలోని ప్రతిష్టాత్మకమైన ఇండియన్ ఇన్‌స్టిట్యూట్ ఆఫ్ టెక్నాలజీ (IIT) క్యాంపస్‌లో పునరుద్ధరించిన ఖాదీ ఇండియా అవుట్‌లెట్‌ను ప్రారంభించింది.",
    ),
    Question(
      questionText: "అటవీ శాఖ మినహా అన్ని రాష్ట్ర ప్రభుత్వ ఉద్యోగ స్థానాల్లో మహిళలకు 35% రిజర్వేషన్లను ఏ రాష్ట్రం ప్రకటించింది?",
      options:["తమిళనాడు", "జమ్మూ మరియు కాశ్మీర్", "మధ్యప్రదేశ్", "అరుణాచల్ ప్రదేశ్"],
      correctAnswerIndex:2,
      explanation: "అటవీ శాఖ మినహా అన్ని రాష్ట్ర ప్రభుత్వ ఉద్యోగాల్లో 35% మహిళలకు రిజర్వ్ చేయడానికి మధ్యప్రదేశ్ ప్రభుత్వం ఒక సంచలనాత్మక విధానాన్ని ప్రకటించింది.",
    ),
    Question(
      questionText: "ఇండియాస్కిల్స్ 2023-24 ప్రోగ్రామ్‌ను ఆవిష్కరించే సమయంలో నైపుణ్యాభివృద్ధికి ప్రతిష్టాత్మక లక్ష్యాలను ఎవరు ప్రకటించారు?",
      options:["ధర్మేంద్ర ప్రధాన్", "నరేంద్ర మోడీ", "హర్దీప్ సింగ్ పూరి", "సర్బానంద సోనోవాల్"],
      correctAnswerIndex:0,
      explanation: "ఇండియా స్కిల్స్ 2023-24 కార్యక్రమాన్ని ఆవిష్కరించిన సందర్భంగా నైపుణ్యాభివృద్ధి కోసం కేంద్ర నైపుణ్యాభివృద్ధి మంత్రి ధర్మేంద్ర ప్రధాన్ ప్రతిష్టాత్మక లక్ష్యాలను ప్రకటించారు.",
    ),
    Question(
      questionText: "ఉమెన్ ఎంటర్‌ప్రెన్యూర్‌షిప్ ప్లాట్‌ఫారమ్ (WEP) ప్రారంభ ఎడిషన్ - ఎంట్రప్రెన్యూర్‌షిప్ ద్వారా మహిళల నేతృత్వంలోని అభివృద్ధిని ప్రారంభించడంపై నీతి ఆయోగ్ రాష్ట్ర వర్క్‌షాప్ సిరీస్ ఎక్కడ నిర్వహించబడింది?",
      options:["హైదరాబాద్", "గోవా", "ఉత్తరాఖండ్", "బీహార్"],
      correctAnswerIndex:1,
      explanation: "ఉమెన్ ఎంటర్‌ప్రెన్యూర్‌షిప్ ప్లాట్‌ఫారమ్ (WEP) ప్రారంభ ఎడిషన్ - NITI ఆయోగ్ స్టేట్ వర్క్‌షాప్ సిరీస్ గోవాలోని CSIR-నేషనల్ ఇన్స్టిట్యూట్ ఆఫ్ ఓషనోగ్రఫీ (NIO) ఆడిటోరియంలో నిర్వహించబడింది.",
    ),
    Question(
      questionText: "గంగా డాల్ఫిన్‌ను దాని జల జంతువుగా ఏ రాష్ట్రం నియమించింది?",
      options:["ఉత్తర ప్రదేశ్", "రాజస్థాన్", "జార్ఖండ్", "కేరళ"],
      correctAnswerIndex:0,
      explanation: "వన్యప్రాణుల సంరక్షణ మరియు పర్యావరణ పరిరక్షణ పట్ల ప్రభుత్వ నిబద్ధతను తెలియజేస్తూ ఉత్తరప్రదేశ్ ముఖ్యమంత్రి యోగి ఆదిత్యనాథ్ గంగా డాల్ఫిన్‌ను రాష్ట్ర జల జంతువుగా గుర్తించారు.",
    ),
    Question(
      questionText: "కనీస వేతనాల పరిధిలో స్విగ్గీ, జొమాటో, ఓలా, ఉబెర్ మరియు రాపిడో ఉద్యోగులు వంటి గిగ్ వర్కర్లను చేర్చిన భారతదేశంలో ఇటీవల ఏ రాష్ట్రం మొదటి స్థానంలో నిలిచింది?",
      options:["ఉత్తర ప్రదేశ్", "జార్ఖండ్", "తెలంగాణ", "తమిళనాడు"],
      correctAnswerIndex:1,
      explanation: "స్విగ్గీ, జొమాటో, ఓలా, ఉబెర్ మరియు రాపిడో ఉద్యోగుల వంటి గిగ్ వర్కర్లను కనీస వేతనాల పరిధిలో చేర్చిన భారతదేశంలో మొదటి రాష్ట్రంగా జార్ఖండ్ చరిత్ర సృష్టిస్తోంది.",
    ),
    Question(
      questionText: "తమిళనాడు ముఖ్యమంత్రి M.K. స్టాలిన్ అంతరించిపోతున్న నీలగిరి తహర్ జాతులను సంరక్షించడానికి మరియు రక్షించడానికి ఏ చొరవ తీసుకున్నారు?",
      options:["ప్రాజెక్ట్ గ్రీన్‌గార్డ్", "ప్రాజెక్ట్ నీలగిరి తహర్", "ప్రాజెక్ట్ వైల్డ్‌లైఫ్ షీల్డ్", "ప్రాజెక్ట్ ఎకో సేఫ్‌గార్డ్"],
      correctAnswerIndex:1,
      explanation: "తమిళనాడు ముఖ్యమంత్రి M.K. స్టాలిన్ ప్రాజెక్ట్ నీలగిరి తహర్ ను ప్రారంభించారు, ఇది అంతరించిపోతున్న నీలగిరి తహర్ జాతులను సంరక్షించడం మరియు రక్షించడం లక్ష్యంగా ఉంది.",
    ),
    Question(
      questionText: "హార్న్‌బిల్ ఫెస్టివల్ 2023 ఎప్పుడు జరుగుతుంది?",
      options:["నవంబర్ 1 నుండి నవంబర్ 10 వరకు", "డిసెంబర్ 1 నుండి డిసెంబర్ 10 వరకు", "అక్టోబర్ 1 నుండి అక్టోబర్ 10 వరకు", "సెప్టెంబర్ 1 నుండి సెప్టెంబర్ 10 వరకు"],
      correctAnswerIndex:1,
      explanation: "హార్న్‌బిల్ ఫెస్టివల్ 2023 డిసెంబర్ 1న ప్రారంభమై డిసెంబర్ 10న ముగుస్తుంది, పదిరోజుల సాంస్కృతిక ఇమ్మర్షన్ మరియు అద్భుత దృశ్యాలు ఉంటాయి.",
    ),
    Question(
      questionText: "2023లో స్వచ్ఛతా హి సేవా (SHS) ప్రచారానికి థీమ్ ఏమిటి?",
      options:["క్లీన్ ఇండియా, గ్రీన్ ఇండియా", "స్వచ్ఛ్ భారత్ దివస్", "చెత్త రహిత భారతదేశం", "అందరికీ పరిశుభ్రత"],
      correctAnswerIndex:2,
      explanation: "SHS-2023 యొక్క థీమ్ దృశ్య పరిశుభ్రత మరియు సఫాయిమిత్రల (పారిశుద్ధ్య కార్మికులు) సంక్షేమంపై ప్రత్యేక దృష్టితో 'చెత్త రహిత భారతదేశం'.",
    ),
    Question(
      questionText: "భారతదేశం యొక్క ఇంటెన్సిఫైడ్ మిషన్ ఇంద్రధనుష్ (IMI) 5.0 లక్ష్యం ఏమిటి?",
      options:["మలేరియాను నిర్మూలించడం", "తల్లి ఆరోగ్యాన్ని మెరుగుపరచడం", "వ్యవసాయ ఉత్పాదకతను పెంపొందించడం", "పిల్లలు మరియు గర్భిణీ స్త్రీలకు ఫ్లాగ్‌షిప్ ఇమ్యునైజేషన్"],
      correctAnswerIndex:3,
      explanation: "IMI 5.0 అనేది ఫ్లాగ్‌షిప్ ఇమ్యునైజేషన్ క్యాంపెయిన్, ఇది పిల్లలను చేరుకోవడానికి ఉద్దేశించబడిందిదేశవ్యాప్తంగా గర్భిణీ స్త్రీలతో పాటు వ్యాక్సిన్ మోతాదులను కోల్పోయి లేదా వారి టీకా షెడ్యూల్ వెనుక పడిపోయారు.",
    ),
    Question(
      questionText: "స్లైస్ మరియు నార్త్ ఈస్ట్ స్మాల్ ఫైనాన్స్ బ్యాంక్ (NESFB) మధ్య సహకారం యొక్క ప్రయోజనం ఏమిటి?",
      options:["వ్యవసాయాన్ని విప్లవాత్మకంగా మార్చడం", "ఆర్థిక చేరికలను విస్తరించడం", "మెడికల్ పరిశోధనను అభివృద్ధి చేయడం", "టెలికమ్యూనికేషన్‌లను మెరుగుపరచడం"],
      correctAnswerIndex:1,
      explanation: "స్లైస్ మరియు NESFB మధ్య సహకారం బ్యాంకింగ్ సేవలను విప్లవాత్మకంగా మార్చడం మరియు భారతదేశంలో ఆర్థిక చేరికలను విస్తరించడం లక్ష్యంగా పెట్టుకుంది.",
    ),
    Question(
      questionText: "గణాంకాలు మరియు కార్యక్రమ అమలు మంత్రిత్వ శాఖ విడుదల చేసిన 2022-23కి సంబంధించిన పీరియాడిక్ లేబర్ ఫోర్స్ సర్వే నివేదిక ఏమి వెల్లడిస్తుంది?",
      options:["మహిళా శ్రామిక శక్తి భాగస్వామ్య రేటులో తగ్గుదల", "మౌలిక సదుపాయాల వ్యయంలో పెరుగుదల", "ప్రపంచంలో అత్యంత సమయపాలన పాటించే విమానాశ్రయంగా KIA గుర్తింపు", "పదవీ విరమణ ఆదాయ వ్యవస్థల ర్యాంకింగ్"],
      correctAnswerIndex:1,
      explanation: "భారతదేశంలో మహిళా శ్రామిక శక్తి భాగస్వామ్య రేటు 2023లో 37.0%కి చేరుకుందని నివేదిక వెల్లడించింది.",
    ),
    Question(
      questionText: "యూరోపియన్ యూనియన్ టాక్స్ అబ్జర్వేటరీ ద్వారా 'గ్లోబల్ టాక్స్ ఎగవేషన్ రిపోర్ట్ 2024' ఏమి ప్రతిపాదిస్తుంది?",
      options:["బిలియనీర్లపై 2% ప్రపంచ సంపద పన్ను", "ఆదాయంపై ప్రపంచ కనీస పన్ను", "బిలియనీర్ల సంపద వృద్ధిని తగ్గించడం", "బిలియనీర్లకు పన్ను మినహాయింపులు"],
      correctAnswerIndex:0,
      explanation: "పన్ను ఎగవేతను ఎదుర్కోవడానికి మరియు ఆదాయాన్ని సంపాదించడానికి బిలియనీర్లపై 2% ప్రపంచ సంపద పన్నును నివేదిక ప్రతిపాదించింది.",
    ),
    Question(
      questionText: "హాంగ్‌జౌ ఆసియన్ గేమ్స్‌లో పురుషుల షాట్‌పుట్‌లో బంగారు పతకాన్ని ఎవరు సాధించారు, ఆసియా క్రీడల స్వర్ణాన్ని నిలుపుకున్న నాల్గవ భారతీయ షాట్ పుటర్?",
      options:["అవినాష్ సేబుల్", "నీరజ్ చోప్రా", "తాజిందర్‌పాల్ సింగ్ టూర్", "జ్యోతి సురేఖ వెన్నం"],
      correctAnswerIndex:2,
      explanation: "తజిందర్‌పాల్ సింగ్ టూర్ హాంగ్‌జౌ ఆసియా గేమ్స్‌లో పురుషుల షాట్‌పుట్‌లో బంగారు పతకాన్ని సాధించాడు, తద్వారా అతను తన ఆసియా క్రీడల స్వర్ణాన్ని విజయవంతంగా నిలబెట్టుకున్న చరిత్రలో నాల్గవ భారతీయ షాట్‌పుటర్‌గా నిలిచాడు.",
    ),
    Question(
      questionText: "హాంగ్‌జౌలో జరిగిన 19వ ఆసియా క్రీడల్లో మహిళల వ్యక్తిగత కాంపౌండ్ ఆర్చరీ ఈవెంట్‌లో ఏ భారతీయ క్రీడాకారిణి బంగారు పతకాన్ని గెలుచుకుంది, హ్యాట్రిక్ గోల్డ్ మెడల్స్ సాధించింది?",
      options:["జ్యోతి సురేఖ వెన్నం", "ఓజస్ డియోటలే", "పి. ఆర్. శ్రీజేష్", "డేవిడ్ వార్నర్"],
      correctAnswerIndex:0,
      explanation: "హాంగ్‌జౌలో జరిగిన 19వ ఆసియా క్రీడల్లో మహిళల వ్యక్తిగత కాంపౌండ్ ఆర్చరీ ఈవెంట్‌లో జ్యోతి సురేఖ వెన్నం బంగారు పతకాన్ని గెలుచుకుంది, హ్యాట్రిక్ గోల్డ్ మెడల్స్ సాధించింది.",
    ),
    Question(
      questionText: "2023లో 37వ జాతీయ క్రీడలు ఎక్కడ నిర్వహించబడతాయి?",
      options:["ఢిల్లీ", "ముంబయి", "గోవా", "బెంగళూరు"],
      correctAnswerIndex:2,
      explanation: "2023లో జాతీయ క్రీడల 37వ ఎడిషన్ సుందరమైన గోవాలో జరగనుంది. గోవా ఈ ప్రతిష్టాత్మక పోటీని నిర్వహించడం ఇదే మొదటిసారి.",
    ),
    Question(
      questionText: "వరల్డ్ అథ్లెటిక్స్ ద్వారా 2023లో ప్రతిష్టాత్మకమైన పురుషుల అథ్లెట్ ఆఫ్ ది ఇయర్ అవార్డుకు అధికారికంగా ఎవరు ఎంపికయ్యారు?",
      options:["నీరజ్ చోప్రా", "రౌనక్ సాధ్వని", "అశుతోష్ శర్మ", "మహమ్మద్ షమీ"],
      correctAnswerIndex:0,
      explanation: "ఒలింపిక్స్ మరియు ప్రపంచ ఛాంపియన్‌షిప్‌లలో జావెలిన్ త్రోయింగ్ మరియు బంగారు పతక విజయాలలో అతని అద్భుతమైన విజయాలను గుర్తించి, ప్రపంచ అథ్లెటిక్స్ అధికారికంగా నీరజ్ చోప్రాను 2023 సంవత్సరానికి ప్రతిష్టాత్మక పురుషుల అథ్లెట్ ఆఫ్ ది ఇయర్ అవార్డుకు నామినేట్ చేసింది.",
    ),
    Question(
      questionText: "ఇటీవల హషీమ్ ఆమ్లా పేరిట ఉన్న మునుపటి రికార్డును అధిగమించి వన్డే ఇంటర్నేషనల్ (ODI) క్రికెట్‌లో అత్యంత వేగంగా 2000 పరుగులు చేసిన ఆటగాడు ఎవరు?",
      options:["ఉన్నతి హుడా", "సుమిత్ యాంటిల్", "శుబ్మాన్ గిల్", "సుందర్ సింగ్ గుర్జార్"],
      correctAnswerIndex:2,
      explanation: "డైనమిక్ ఇండియన్ ఓపెనర్ అయిన శుభ్‌మాన్ గిల్, వన్డే క్రికెట్‌లో అత్యంత వేగంగా 2000 పరుగులు చేసిన ఆటగాడిగా నిలిచాడు, గతంలో హషీమ్ ఆమ్లా పేరిట ఉన్న రికార్డును అధిగమించాడు. ఈ ఘనత క్రికెట్ ప్రపంచంలో ఎదుగుతున్న స్టార్‌గా అతని పేరును మరింత పెంచింది. ",
    ),
    Question(
      questionText: "మినిస్ట్రీ ఆఫ్ మైక్రో, స్మాల్ అండ్ మీడియం ఎంటర్‌ప్రైజెస్ (MSME) నిర్వహించిన 'శ్రమదాన్' ఈవెంట్ యొక్క ఉద్దేశ్యం ఏమిటి?",
      options:["గ్లోబల్ బిజినెస్ ఇన్వెస్ట్‌మెంట్స్‌ని ప్రోత్సహించడానికి", "ఆఫ్ఘనిస్తాన్-సంబంధిత దౌత్య విషయాలను చర్చించడానికి", "'గార్బేజ్ ఫ్రీ ఇండియా' కోసం సమిష్టి బాధ్యతను పెంపొందించడానికి", "ఇండియన్ ఓషన్ రిమ్ అసోసియేషన్ (IORA)లో ప్రాంతీయ సహకారాన్ని పరిష్కరించడానికి" ],
      correctAnswerIndex:2,
      explanation: "మినిస్ట్రీ ఆఫ్ మైక్రో, స్మాల్ అండ్ మీడియం ఎంటర్‌ప్రైజెస్ (MSME) నిర్వహించిన 'శ్రమదాన్' కార్యక్రమం సామూహిక బాధ్యత మరియు చర్య యొక్క స్ఫూర్తిని పెంపొందించడం లక్ష్యంగా పెట్టుకుంది, దేశవ్యాప్తంగా వివిధ MSME కార్యాలయాల నుండి పాల్గొనేవారిని 'గార్బేజ్ ఫ్రీ ఇండియా'కు దోహదపడుతుంది. '",
    ),
    Question(
      questionText: "గంగా డాల్ఫిన్‌కు సంబంధించి ఉత్తరప్రదేశ్ ప్రభుత్వం ఏ ముఖ్యమైన చర్య తీసుకుంది?",
      options:["దీనిని రాష్ట్ర పక్షిగా గుర్తించబడింది", "అంతరించిపోయినట్లు ప్రకటించబడింది", "రాష్ట్ర జల జంతువుగా గుర్తించబడింది", "పరిరక్షణ కార్యక్రమాలు అమలు చేయబడింది"],
      correctAnswerIndex:2,explanation: "ఉత్తరప్రదేశ్ ముఖ్యమంత్రి యోగి ఆదిత్యనాథ్ గంగా డాల్ఫిన్‌ను రాష్ట్ర జల జంతువుగా నియమించారు, ఈ ప్రత్యేక జీవులను సంరక్షించడం మరియు అవి నివసించే నదులు మరియు చెరువుల స్వచ్ఛతను సంరక్షించడం యొక్క ప్రాముఖ్యతను తెలియజేస్తూ.",
    ),
    Question(
      questionText: "ఉత్తరాఖండ్ రాష్ట్ర ప్రభుత్వం ప్రారంభించిన 'యువ ఉత్తరాఖండ్ మొబైల్ అప్లికేషన్' యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
      options:["వాతావరణ నవీకరణలను అందించడం", "కెరీర్ కౌన్సెలింగ్ అందించడం", "పర్యాటక రంగాన్ని ప్రోత్సహించడం", "స్వయం ఉపాధి అవకాశాల గురించి సమాచారాన్ని అందించడం"],
      correctAnswerIndex:3,
      explanation: "'యువ ఉత్తరాఖండ్ మొబైల్ అప్లికేషన్' యొక్క ప్రాథమిక లక్ష్యం రాష్ట్రంలోని నిరుద్యోగ యువతకు స్వయం ఉపాధి అవకాశాల గురించి విలువైన సమాచారాన్ని అందించడం.",
    ),
    Question(
      questionText: "కే శివన్ మరియు మైల్‌స్వామి అన్నాదురై వంటి వ్యక్తులతో సహా రాష్ట్రానికి చెందిన తొమ్మిది మంది ప్రముఖ అంతరిక్ష శాస్త్రవేత్తలు సాధించిన విజయాలను ఇటీవల ఏ ముఖ్యమంత్రి సంబరాలు చేసుకున్నారు?",
      options:["MK స్టాలిన్", "యోగి ఆదిత్యనాథ్", "హిమంత బిస్వా శర్మ", "హేమంత్ సోరెన్"],
      correctAnswerIndex:0,
      explanation: "తమిళనాడు ముఖ్యమంత్రి MK స్టాలిన్ ఇటీవల రాష్ట్రానికి చెందిన తొమ్మిది మంది ప్రముఖ అంతరిక్ష శాస్త్రవేత్తలు, కె శివన్ మరియు మైల్‌స్వామి అన్నాదురై వంటి ప్రఖ్యాత వ్యక్తులు సాధించిన విజయాలను సంబరాలు చేసుకున్నారు.",
    ),
    Question(
      questionText: "మధ్యప్రదేశ్ ప్రభుత్వం అన్ని రాష్ట్ర ప్రభుత్వ ఉద్యోగ స్థానాల్లో ఎంత శాతం మహిళలకు రిజర్వేషన్లు ప్రకటించింది?",
      options:["25%", "30%", "35%", "40%"],
      correctAnswerIndex:2,
      explanation: "అటవీ శాఖ మినహా అన్ని రాష్ట్ర ప్రభుత్వ ఉద్యోగాల్లో 35% మహిళలకు రిజర్వ్ చేయడానికి మధ్యప్రదేశ్ ప్రభుత్వం ఒక సంచలనాత్మక విధానాన్ని ప్రకటించింది.",
    ),
    Question(
      questionText: "కేంద్ర గిరిజన వ్యవహారాల మంత్రి శ్రీ అర్జున్ ముండా ఏ నగరంలో 4వ ఏకలవ్య మోడల్ రెసిడెన్షియల్ స్కూల్స్ (EMRS) నేషనల్ కల్చరల్ & లిటరరీ ఫెస్ట్ మరియు కళా ఉత్సవ్-2023ని ప్రారంభించారు?",
      options:["చెన్నై", "డెహ్రాడూన్", "హైదరాబాద్", "గౌహతి"],
      correctAnswerIndex:1,
      explanation: "కేంద్ర గిరిజన వ్యవహారాల మంత్రి శ్రీ అర్జున్ ముండా, సుందరమైన నగరం డెహ్రాడూన్‌లో 4వ ఏకలవ్య మోడల్ రెసిడెన్షియల్ స్కూల్స్ (EMRS) నేషనల్ కల్చరల్ & లిటరరీ ఫెస్ట్ మరియు కళా ఉత్సవ్-2023ని ప్రారంభించారు.",
    ),
    Question(
      questionText: "రాష్ట్ర న్యాయ సేవలలో ఆర్థికంగా బలహీనమైన విభాగం (EWS) కేటగిరీ కిందకు వచ్చే వ్యక్తుల కోసం ఇటీవల ఏ భారతీయ రాష్ట్రం 10% రిజర్వేషన్ కోటాను ఆవిష్కరించింది?",
      options:["ఉత్తర ప్రదేశ్", "బీహార్", "మధ్యప్రదేశ్", "అస్సాం"],
      correctAnswerIndex:1,
      explanation: "ఒక ముఖ్యమైన చర్యలో, బీహార్ ప్రభుత్వం రాష్ట్ర న్యాయ సేవల్లో, అలాగే ప్రభుత్వ ఆధ్వర్యంలో నడిచే న్యాయ కళాశాలలు మరియు విశ్వవిద్యాలయాలలో ఆర్థికంగా బలహీనమైన విభాగం (EWS) కేటగిరీ కిందకు వచ్చే వ్యక్తుల కోసం 10% రిజర్వేషన్ కోటాను ఆవిష్కరించింది.",
    ),
    Question(
      questionText: "ఉమెన్ ఎంటర్‌ప్రెన్యూర్‌షిప్ ప్లాట్‌ఫారమ్ (WEP) ప్రారంభ ఎడిషన్ - ఎంట్రప్రెన్యూర్‌షిప్ ద్వారా మహిళల నేతృత్వంలోని అభివృద్ధిని ప్రారంభించడంపై నీతి ఆయోగ్ స్టేట్ వర్క్‌షాప్ సిరీస్ ఎక్కడ జరిగింది?",
      options:["గోవా", "ముంబై", "ఢిల్లీ", "చండీగఢ్"],
      correctAnswerIndex:0,
      explanation: "ఉమెన్ ఎంటర్‌ప్రెన్యూర్‌షిప్ ప్లాట్‌ఫారమ్ (WEP) యొక్క ప్రారంభ ఎడిషన్ - ఎంట్రప్రెన్యూర్‌షిప్ ద్వారా మహిళల నేతృత్వంలోని అభివృద్ధిని ప్రారంభించడంపై NITI ఆయోగ్ స్టేట్ వర్క్‌షాప్ సిరీస్ CSIR-నేషనల్ ఇన్స్టిట్యూట్ ఆఫ్ ఓషనోగ్రఫీ (NIO) ఆడిటోరియం, గోవాలో నిర్వహించబడింది.",
    ),







    Question(
      questionText: "ఇటీవల భారత నావికాదళంలో డిప్యూటీ చీఫ్ ఆఫ్ నేవల్ స్టాఫ్‌గా ఎవరు బాధ్యతలు స్వీకరించారు?",
      options:["ఎయిర్ చీఫ్ మార్షల్ VR చౌదరి", "వైస్ అడ్మిరల్ తరుణ్ సోబ్తి", "రక్షణ మంత్రి రాజ్‌నాథ్ సింగ్", "గ్రూప్ కెప్టెన్ షాలిజా ధామి"],
      correctAnswerIndex:1,
      explanation: "వైస్ అడ్మిరల్ తరుణ్ సోబ్తి ఇటీవలే భారత నావికాదళంలో డిప్యూటీ చీఫ్ ఆఫ్ నేవల్ స్టాఫ్‌గా బాధ్యతలు స్వీకరించారు, తన కొత్త పాత్రకు అనుభవం మరియు నైపుణ్యాన్ని అందించారు.",
    ),

    Question(
      questionText: "భారత్ మరియు బంగ్లాదేశ్ తమ వార్షిక సంయుక్త సైనిక వ్యాయామం సంప్రితి యొక్క 11వ ఎడిషన్‌ను ఎక్కడ ప్రారంభించాయి?",
      options:["జోర్హాట్, అస్సాం", "మేఘాలయ", "ఉమ్రోయ్ కంటోన్మెంట్", "ఢిల్లీ"],
      correctAnswerIndex:2,
      explanation: "భారత్ మరియు బంగ్లాదేశ్ పటిష్టమైన ద్వైపాక్షిక రక్షణ సహకార కార్యక్రమాలకు ప్రాధాన్యతనిస్తూ మేఘాలయలోని ఉమ్రోయ్‌లో వారి వార్షిక సంయుక్త సైనిక వ్యాయామం సంప్రితి యొక్క 11వ ఎడిషన్‌ను ప్రారంభించాయి.",
    ),

    Question(
      questionText: "ఐకానిక్ MiG-21 ఫైటర్ జెట్‌లకు సంబంధించి భారత వైమానిక దళం (IAF) ఏ ప్రణాళికలను కలిగి ఉంది?",
      options:["వాటిని రిటైర్ చేయడం మరియు మిరాజ్ 2000తో భర్తీ చేయడం", "వాటిని అధునాతన ఏవియానిక్స్‌తో అప్‌గ్రేడ్ చేయడం", "వాటిని స్వదేశీ లైట్ కంబాట్ ఎయిర్‌క్రాఫ్ట్ (LCA) మార్క్ 1Aతో భర్తీ చేయడం", "సరిహద్దు భద్రతా కార్యకలాపాలలో వాటిని మోహరించడం"],
      correctAnswerIndex:2,
      explanation: "భారత వైమానిక దళం (IAF) తన ఐకానిక్ MiG-21 ఫైటర్ జెట్‌లను రిటైర్ చేసి, వాటి స్థానంలో స్వదేశీ లైట్ కంబాట్ ఎయిర్‌క్రాఫ్ట్ (LCA) మార్క్ 1Aతో రక్షణ ఉత్పత్తిలో స్వీయ-విశ్వాసం కోసం పుష్‌తో సరిపెట్టే ప్రణాళికలను ప్రకటించింది." ,
    ),

    Question(
      questionText: "హిందుస్థాన్ ఏరోనాటిక్స్ లిమిటెడ్ (HAL) ఇటీవల ఏ ముఖ్యమైన డెలివరీ చేసిందిఇండియన్ ఎయిర్ ఫోర్స్ (IAF)?",
      options:["అధునాతన ఎయిర్ డిఫెన్స్ సిస్టమ్స్", "మానవరహిత వైమానిక వాహనాలు (UAVలు)", "స్టీల్త్ గైడెడ్ మిస్సైల్ డిస్ట్రాయర్", "లైట్ కంబాట్ ఎయిర్‌క్రాఫ్ట్ (LCA) తేజస్ ట్రైనర్"],
      correctAnswerIndex:3,
      explanation: "హిందూస్థాన్ ఏరోనాటిక్స్ లిమిటెడ్ (HAL) ఇటీవల లైట్ కంబాట్ ఎయిర్‌క్రాఫ్ట్ (LCA) తేజస్ యొక్క మొదటి ట్రైనర్ వెర్షన్‌ను ఇండియన్ ఎయిర్ ఫోర్స్ (IAF)కి అందించింది, ఇది IAF పైలట్‌లకు శిక్షణ ఇవ్వడంలో కీలక పాత్ర పోషిస్తోంది.",
    ),

    Question(
      questionText: "భారత సాయుధ దళాలకు మంజూరు చేయబడిన అత్యవసర సేకరణ శక్తి (EP) యొక్క ప్రాముఖ్యత ఏమిటి?",
      options:["పర్యావరణ నిబంధనలను దాటవేయడం", "అవసరమైన పరికరాలు మరియు సాంకేతికతను త్వరగా పొందడం", "దౌత్య సంబంధాలను మెరుగుపరచడం", "రక్షణ బడ్జెట్‌లను తగ్గించడం"],
      correctAnswerIndex:1,
      explanation: "భారత సాయుధ దళాలకు మంజూరు చేయబడిన ఎమర్జెన్సీ ప్రొక్యూర్‌మెంట్ పవర్ (EP) సుదీర్ఘ సేకరణ ప్రక్రియను దాటవేస్తూ అవసరమైన పరికరాలు మరియు సాంకేతికతను త్వరగా పొందేందుకు వీలు కల్పిస్తుంది.",
    ),

    Question(
      questionText: "భారత వైమానిక దళం 91వ వార్షికోత్సవ వేడుకల సందర్భంగా కొత్త IAF సైన్యాన్ని ఎవరు ఆవిష్కరించారు?",
      options:["ప్రధాన మంత్రి నరేంద్ర మోడీ", "రక్షణ మంత్రి రాజ్‌నాథ్ సింగ్", "ఎయిర్ చీఫ్ మార్షల్ V.R. చౌదరి", "గ్రూప్ కెప్టెన్ షాలిజా ధామి"],
      correctAnswerIndex:2,
      explanation: "భారత వైమానిక దళం యొక్క 91వ వార్షికోత్సవ వేడుకల సందర్భంగా ఎయిర్ చీఫ్ మార్షల్ V.R. చౌదరి కొత్త IAF జెండాను ఆవిష్కరించారు, ఇందులో వైమానిక దళ చిహ్నాన్ని చేర్చడం మరియు వైమానిక దళం డే పరేడ్‌కు నాయకత్వం వహించిన మొట్టమొదటి మహిళా అధికారి వంటి చారిత్రాత్మక ప్రధమాంశాలు ఉన్నాయి. గ్రూప్ కెప్టెన్ షాలిజా ధామి.",
    ),

    Question(
        questionText: "యునైటెడ్ నేషన్స్ ఇండస్ట్రియల్ డెవలప్‌మెంట్ ఆర్గనైజేషన్ డైరెక్టర్ జనరల్ ఎవరు?",
        options:["గెర్డ్ ముల్లర్", "సందీప్ వరగంటి", "వివేక్ రామ్ చౌదరి", "భూపేందర్ యాదవ్"],
        correctAnswerIndex:0,
        explanation: "గెర్డ్ ముల్లర్ యునైటెడ్ నేషన్స్ ఇండస్ట్రియల్ డెవలప్‌మెంట్ ఆర్గనైజేషన్ డైరెక్టర్ జనరల్, వియన్నా, ఆస్ట్రియాలో ప్రధాన కార్యాలయం మరియు 17 నవంబర్ 1966న స్థాపించబడింది."
    ),

    Question(
      questionText: "భారత వైమానిక సిబ్బంది చీఫ్‌గా ఎవరు పనిచేస్తున్నారు?",
      options:["గెర్డ్ ముల్లర్", "సందీప్ వరగంటి", "వివేక్ రామ్ చౌదరి", "భూపేందర్ యాదవ్"],
      correctAnswerIndex:2,
      explanation: "వివేక్ రామ్ చౌదరి భారత వైమానిక దళ నాయకత్వానికి దోహదపడుతూ భారత ఎయిర్ స్టాఫ్ చీఫ్ పదవిని కలిగి ఉన్నారు.",
    ),

    Question(
      questionText: "అసోం ముఖ్యమంత్రి ఎవరు?",
      options:["గెర్డ్ ముల్లర్", "సందీప్ వరగంటి", "వివేక్ రామ్ చౌదరి", "హిమంత బిస్వా శర్మ"],
      correctAnswerIndex:3,
      explanation: "హిమంత బిస్వా శర్మ అస్సాం ముఖ్యమంత్రి, రాష్ట్ర పాలనలో కీలక పాత్ర పోషిస్తున్నారు.",
    ),

    Question(
      questionText: "బ్యాడ్మింటన్ వరల్డ్ ఫెడరేషన్ అధ్యక్షుడు ఎవరు?",
      options:["పౌల్-ఎరిక్ హోయెర్ లార్సెన్", "ఎస్. సి. ముద్గేరికర్", "శాంతను నారాయణ్", "చాన్ చున్ సింగ్"],
      correctAnswerIndex:0,
      explanation: "పౌల్-ఎరిక్ హోయెర్ లార్సెన్ మలేషియాలోని కౌలాలంపూర్‌లో ప్రధాన కార్యాలయం ఉన్న బ్యాడ్మింటన్ వరల్డ్ ఫెడరేషన్ అధ్యక్షుడిగా పనిచేస్తున్నాడు.",
    ),

    Question(
      questionText: "స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) ఛైర్మన్ ఎవరు?",
      options:["దినేష్ కుమార్ ఖరా", "ఎస్. సి. ముద్గేరికర్", "వి. వైద్యనాథన్", "చాన్ చున్ సింగ్"],
      correctAnswerIndex:0,
      explanation: "దినేష్ కుమార్ ఖరా స్టేట్ బ్యాంక్ ఆఫ్ ఇండియా (SBI) ఛైర్మన్‌గా ఉన్నారు, దీని ప్రధాన కార్యాలయం మహారాష్ట్రలోని ముంబైలో ఉంది మరియు 1955లో స్థాపించబడింది.",
    ),

    Question(
      questionText: "థాయిలాండ్ అధికారిక కరెన్సీ ఏమిటి?",
      options:["భారత రూపాయి", "థాయ్ బాట్", "యెన్", "రింగ్గిట్"],
      correctAnswerIndex:1,
      explanation: "థాయిలాండ్ అధికారిక కరెన్సీ థాయ్ బాట్.",
    ),

    Question(
      questionText: "ఖేలో ఇండియా కార్యక్రమం ఏ సంవత్సరంలో ప్రారంభించబడింది?",
      options:["2015", "2016", "2017", "2018"],
      correctAnswerIndex:3,
      explanation: "ఖేలో ఇండియా ప్రోగ్రామ్ భారతదేశంలో క్రీడలు మరియు ఫిట్‌నెస్‌ను ప్రోత్సహించే లక్ష్యంతో 2018 సంవత్సరంలో ప్రారంభించబడింది.",
    ),

    Question(
      questionText: "మాస్టర్‌కార్డ్‌లో చీఫ్ మార్కెటింగ్ మరియు కమ్యూనికేషన్స్ ఆఫీసర్ ఎవరు?",
      options:["రాజా రాజమన్నార్", "వి. వైద్యనాథన్", "ఎస్. సి. ముద్గేరికర్", "చాన్ చున్ సింగ్"],
      correctAnswerIndex:0,
      explanation: "రాజా రాజమన్నార్ మాస్టర్ కార్డ్‌లో చీఫ్ మార్కెటింగ్ మరియు కమ్యూనికేషన్స్ ఆఫీసర్‌గా పనిచేస్తున్నారు.",
    ),

    Question(
      questionText: "ICC చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్ ఎవరు?",
      options:["జియోఫ్ అల్లార్డిస్", "ఎస్. సి. ముద్గేరికర్", "వి. వైద్యనాథన్", "చాన్ చున్ సింగ్"],
      correctAnswerIndex:0,
      explanation: "జియోఫ్ అల్లార్డిస్ ఇంటర్నేషనల్ క్రికెట్ కౌన్సిల్ (ICC) చీఫ్ ఎగ్జిక్యూటివ్ ఆఫీసర్‌గా ఉన్నారు.",
    ),

    Question(
      questionText: "కేరళలో సిపిఐ(ఎం) పార్టీకి అనాతలవట్టం ఆనందన్ గణనీయమైన సహకారం ఏమిటి?",
      options:[
        "పార్టీ ట్రేడ్ యూనియన్ పునాదిని నిర్మించడం",
        "శాసనసభకు నాయకత్వం వహించడం",
        "సాంస్కృతిక కార్యక్రమాలను ఏర్పాటు చేయడం",
        "విదేశీ సంబంధాలను పర్యవేక్షించడం"
      ],
      correctAnswerIndex:0,
      explanation: "కేరళలో సీపీఐ(ఎం) పార్టీకి ట్రేడ్ యూనియన్ పునాదిని నిర్మించడంలో అనాతలవట్టం ఆనందన్ కీలక పాత్ర పోషించారు.రాష్ట్రంలో దాని సంస్థాగత బలానికి అద్భుతంగా.",
    ),

    Question(
      questionText: "టెరెన్స్ డేవిస్ ఏ అంతర్జాతీయ ప్రశంసలు పొందిన చిత్రాలకు ప్రసిద్ధి చెందారు?",
      options:[
        "'దూరపు స్వరాలు, ఇప్పటికీ జీవిస్తున్నాయి' మరియు 'ది లాంగ్ డే క్లోజ్'",
        "'ప్రారంభం' మరియు 'ఇంటర్‌స్టెల్లార్'",
        "'ది గాడ్ ఫాదర్' మరియు 'ది షావ్‌శాంక్ రిడంప్షన్'",
        "'టైటానిక్' మరియు 'అవతార్'"
      ],
      correctAnswerIndex:0,
      explanation: "టెరెన్స్ డేవిస్, బ్రిటీష్ చిత్రనిర్మాత, 'డిస్టెంట్ వాయిస్, స్టిల్ లైవ్స్' మరియు 'ది లాంగ్ డే క్లోజ్‌లతో సహా తన ఆలోచనలను రేకెత్తించే మరియు ఆత్మపరిశీలనాత్మక చిత్రాలకు గుర్తింపు పొందారు.",
    ),

    Question(
      questionText: "మాజీ ప్రధాన ఎన్నికల కమిషనర్ (CEC) మనోహర్ సింగ్ గిల్ యొక్క ముఖ్యమైన సహకారం ఏమిటి?",
      options:[
        "వైద్య పరిశోధన",
        "ప్రజా సేవ మరియు అంకితభావం",
        "పర్యావరణ పరిరక్షణ",
        "అంతరిక్ష పరిశోధనము"
      ],
      correctAnswerIndex:1,
      explanation: "మాజీ చీఫ్ ఎలక్షన్ కమీషనర్ (CEC) మనోహర్ సింగ్ గిల్ ప్రజా సేవ మరియు అంకితభావం యొక్క వారసత్వాన్ని మిగిల్చారు, భారతీయ అధికార యంత్రాంగం మరియు రాజకీయాలలో ముఖ్యమైన వ్యక్తిగా పనిచేశారు.",
    ),

    Question(
      questionText: "వాతావరణ మార్పు రంగంలో సలీముల్ హుక్ ఎలా ప్రసిద్ధి చెందాడు?",
      options:[
        "వాతావరణ విప్లవాత్మక",
        "వాతావరణ నిరాకరణ",
        "వాతావరణ స్కెప్టిక్",
        "వాతావరణ చరిత్రకారుడు"
      ],
      correctAnswerIndex:0,
      explanation: "బాంగ్లాదేశ్-బ్రిటీష్ శాస్త్రవేత్త సలీముల్ హుక్, వాతావరణ మార్పుల యొక్క వినాశకరమైన ప్రభావాలను ఎదుర్కోవటానికి ప్రపంచంలోని అత్యంత పేద మరియు అత్యంత దుర్బల రాష్ట్రాలకు సహాయం చేయడానికి అధిక-కాలుష్య దేశాలకు తన ప్రయత్నాల కోసం 'వాతావరణ విప్లవకారుడు'గా పేరు పొందాడు.",
    ),

    Question(
      questionText: "బంగ్లాదేశ్‌లో వాతావరణ సంఘటన గురించి ఆందోళన కలిగించింది ఏమిటి?",
      options:[
        "భారీ వర్షపాతం",
        "బలమైన గాలులు",
        "వాతావరణ సంఘటనల యొక్క ఫ్రీక్వెన్సీ మరియు తీవ్రతను పెంచడం",
        "ఆకస్మిక ఉష్ణోగ్రత తగ్గుదల"
      ],
      correctAnswerIndex:2,
      explanation: "బంగ్లాదేశ్‌లోని వాతావరణ సంఘటన, ప్రత్యేకంగా హమూన్ తుఫాను, వాతావరణ మార్పుల ప్రభావాల వల్ల ఈ ప్రాంతంలో ఇటువంటి వాతావరణ సంఘటనల యొక్క పెరుగుతున్న ఫ్రీక్వెన్సీ మరియు తీవ్రత గురించి ఆందోళనలను లేవనెత్తింది.",
    ),

    Question(
      questionText: "సైక్లోన్ హమూన్‌ను ఏ విభాగం నిశితంగా పరిశీలిస్తోంది?",
      options:[
        "భారత అంతరిక్ష పరిశోధనా సంస్థ (ఇస్రో)",
        "భారత వాతావరణ శాఖ (IMD)",
        "నేషనల్ డిజాస్టర్ రెస్పాన్స్ ఫోర్స్ (NDRF)",
        "పర్యావరణ, అటవీ మరియు వాతావరణ మార్పు మంత్రిత్వ శాఖ"
      ],
      correctAnswerIndex:1,
      explanation: "భారత వాతావరణ శాఖ (IMD) బంగ్లాదేశ్ యొక్క ఆగ్నేయ తీరాన్ని తాకిన తీవ్రమైన వాతావరణ దృగ్విషయం, తుఫాను హమూన్‌ను నిశితంగా పరిశీలిస్తోంది.",
    ),

    Question(
      questionText: "జియో మామి ముంబై ఫిల్మ్ ఫెస్టివల్ ప్రారంభోత్సవంలో మాస్టర్ వేడుకకు నాయకత్వం వహించింది ఎవరు?",
      options:[
        "నీతా అంబానీ",
        "ముఖేష్ అంబానీ",
        "ప్రియాంక చోప్రా జోనాస్",
        "అమితాబ్ బచ్చన్"
      ],
      correctAnswerIndex:2,
      explanation: "జియో మామి ముంబై ఫిల్మ్ ఫెస్టివల్ ప్రారంభోత్సవంలో జరిగిన మాస్టర్ వేడుకకు జియో మామి చైర్‌పర్సన్ ప్రియాంక చోప్రా జోనాస్ నాయకత్వం వహించారు.",
    ),

    Question(
        questionText: "వివేక్ అగ్నిహోత్రి యొక్క తాజా పుస్తకం యొక్క శీర్షిక ఏమిటి మరియు 2023లో అతను ఏ చిత్రానికి దర్శకత్వం వహించాడు?",
        options:[
          "ది బుక్ ఆఫ్ లైఫ్: మై డ్యాన్స్ విత్ బుద్ధా ఫర్ సక్సెస్; ది కాశ్మీర్ ఫైల్స్",
          "గోయింగ్ వైరల్ - మేకింగ్ ఆఫ్ కోవాక్సిన్: ది ఇన్‌సైడ్ స్టోరీ; ది వ్యాక్సిన్ వార్",
          "అష్టాధ్యాయి భాష్య; రామానందాచార్య చరితం",
          "మాది; గడ్కరీ"
        ],
        correctAnswerIndex:0,
        explanation: "వివేక్ అగ్నిహోత్రి యొక్క తాజా పుస్తకం పేరు 'ది బుక్ ఆఫ్ లైఫ్: మై డ్యాన్స్ విత్ బుద్ధా ఫర్ సక్సెస్.' 2023లో, అతను బలరామ్ భార్గవ పుస్తకం 'గోయింగ్ వైరల్ - మేకింగ్ ఆఫ్ కోవాక్సిన్: ది ఇన్‌సైడ్ స్టోరీ ఆధారంగా 'ది వ్యాక్సిన్ వార్' అనే మెడికల్ డ్రామా చిత్రానికి దర్శకత్వం వహించాడు."
    ),

    Question(
      questionText: "హిందూ మతం మరియు దాని సంప్రదాయాలపై అంతర్దృష్టిని అందిస్తూ ప్రధాని మోదీ ఏ మూడు పుస్తకాలను విడుదల చేశారు?",
      options:[
        "ది రివర్స్ స్వింగ్: కలోనియలిజం టు కోఆపరేషన్; ది బుక్ ఆఫ్ లైఫ్: మై డ్యాన్స్ విత్ బుద్ధా ఫర్ సక్సెస్; గోయింగ్ వైరల్ - మేకింగ్ ఆఫ్ కోవాక్సిన్: ది ఇన్‌సైడ్ స్టోరీ",
        "అష్టాధ్యాయి భాష్య; రామానందాచార్య చరితం; భగవాన్ శ్రీ కృష్ణ కి రాష్ట్రలీల",
        "అప్పలాచియన్ ట్రైల్; బసోలి పష్మినా; రొమ్ము క్యాన్సర్ అవగాహన నెల",
        "నీవ్ లిటరేచర్ ఫెస్టివల్ 2023; క్రిష్, త్రిష్ మరియు బాల్టీబాయ్ - భారత్ హై హమ్; సైక్లోన్ తేజ్"
      ],
      correctAnswerIndex:1,
      explanation: "ప్రధాని మోదీ మూడు పుస్తకాలను విడుదల చేశారు: 'అష్టాధ్యాయి భాష్య,' 'రామానందాచార్య చరితం,' మరియు 'భగవాన్ శ్రీ కృష్ణ కీ రాష్ట్రలీల,' హిందూమతం మరియు దాని గొప్ప సంప్రదాయాలపై విశిష్టమైన అంతర్దృష్టులను అందిస్తాయి.",
    ),

    Question(
      questionText: "అక్టోబర్ 2న Google Doodle దేనికి నివాళులర్పిస్తుంది?",
      options:[
        "నీవ్ లిటరేచర్ ఫెస్టివల్ 2023",
        "అప్పలాచియన్ ట్రైల్",
        "బసోహ్లి పష్మినా",
        "రొమ్ము క్యాన్సర్ అవగాహన నెల"
      ],
      correctAnswerIndex:1,
      explanation: "అక్టోబర్ 2న, Google Doodle అప్పలాచియన్ ట్రైల్‌కు నివాళులు అర్పిస్తుంది, ఇది ప్రపంచంలోనే అతి పొడవైన హైకింగ్-ఓన్లీ ఫుట్‌పాత్, దాదాపు ఒక శతాబ్దం పాటు సాహసికులు, ప్రకృతి ఔత్సాహికులు మరియు అన్వేషకులను ఆకట్టుకుంటుంది.",
    ),








    Question(
      questionText: "టెరెన్స్ డేవిస్ ఏ అంతర్జాతీయ ప్రశంసలు పొందిన చిత్రాలకు ప్రసిద్ధి చెందారు?",
      options:[
        "'దూరపు స్వరాలు, ఇప్పటికీ జీవిస్తున్నాయి' మరియు 'ది లాంగ్ డే క్లోజ్'",
        "'ప్రారంభం' మరియు 'ఇంటర్‌స్టెల్లార్'",
        "'ది గాడ్ ఫాదర్' మరియు 'ది షావ్‌శాంక్ రిడంప్షన్'",
        "'టైటానిక్' మరియు 'అవతార్'"
      ],
      correctAnswerIndex:0,
      explanation: "టెరెన్స్ డేవిస్, బ్రిటీష్ చిత్రనిర్మాత, 'డిస్టెంట్ వాయిస్, స్టిల్ లైవ్స్' మరియు 'ది లాంగ్ డే క్లోజ్‌లతో సహా తన ఆలోచనలను రేకెత్తించే మరియు ఆత్మపరిశీలనాత్మక చిత్రాలకు గుర్తింపు పొందారు.",
    ),

    Question(
      questionText: "మాజీ ప్రధాన ఎన్నికల కమిషనర్ (CEC) మనోహర్ సింగ్ గిల్ యొక్క ముఖ్యమైన సహకారం ఏమిటి?",
      options:[
        "వైద్య పరిశోధన",
        "ప్రజా సేవ మరియు అంకితభావం",
        "పర్యావరణ పరిరక్షణ",
        "అంతరిక్ష పరిశోధనము"
      ],
      correctAnswerIndex:1,
      explanation: "మాజీ చీఫ్ ఎలక్షన్ కమీషనర్ (CEC) మనోహర్ సింగ్ గిల్ ప్రజా సేవ మరియు అంకితభావం యొక్క వారసత్వాన్ని మిగిల్చారు, భారతీయ అధికార యంత్రాంగం మరియు రాజకీయాలలో ముఖ్యమైన వ్యక్తిగా పనిచేశారు.",
    ),

    Question(
      questionText: "వాతావరణ మార్పు రంగంలో సలీముల్ హుక్ ఎలా ప్రసిద్ధి చెందాడు?",
      options:[
        "వాతావరణ విప్లవాత్మక",
        "వాతావరణ నిరాకరణ",
        "వాతావరణ స్కెప్టిక్",
        "వాతావరణ చరిత్రకారుడు"
      ],
      correctAnswerIndex:0,
      explanation: "బాంగ్లాదేశ్-బ్రిటీష్ శాస్త్రవేత్త సలీముల్ హుక్, వాతావరణ మార్పుల యొక్క వినాశకరమైన ప్రభావాలను ఎదుర్కోవటానికి ప్రపంచంలోని అత్యంత పేద మరియు అత్యంత దుర్బల రాష్ట్రాలకు సహాయం చేయడానికి అధిక-కాలుష్య దేశాలకు తన ప్రయత్నాల కోసం 'వాతావరణ విప్లవకారుడు'గా పేరు పొందాడు.",
    ),

    Question(
      questionText: "బంగ్లాదేశ్‌లో వాతావరణ సంఘటన గురించి ఆందోళన కలిగించింది ఏమిటి?",
      options:[
        "భారీ వర్షపాతం",
        "బలమైన గాలులు",
        "వాతావరణ సంఘటనల యొక్క ఫ్రీక్వెన్సీ మరియు తీవ్రతను పెంచడం",
        "ఆకస్మిక ఉష్ణోగ్రత తగ్గుదల"
      ],
      correctAnswerIndex:2,
      explanation: "బంగ్లాదేశ్‌లోని వాతావరణ సంఘటన, ప్రత్యేకంగా హమూన్ తుఫాను, వాతావరణ మార్పుల ప్రభావాల వల్ల ఈ ప్రాంతంలో ఇటువంటి వాతావరణ సంఘటనల యొక్క పెరుగుతున్న ఫ్రీక్వెన్సీ మరియు తీవ్రత గురించి ఆందోళనలను లేవనెత్తింది.",
    ),

    Question(
      questionText: "సైక్లోన్ హమూన్‌ను ఏ విభాగం నిశితంగా పరిశీలిస్తోంది?",
      options:[
        "భారత అంతరిక్ష పరిశోధనా సంస్థ (ఇస్రో)",
        "భారత వాతావరణ శాఖ (IMD)",
        "నేషనల్ డిజాస్టర్ రెస్పాన్స్ ఫోర్స్ (NDRF)",
        "పర్యావరణ, అటవీ మరియు వాతావరణ మార్పు మంత్రిత్వ శాఖ"
      ],
      correctAnswerIndex:1,
      explanation: "భారత వాతావరణ శాఖ (IMD) బంగ్లాదేశ్ యొక్క ఆగ్నేయ తీరాన్ని తాకిన తీవ్రమైన వాతావరణ దృగ్విషయం, తుఫాను హమూన్‌ను నిశితంగా పరిశీలిస్తోంది.",
    ),

    Question(
      questionText: "జియో మామి ముంబై ఫిల్మ్ ఫెస్టివల్ ప్రారంభోత్సవంలో మాస్టర్ వేడుకకు నాయకత్వం వహించింది ఎవరు?",
      options:[
        "నీతా అంబానీ",
        "ముఖేష్ అంబానీ",
        "ప్రియాంక చోప్రా జోనాస్",
        "అమితాబ్ బచ్చన్"
      ],
      correctAnswerIndex:2,
      explanation: "జియో మామి ముంబై ఫిల్మ్ ఫెస్టివల్ ప్రారంభోత్సవంలో జరిగిన మాస్టర్ వేడుకకు జియో మామి చైర్‌పర్సన్ ప్రియాంక చోప్రా జోనాస్ నాయకత్వం వహించారు.",
    ),

    Question(
        questionText: "వివేక్ అగ్నిహోత్రి యొక్క తాజా పుస్తకం యొక్క శీర్షిక ఏమిటి మరియు 2023లో అతను ఏ చిత్రానికి దర్శకత్వం వహించాడు?",
        options:[
          "ది బుక్ ఆఫ్ లైఫ్: మై డ్యాన్స్ విత్ బుద్ధా ఫర్ సక్సెస్; ది కాశ్మీర్ ఫైల్స్",
          "గోయింగ్ వైరల్ - మేకింగ్ ఆఫ్ కోవాక్సిన్: ది ఇన్‌సైడ్ స్టోరీ; ది వ్యాక్సిన్ వార్",
          "అష్టాధ్యాయి భాష్య; రామానందాచార్య చరితం",
          "మాది; గడ్కరీ"
        ],
        correctAnswerIndex:0,
        explanation: "వివేక్ అగ్నిహోత్రి యొక్క తాజా పుస్తకం పేరు 'ది బుక్ ఆఫ్ లైఫ్: మై డ్యాన్స్ విత్ బుద్ధా ఫర్ సక్సెస్.' 2023లో, అతను బలరామ్ భార్గవ పుస్తకం 'గోయింగ్ వైరల్ - మేకింగ్ ఆఫ్ కోవాక్సిన్: ది ఇన్‌సైడ్ స్టోరీ ఆధారంగా 'ది వ్యాక్సిన్ వార్' అనే మెడికల్ డ్రామా చిత్రానికి దర్శకత్వం వహించాడు."
    ),

    Question(
      questionText: "హిందూ మతం మరియు దాని సంప్రదాయాలపై అంతర్దృష్టిని అందిస్తూ ప్రధాని మోదీ ఏ మూడు పుస్తకాలను విడుదల చేశారు?",
      options:[
        "ది రివర్స్ స్వింగ్: కలోనియలిజం టు కోఆపరేషన్; ది బుక్ ఆఫ్ లైఫ్: మై డ్యాన్స్ విత్ బుద్ధా ఫర్ సక్సెస్; గోయింగ్ వైరల్ - మేకింగ్ ఆఫ్ కోవాక్సిన్: ది ఇన్‌సైడ్ స్టోరీ",
        "అష్టాధ్యాయి భాష్య; రామానందాచార్య చరితం; భగవాన్ శ్రీ కృష్ణ కి రాష్ట్రలీల",
        "అప్పలాచియన్ ట్రైల్; బసోలి పష్మినా; రొమ్ము క్యాన్సర్ అవగాహన నెల",
        "నీవ్ లిటరేచర్ ఫెస్టివల్ 2023; క్రిష్, త్రిష్ మరియు బాల్టీబాయ్ - భారత్ హై హమ్; సైక్లోన్ తేజ్"
      ],
      correctAnswerIndex:1,
      explanation: "ప్రధాని మోదీ మూడు పుస్తకాలను విడుదల చేశారు: 'అష్టాధ్యాయి భాష్య,' 'రామానందాచార్య చరితం,' మరియు 'భగవాన్ శ్రీ కృష్ణ కీ రాష్ట్రలీల,' హిందూమతం మరియు దాని గొప్ప సంప్రదాయాలపై విశిష్టమైన అంతర్దృష్టులను అందిస్తాయి.",
    ),

    Question(
      questionText: "అక్టోబర్ 2న Google Doodle దేనికి నివాళులర్పిస్తుంది?",
      options:[
        "నీవ్ లిటరేచర్ ఫెస్టివల్ 2023",
        "అప్పలాచియన్ ట్రైల్",
        "బసోహ్లి పష్మినా",
        "రొమ్ము క్యాన్సర్ అవగాహన నెల"
      ],
      correctAnswerIndex:1,
      explanation: "అక్టోబర్ 2న, Google Doodle అప్పలాచియన్ ట్రైల్‌కు నివాళులు అర్పిస్తుంది, ఇది ప్రపంచంలోనే అతి పొడవైన హైకింగ్-ఓన్లీ ఫుట్‌పాత్, దాదాపు ఒక శతాబ్దం పాటు సాహసికులు, ప్రకృతి ఔత్సాహికులు మరియు అన్వేషకులను ఆకట్టుకుంటుంది.",
    ),

    Question(
      questionText: "భారత అంతరిక్ష కార్యకలాపాల కోసం ప్రధాన మంత్రి నరేంద్ర మోడీ ఏ ప్రతిష్టాత్మక ప్రణాళికలను ప్రకటించారు?",
      options:[
        "ఎత్తైన ఆకాశహర్మ్యాన్ని నిర్మించడం; 2050",
        "మార్స్‌కు మొదటి వ్యోమగామిని పంపడం; 2030",
        "2035 నాటికి స్థానిక అంతరిక్ష కేంద్రాన్ని ఏర్పాటు చేయడం; 2040 నాటికి చంద్రునిపైకి మొదటి వ్యోమగామిని పంపడం",
        "మొదటి ఇంటర్స్టెల్లార్ సమ్మిట్‌ని నిర్వహిస్తోంది; 2022"
      ],
      correctAnswerIndex:2,
      explanation: "2040 నాటికి చంద్రునిపైకి మొదటి వ్యోమగామిని పంపడం మరియు 2035 నాటికి స్థానిక అంతరిక్ష కేంద్రాన్ని ఏర్పాటు చేయడంతో సహా భారతదేశ అంతరిక్ష కార్యకలాపాలను విస్తరించే ప్రణాళికలను ప్రధాని నరేంద్ర మోడీ ప్రకటించారు.",
    ),



    Question(
      questionText: "భారతదేశంలో ఆన్‌లైన్ ఆర్థిక మోసాలను Google ఎలా పరిష్కరిస్తోంది మరియు ప్రోగ్రామ్ పేరు ఏమిటి?",
      options:[
        "బ్లాక్‌చెయిన్ టెక్నాలజీ; ప్రాజెక్ట్ షీల్డ్",
        "అంతరిక్ష అన్వేషణ; ఆపరేషన్ స్టార్‌గార్డ్",
        "ప్రతిచర్యలతో మోసపూరిత కార్యకలాపాలను ఎదుర్కోవడం; డిజికవాచ్",
        "ఆర్టిఫిషియల్ ఇంటెలిజెన్స్; ఆపరేషన్ సైబర్‌గార్డ్"
      ],
      correctAnswerIndex:2,
      explanation: "Google తన ప్రోగ్రామ్, DigiKavach ద్వారా భారతదేశంలో ఆన్‌లైన్ ఆర్థిక మోసాలను పరిష్కరిస్తోంది. స్కామర్‌లు ఉపయోగించే వ్యూహాలను అర్థం చేసుకోవడం మరియు ప్రతిఘటనలను అమలు చేయడం ద్వారా ఈ మోసపూరిత కార్యకలాపాలను ఎదుర్కోవడమే ఈ ప్రోగ్రామ్ లక్ష్యం.",
    ),

    Question(
      questionText: "అక్టోబర్ 24న హైదరాబాద్‌లో ఏ ముఖ్యమైన సంఘటన జరిగింది మరియు భవిష్యత్తుపై అంచనాలు ఏమిటి?",
      options:[
        "కొత్త ఉపగ్రహ ప్రయోగం; 2025లో పూర్తి వాణిజ్య ప్రయోగం",
        "స్కైరూట్ యొక్క విక్రమ్-1 ఆర్బిటల్ రాకెట్ ఆవిష్కరణ; 2024 తరువాతి నెలల్లో పూర్తిగా వాణిజ్య ప్రయోగం",
        "మొదటి 6G సాంకేతిక పరీక్ష; అంతర్జాతీయ అంతరిక్ష సంస్థలతో సహకారం",
        "స్పేస్ నేపథ్య వినోద ఉద్యానవనం యొక్క ప్రకటన; 2023లో తెరవబడుతుంది"
      ],
      correctAnswerIndex:1,
      explanation: "అక్టోబర్ 24న హైదరాబాద్‌లో, డాక్టర్. జితేంద్ర సింగ్ స్కైరూట్ యొక్క విక్రమ్-1 కక్ష్య రాకెట్‌ను ఆవిష్కరించారు. 2024 తర్వాతి నెలల్లో పూర్తి వాణిజ్య ప్రయోగం కోసం అంచనాలు ఉన్నాయి, ఇది భారతదేశ అంతరిక్ష పరిశ్రమకు ఒక ముఖ్యమైన సంఘటనగా గుర్తు చేస్తుంది.",
    ),

    Question(
      questionText: "అంతరిక్ష అన్వేషణలో చైనా ఇటీవల సాధించిన ఏ విజయాన్ని జరుపుకుంది మరియు ఆ మిషన్‌ను ఏమని పిలుస్తారు?",
      options:[
        "అంగారక గ్రహానికి మొదటి మానవ మిషన్; మార్స్ ఒడిస్సీ",
        "గ్రహశకలం బెల్ట్ యొక్క అన్వేషణ; గ్రహశకలం వాయేజర్",
        "జియుక్వాన్ శాటిలైట్ లాంచ్ సెంటర్ నుండి షెంజౌ 17 ప్రయోగం",
        "మూన్ బేస్ ఏర్పాటు; లూనార్ హారిజోన్"
      ],
      correctAnswerIndex:2,
      explanation: "జియుక్వాన్ శాటిలైట్ లాంచ్ సెంటర్ నుండి షెంజౌ 17 యొక్క ఇటీవలి ప్రయోగాన్ని చైనా జరుపుకుంది, ఇది యునైటెడ్ స్టేట్స్‌తో పోటీ స్పూర్తితో ఆజ్యం పోసిన బాహ్య అంతరిక్షాన్ని అన్వేషించడానికి దేశం యొక్క సంకల్పాన్ని హైలైట్ చేస్తుంది.",
    ),

    Question(
      questionText: "రిలయన్స్ జియో ఇన్ఫోకామ్ లిమిటెడ్ ఏ సంచలనాత్మక శాటిలైట్ బ్రాడ్‌బ్యాండ్ సేవను ప్రవేశపెట్టింది మరియు దాని ప్రాథమిక లక్ష్యం ఏమిటి?",
      options:[
        "క్వాంటం శాటిలైట్ నెట్‌వర్క్; అడ్వాన్సింగ్ క్వాంటం కమ్యూనికేషన్",
        "JioSpaceFiber; తక్కువ ప్రాంతాలకు హై-స్పీడ్ ఇంటర్నెట్ యాక్సెస్‌ను విస్తరించడం",
        "గ్లోబల్ ఇంటర్నెట్ కాన్స్టెలేషన్; ప్రపంచవ్యాప్త ఇంటర్నెట్ కవరేజీని అందిస్తోంది",
        "నేషనల్ జియోస్పేషియల్ శాటిలైట్ సిస్టమ్; నావిగేషన్ సేవలను మెరుగుపరుస్తుంది.",
      ],
      correctAnswerIndex:1,
      explanation: "Reliance Jio Infocomm Ltd 'JioSpaceFiber,' భారతదేశపు మొట్టమొదటి ఉపగ్రహ ఆధారిత గిగా ఫైబర్ సేవను ప్రవేశపెట్టింది. భారతదేశంలోని మునుపు తక్కువ మరియు మారుమూల ప్రాంతాలకు హై-స్పీడ్ ఇంటర్నెట్ సదుపాయాన్ని విస్తరించడం ప్రాథమిక లక్ష్యం.",
    ),

    Question(
      questionText: "ఫిజియాలజీ లేదా మెడిసిన్‌లో 2023 నోబెల్ బహుమతి ఎవరికి లభించింది మరియు వారి గుర్తింపుకు కారణం ఏమిటి?",
      options:[
        "పియరీ అగోస్టిని, ఫెరెన్క్ క్రౌజ్, మరియు అన్నే ఎల్'హుల్లియర్; క్వాంటం డాట్స్ డిస్కవరీ",
        "కటాలిన్ కారికో మరియు డ్రూ వీస్మాన్; COVID-19కి వ్యతిరేకంగా mRNA టీకాలు",
        "మౌంగి జి. బావెండి, లూయిస్ ఇ. బ్రస్, మరియు అలెక్సీ I. ఎకిమోవ్; అటోసెకండ్ పల్స్ ఆఫ్ లైట్",
        "జాన్ ఫోస్సే; వినూత్న నాటకాలు మరియు గద్యాలు"
      ],
      correctAnswerIndex:1,
      explanation: "COVID-19కి వ్యతిరేకంగా సమర్థవంతమైన mRNA వ్యాక్సిన్‌ల అభివృద్ధిని ఎనేబుల్ చేసిన న్యూక్లియోసైడ్ బేస్ సవరణలకు సంబంధించి కటాలిన్ కారికో మరియు డ్రూ వీస్‌మాన్‌లకు ఫిజియాలజీ లేదా మెడిసిన్‌లో 2023 నోబెల్ బహుమతి లభించింది.",
    ),

    Question(
      questionText: "భౌతిక శాస్త్రంలో 2023 నోబెల్ బహుమతిని ఎవరు అందుకున్నారు మరియు వారి గుర్తింపుకు ఆధారం ఏమిటి?",
      options:[
        "సుధా మూర్తి; దాతృత్వం మరియు సామాజిక ప్రభావం",
        "పియర్ అగోస్టిని, ఫెరెన్క్ క్రౌజ్, మరియు అన్నే ఎల్'హుల్లియర్; అటోసెకండ్ పల్స్ ఆఫ్ లైట్",
        "మౌంగి జి. బవెండి, లూయిస్ ఇ. బ్రస్, మరియు అలెక్సీ I. ఎకిమోవ్; క్వాంటం డాట్స్ డిస్కవరీ",
        "నీతా అంబానీ; దాతృత్వం మరియు కార్పొరేట్ సామాజిక బాధ్యత"
      ],
      correctAnswerIndex:1,
      explanation: "పదార్థంలో ఎలక్ట్రాన్ డైనమిక్స్ అధ్యయనం కోసం కాంతి యొక్క అటోసెకండ్ పల్స్‌ను ఉత్పత్తి చేసే ప్రయోగాత్మక పద్ధతుల కోసం పియరీ అగోస్టినీ, ఫెరెన్క్ క్రాస్జ్ మరియు అన్నే ఎల్'హుల్లియర్ 2023 భౌతిక శాస్త్రంలో నోబెల్ బహుమతిని అందుకున్నారు.",
    ),

    Question(
      questionText: "కెమిస్ట్రీ 2023 నోబెల్ బహుమతి యొక్క దృష్టి ఏమిటి మరియు గ్రహీతలు ఎవరు?",
      options:[
        "అంబాయి; భారతీయ సాహిత్యానికి సహకారం",
        "జినా మహ్సా అమిని; సఖారోవ్ పియూరోపియన్ పార్లమెంట్‌లో పెరుగుదల",
        "మౌంగి జి. బవెండి, లూయిస్ ఇ. బ్రస్, మరియు అలెక్సీ I. ఎకిమోవ్; క్వాంటం డాట్స్ డిస్కవరీ",
        "డా. జోయితా గుప్తా; వాతావరణ మార్పుల రంగంలో పని"
      ],
      correctAnswerIndex:2,
      explanation: "2023 రసాయన శాస్త్రంలో నోబెల్ బహుమతి క్వాంటం చుక్కల ఆవిష్కరణ మరియు అభివృద్ధిపై దృష్టి సారించింది. గ్రహీతలు Moungi G. Bawendi, Louis E. Brus మరియు Alexei I. Ekimov.",
    ),

    Question(
      questionText: "2023 సాహిత్యంలో నోబెల్ బహుమతిని ఎవరు అందుకున్నారు మరియు వారి గుర్తింపుకు కారణం ఏమిటి?",
      options:[
        "పియర్ అగోస్టిని, ఫెరెన్క్ క్రౌజ్, మరియు అన్నే ఎల్'హుల్లియర్; అటోసెకండ్ పల్స్ ఆఫ్ లైట్",
        "జినా మహ్సా అమినీ; ఇరాన్‌లో మహిళల అణచివేతకు వ్యతిరేకంగా పోరాటం",
        "ప్రఖ్యాత రచయిత జోన్ ఫోస్సే; వినూత్న నాటకాలు మరియు గద్యాలు",
        "దిలీప్ నొంగ్మైతెం; మణిపురి భాషలో చేసిన కృషికి 'బాల్ సాహిత్య పురస్కారం"
      ],
      correctAnswerIndex:2,
      explanation: "2023 సాహిత్యంలో నోబెల్ బహుమతిని నార్వేజియన్ రచయిత జోన్ ఫోస్సే అతని వినూత్న నాటకాలు మరియు గద్యాలకు అందించారు, ఇది చెప్పలేని వాటికి స్వరం ఇస్తుంది.",
    ),

    Question(
      questionText: "ప్రతిష్టాత్మకమైన డచ్ స్పినోజా బహుమతి ఎవరికి లభించింది మరియు ఏ అద్భుతమైన పని కోసం?",
      options:[
        "క్లాడియా గోల్డిన్; మహిళల కార్మిక మార్కెట్ ఫలితాలపై అవగాహన పెంచుకోవడం",
        "మైఖేల్ డగ్లస్; సత్యజిత్ రే ఎక్సలెన్స్ ఇన్ ఫిల్మ్ లైఫ్‌టైమ్ అవార్డు",
        "డా. జోయితా గుప్తా; వాతావరణ మార్పుల రంగంలో పని",
        "భారతీయ సంతతికి చెందిన ప్రొఫెసర్ డాక్టర్ జోయితా గుప్తా; వాతావరణ మార్పుల రంగంలో సంచలనాత్మక కృషి"
      ],
      correctAnswerIndex:3,
      explanation: "వాతావరణ మార్పుల రంగంలో ఆమె చేసిన అద్భుతమైన కృషికి భారత సంతతికి చెందిన ప్రొఫెసర్ డాక్టర్ జోయితా గుప్తా ప్రతిష్టాత్మకమైన డచ్ స్పినోజా బహుమతిని పొందారు.",
    ),

    Question(
      questionText: "ఉత్తర ప్రదేశ్ ఏ గుర్తింపు పొందింది మరియు ఏ ప్రయత్నాల కోసం?",
      options:[
        "తమిళ రచయిత శివశంకరి; ఆమె జ్ఞాపకాల కోసం సరస్వతి సమ్మాన్",
        "ఉత్తరప్రదేశ్; టెలిమనస్ నిర్వహణలో అత్యుత్తమ ప్రయత్నాలు",
        "ప్రఖ్యాత హాలీవుడ్ నటుడు మైఖేల్ డగ్లస్; సత్యజిత్ రే ఎక్సలెన్స్ ఇన్ ఫిల్మ్ లైఫ్‌టైమ్ అవార్డు",
        "జినా మహ్సా అమినీ; యూరోపియన్ పార్లమెంటులో సఖారోవ్ బహుమతి"
      ],
      correctAnswerIndex:2,
      explanation: "టెలి-టెక్నాలజీ ఆధారిత మానసిక ఆరోగ్యం మరియు కౌన్సెలింగ్ సేవ అయిన టెలిమనస్‌ను అమలు చేయడంలో అత్యుత్తమ ప్రయత్నాలకు ఉత్తర ప్రదేశ్‌కు మూడవ బహుమతి లభించింది.",
    ),

    Question(
      questionText: "ఆల్‌ఫ్రెడ్ నోబెల్ 2023 జ్ఞాపకార్థం ఎకనామిక్ సైన్సెస్‌లో స్వెరిజెస్ రిక్స్‌బ్యాంక్ బహుమతిని ఎవరు పొందారు మరియు వారి గుర్తింపుకు కారణం ఏమిటి?",
      options:[
        "నీతా అంబానీ; దాతృత్వం మరియు కార్పొరేట్ సామాజిక బాధ్యత",
        "క్లాడియా గోల్డిన్; మహిళల కార్మిక మార్కెట్ ఫలితాలపై అవగాహన పెంచుకోవడం",
        "భారత ప్రధాన న్యాయమూర్తి DY చంద్రచూడ్; గ్లోబల్ లీడర్‌షిప్ అవార్డు",
        "ఉత్తరప్రదేశ్; టెలిమనస్ నిర్వహణలో అత్యుత్తమ ప్రయత్నాలు"
      ],
      correctAnswerIndex:1,
      explanation: "ఆల్ఫ్రెడ్ నోబెల్ 2023 జ్ఞాపకార్థం క్లాడియా గోల్డిన్‌కు స్వేరిజెస్ రిక్స్‌బ్యాంక్ ప్రైజ్ ఇన్ ఎకనామిక్ సైన్సెస్‌ను అందజేయడం జరిగింది, ఇది మహిళల కార్మిక మార్కెట్ ఫలితాలపై మన అవగాహనను అభివృద్ధి చేసినందుకు.",
    ),


    Question(
      questionText: "ఇన్‌ఫ్రాస్ట్రక్చర్ ఇయర్‌బుక్ 2023 ప్రకారం, 2024 మరియు 2030 ఆర్థిక సంవత్సరాల మధ్య భారతదేశం ఇన్‌ఫ్రాస్ట్రక్చర్‌లో ఎంత పెట్టుబడి పెట్టాలని ప్లాన్ చేస్తుంది?",
      options:["₹67 లక్షల కోట్లు", "₹100 లక్షల కోట్లు", "₹143 లక్షల కోట్లు", "₹200 లక్షల కోట్లు"],
      correctAnswerIndex:2,
      explanation: "భారతదేశం 2024 మరియు 2030 ఆర్థిక సంవత్సరాల మధ్య మౌలిక సదుపాయాలలో దాదాపు ₹143 లక్షల కోట్ల పెట్టుబడి పెట్టాలని యోచిస్తోంది, ఇది గత ఏడు ఆర్థిక సంవత్సరాల్లో ఖర్చు చేసిన మొత్తం కంటే రెట్టింపు కంటే ఎక్కువ.",
    ),
    Question(
      questionText: "గత మూడు వరుస నెలలుగా 'ప్రపంచంలోనే అత్యంత సమయపాలన పాటించే విమానాశ్రయం'గా ఏ విమానాశ్రయం గుర్తింపు పొందింది?",
      options:["ఇందిరా గాంధీ అంతర్జాతీయ విమానాశ్రయం", "ఛత్రపతి శివాజీ మహారాజ్ అంతర్జాతీయ విమానాశ్రయం", "కెంపేగౌడ అంతర్జాతీయ విమానాశ్రయం", "రాజీవ్ గాంధీ అంతర్జాతీయ విమానాశ్రయం"],
      correctAnswerIndex:2,
      explanation: "బెంగళూరులోని కెంపేగౌడ అంతర్జాతీయ విమానాశ్రయం గత మూడు నెలలుగా 'ప్రపంచంలోనే అత్యంత సమయస్ఫూర్తితో పనిచేసే విమానాశ్రయం'గా గుర్తింపు పొందింది.",
    ),
    Question(
      questionText: "15వ వార్షిక మెర్సర్ CFA ఇన్‌స్టిట్యూట్ గ్లోబల్ పెన్షన్ ఇండెక్స్ (MCGPI)లో భారతదేశం ర్యాంక్ ఎంత?",
      options:["25వ", "37వ", "45వ", "52వ"],
      correctAnswerIndex:2,
      explanation: "15వ వార్షిక మెర్సర్ CFA ఇన్‌స్టిట్యూట్ గ్లోబల్ పెన్షన్ ఇండెక్స్ (MCGPI)లో విశ్లేషించబడిన 47 సిస్టమ్‌లలో భారతదేశం 45వ ర్యాంక్‌కు చేరుకోవడం ద్వారా అభివృద్ధిని కనబరిచింది.",
    ),
    Question(
      questionText: "యూరోపియన్ యూనియన్ టాక్స్ అబ్జర్వేటరీ ప్రచురించిన 'గ్లోబల్ టాక్స్ ఎగవేషన్ రిపోర్ట్ 2024' బిలియనీర్ల కోసం ఏమి ప్రతిపాదిస్తుంది?",
      options:["తక్కువ ఆదాయపు పన్ను", "2% ప్రపంచ సంపద పన్ను", "పన్ను మినహాయింపులు", "తగ్గిన కార్పొరేట్ పన్ను"],
      correctAnswerIndex:1,
      explanation: "ప్రపంచ పన్నుల ఎగవేత నివేదిక 2024' బిలియనీర్లపై 2% ప్రపంచ సంపద పన్నును పన్ను ఎగవేతను ఎదుర్కోవడానికి మరియు సుమారుగా 250 బిలియన్ డాలర్లను సంపాదించడానికి ప్రతిపాదించింది.",
    ),
    Question(
      questionText: "IQAir ప్రకారం, ఏ భారతీయ నగరం అత్యంత కలుషితమైన రెండవ స్థానంలో ఉంది మరియు గాలి నాణ్యత సవాళ్ల పరంగా ప్రపంచవ్యాప్తంగా ఏ నగరం ఆరవ స్థానంలో ఉంది?",
      options:["ఢిల్లీ మరియు కోల్‌కతా", "ముంబయి మరియు చెన్నై", "చెన్నై మరియు ఢిల్లీ", "ముంబయి మరియు ఢిల్లీ"],
    correctAnswerIndex:3,
    explanation: "IQAir ప్రకారం, ముంబై అత్యంత కాలుష్య నగరంగా రెండవ స్థానంలో ఉంది మరియు గాలి నాణ్యత సవాళ్ల పరంగా ఢిల్లీ ప్రపంచవ్యాప్తంగా ఆరవ స్థానంలో ఉంది.",
    ),
    Question(
      questionText: "అంతర్జాతీయ క్రికెట్ కౌన్సిల్ (ICC) ద్వారా క్రికెట్ ప్రపంచ కప్ 2023కి 'గ్లోబల్ అంబాసిడర్'గా ఎవరు నియమించబడ్డారు?",
      options:["విరాట్ కోహ్లీ", "MS ధోని", "రోహిత్ శర్మ", "సచిన్ టెండూల్కర్"],
      correctAnswerIndex:3,
      explanation: "సచిన్ టెండూల్కర్‌ను అంతర్జాతీయ క్రికెట్ కౌన్సిల్ (ICC) క్రికెట్ ప్రపంచ కప్ 2023కి 'గ్లోబల్ అంబాసిడర్'గా నియమించింది.",
    ),
    Question(
        questionText: "చెత్త రహిత భారతదేశం' దార్శనికతను సాకారం చేసేందుకు సూక్ష్మ, చిన్న మరియు మధ్య తరహా పరిశ్రమల మంత్రిత్వ శాఖ (MSME) ఏ చొరవ తీసుకుంది?",
        options:["క్లీనెస్ డ్రైవ్‌ను ప్రారంభించడం", "'శ్రమదాన్' ఈవెంట్‌ను నిర్వహించడం", "వేస్ట్ మేనేజ్‌మెంట్ యాప్‌ను ప్రారంభించడం", "దేశవ్యాప్త రీసైక్లింగ్ ప్రోగ్రామ్‌ను అమలు చేయడం"],
        correctAnswerIndex:1,
        explanation: "చెత్త రహిత భారతదేశం దిశగా సామూహిక బాధ్యత మరియు కార్యాచరణ స్ఫూర్తిని పెంపొందించడానికి సూక్ష్మ, చిన్న మరియు మధ్య తరహా పరిశ్రమల మంత్రిత్వ శాఖ (MSME) 'శ్రమదాన్' కార్యక్రమాన్ని నిర్వహించింది."
    ),
    Question(
      questionText: "అందించిన సమాచారం ప్రకారం శ్రీలంక రాబోయే రెండు సంవత్సరాలకు ఏ సంస్థకు అధ్యక్షత వహిస్తుంది?",
      options:["యునైటెడ్ నేషన్స్", "సౌత్ ఏషియన్ అసోసియేషన్ ఫర్ రీజినల్ కోఆపరేషన్ (సార్క్)", "ఇండియన్ ఓషన్ రిమ్ అసోసియేషన్ (IORA)", "వరల్డ్ హెల్త్ ఆర్గనైజేషన్ (WHO)"],
      correctAnswerIndex:2,
      explanation: "రాబోయే రెండేళ్లపాటు హిందూ మహాసముద్ర రిమ్ అసోసియేషన్ (IORA) అధ్యక్షుడిగా శ్రీలంక బాధ్యతలు చేపట్టనుంది.",
    ),
    Question(
      questionText: "2022-23 సంవత్సరానికి గానూ 'బెస్ట్ ఇన్నోవేషన్ ఇన్ రిఫైనరీ' అవార్డును ఏ రిఫైనరీ పొందింది?",
      options:["IOCL", "BPCL", "HPCL", "మంగుళూరు రిఫైనరీ అండ్ పెట్రోకెమికల్స్ లిమిటెడ్ (MRPL)"],
      correctAnswerIndex:3,
      explanation: "మంగుళూరు రిఫైనరీ అండ్ పెట్రోకెమికల్స్ లిమిటెడ్ (MRPL) 26వ ఎనర్జీ టెక్నాలజీ మీట్ 2023లో 2022-23 సంవత్సరానికి గానూ 'బెస్ట్ ఇన్నోవేషన్ ఇన్ రిఫైనరీ' అవార్డును అందుకుంది.",
    ),
    Question(
      questionText: "భారత పార్లమెంట్ నిర్వహించే తొమ్మిదవ P20 సమ్మిట్ యొక్క థీమ్ ఏమిటి?",
      options:["గ్లోబల్ ఎకనామిక్ గ్రోత్ స్ట్రాటజీస్", "స్స్టెయినబుల్ డెవలప్‌మెంట్ కోసం పార్లమెంటులు", "ఒకే భూమి, ఒక కుటుంబం, ఒక భవిష్యత్తు కోసం పార్లమెంటులు", "గవర్నెన్స్‌లో డిజిటల్ ట్రాన్స్‌ఫర్మేషన్"],
      correctAnswerIndex:2,
      explanation: "భారతదేశం పార్లమెంటు నిర్వహించే తొమ్మిదవ P20 సమ్మిట్ యొక్క థీమ్ 'ఒక భూమి, ఒక కుటుంబం, ఒక భవిష్యత్తు కోసం పార్లమెంటులు', ఒక కుటుంబం వలె ప్రపంచం యొక్క పరస్పర అనుసంధానాన్ని నొక్కి చెబుతుంది.",
    ),
    Question(
      questionText: "141వ అంతర్జాతీయ ఒలింపిక్ కమిటీ (IOC) సెషన్‌ను ఎవరు ప్రారంభించబోతున్నారు మరియు అది ఎక్కడ జరుగుతుంది?",
      options:["భారత రాష్ట్రపతి - రాష్ట్రపతి భవన్, న్యూఢిల్లీ", "UN సెక్రటరీ-జనరల్ - ఐక్యరాజ్యసమితి ప్రధాన కార్యాలయం, న్యూయార్క్", "ప్రధాని నరేంద్ర మోడీ - జియో వరల్డ్ సెంటర్, ముంబై", "IOC ప్రెసిడెంట్ - లాసాన్, స్విట్జర్లాండ్" ],
      correctAnswerIndex:2,
      explanation: "అక్టోబర్ 14న ముంబైలోని జియో వరల్డ్ సెంటర్‌లో 141వ అంతర్జాతీయ ఒలింపిక్ కమిటీ (ఐఓసీ) సెషన్‌ను ప్రధాని నరేంద్ర మోదీ ప్రారంభించనున్నారు.",
    ),
    Question(
      questionText: "పర్యాటక రంగానికి సంబంధించి దాని G20 ప్రెసిడెన్సీ సమయంలో భారతదేశానికి కీలకమైన ఫోకస్‌గా ఏది హైలైట్ చేయబడింది?",
      options:["స్పేస్ టూరిజం", "బాధ్యతగల మరియు స్థిరమైన పర్యాటకం", "సాహస పర్యాటకం", "సాంస్కృతిక పర్యాటకం"],
      correctAnswerIndex:1,
      explanation: "పర్యాటక సందర్భంలో G20 ప్రెసిడెన్సీ సమయంలో భారతదేశానికి బాధ్యతాయుతమైన మరియు స్థిరమైన పర్యాటకం ఒక కీలకమైన దృష్టిగా హైలైట్ చేయబడింది.",
    ),
    Question(
      questionText: "ప్రపంచ ప్రకృతి దినోత్సవం ఏ రోజు వస్తుంది మరియు దాని ప్రాముఖ్యత ఏమిటి?",
      options:["అక్టోబర్ 3 - జీవవైవిధ్యం మరియు ప్రకృతి పరిరక్షణను జరుపుకోవడం", "అక్టోబర్ 5 - పర్యావరణ విజయాలను గుర్తించడం", "అక్టోబర్ 9 - పర్యావరణ అనుకూల పద్ధతులను ప్రోత్సహించడం", "అక్టోబర్ 11 - స్థిరమైన వ్యవసాయంపై దృష్టి పెట్టడం"],
      correctAnswerIndex:0,
      explanation: "అక్టోబర్ 3న ప్రపంచ ప్రకృతి దినోత్సవం జరుపుకుంటారు, జీవవైవిధ్యాన్ని జరుపుకోవడం మరియు ప్రపంచవ్యాప్తంగా ప్రకృతి పరిరక్షణను ప్రోత్సహించడం యొక్క ప్రాముఖ్యతను నొక్కి చెప్పారు.",
    ),
    Question(
      questionText: "ఏ వారంలో 69వ వన్యప్రాణుల వారోత్సవాలు జరుపుకుంటారు మరియు దాని థీమ్ ఏమిటి?",
      options:["అక్టోబర్ 2 నుండి అక్టోబర్ 8 వరకు - థీమ్: 'పరిరక్షణ సవాళ్లు'", "అక్టోబర్ 10 నుండి అక్టోబర్ 16 వరకు - థీమ్: 'జీవవైవిధ్య పరిరక్షణ'", "అక్టోబర్ 15 నుండి అక్టోబర్ 21 వరకు - థీమ్: 'వన్యప్రాణుల రక్షణ చర్యలు'", " అక్టోబర్ 18 నుండి అక్టోబర్ 24 వరకు - థీమ్: 'ఎకో-ఫ్రెండ్లీ లివింగ్'"],
      correctAnswerIndex:0,
      explanation: "69వ వన్యప్రాణుల వారోత్సవాలు అక్టోబర్ 2 నుండి అక్టోబర్ 8 వరకు 'వన్యప్రాణుల సంరక్షణ కోసం భాగస్వామ్యాలు' అనే థీమ్‌తో జరుపుకుంటారు. వన్యప్రాణుల పరిరక్షణలో సహకార ప్రయత్నాల ప్రాముఖ్యతను హైలైట్ చేయడం దీని లక్ష్యం.",
    ),
    Question(
      questionText: "అక్టోబర్ 10న ప్రపంచ మానసిక ఆరోగ్య దినోత్సవం యొక్క థీమ్ ఏమిటి?",
      options:["బ్రేకింగ్ ది స్టిగ్మా: మెంటల్ హెల్త్ మేటర్స్", "మైండ్ మేటర్స్: నార్చర్ing మానసిక క్షేమం", "అందరికీ మానసిక ఆరోగ్యం: కలిసి మాట్లాడుదాం", "మానసిక ఆరోగ్యాన్ని ప్రోత్సహించడం"],
      correctAnswerIndex:1,
      explanation: "అక్టోబర్ 10న ప్రపంచ మానసిక ఆరోగ్య దినోత్సవం యొక్క ఇతివృత్తం 'మైండ్ మేటర్స్: మెంటల్ వెల్‌బీయింగ్‌ను పెంపొందించడం', ఇది ప్రపంచవ్యాప్తంగా మానసిక ఆరోగ్యాన్ని ప్రోత్సహించడం యొక్క ప్రాముఖ్యతను నొక్కి చెబుతుంది.",
    ),
    Question(
      questionText: "అక్టోబర్ 17న పేదరిక నిర్మూలన కోసం అంతర్జాతీయ దినోత్సవం యొక్క థీమ్ ఏమిటి?",
      options:["పేదరికాన్ని అంతం చేయడం: ఒక సామూహిక బాధ్యత", "మర్యాదపూర్వకమైన పని మరియు సామాజిక రక్షణ: అందరికీ గౌరవాన్ని ఆచరణలో పెట్టడం", "పేదరిక చక్రాన్ని ఛేదించడానికి కమ్యూనిటీలను శక్తివంతం చేయడం", "స్థిరమైన భవిష్యత్తును నిర్మించడం: పేదరిక రహిత ప్రపంచం"],
      correctAnswerIndex:1,
      explanation: "అక్టోబర్ 17న పేదరిక నిర్మూలన కోసం అంతర్జాతీయ దినోత్సవం యొక్క థీమ్ 'మర్యాదపూర్వకమైన పని మరియు సామాజిక రక్షణ: అందరికీ గౌరవాన్ని ఆచరణలో పెట్టడం', పేదరికాన్ని అధిగమించడంలో గౌరవప్రదమైన పని మరియు సామాజిక రక్షణ యొక్క ప్రాముఖ్యతపై దృష్టి సారిస్తుంది.",
    ),
    Question(
      questionText: "ప్రపంచ అభివృద్ధి సమాచార దినోత్సవంగా ఏ రోజును పాటిస్తారు మరియు దాని ప్రాముఖ్యత ఏమిటి?",
      options:["అక్టోబర్ 24 - ప్రపంచ అభివృద్ధిలో విజయాలను జరుపుకోవడం", "అక్టోబర్ 27 - అభివృద్ధి కోసం సమాచార ప్రాప్యతను ప్రోత్సహించడం", "అక్టోబర్ 30 - స్థిరమైన అభివృద్ధి లక్ష్యాలలో పురోగతిని హైలైట్ చేయడం", "అక్టోబర్ 31 - అభివృద్ధి కోసం సాంకేతికతలో పురోగతిని గుర్తించడం"] ,
      correctAnswerIndex:2,
      explanation: "అక్టోబర్ 24న ప్రపంచ అభివృద్ధి సమాచార దినోత్సవం జరుపుకుంటారు, ప్రపంచవ్యాప్తంగా స్థిరమైన అభివృద్ధి లక్ష్యాలలో పురోగతిని హైలైట్ చేయడం లక్ష్యంగా పెట్టుకుంది.",
    ),
    Question(
      questionText: "ఐక్యరాజ్యసమితి దినోత్సవాన్ని ఏ రోజు జరుపుకుంటారు మరియు దాని ప్రయోజనం ఏమిటి?",
      options:["అక్టోబర్ 24 - ఐక్యరాజ్యసమితి స్థాపన జ్ఞాపకార్థం", "అక్టోబర్ 29 - అంతర్జాతీయ సహకారాన్ని ప్రోత్సహించడం", "అక్టోబర్ 31 - ప్రపంచ ఐక్యతపై దృష్టి పెట్టడం", "నవంబర్ 1 - శాంతి పరిరక్షణలో UN విజయాలను హైలైట్ చేయడం"],
      correctAnswerIndex:0,
      explanation: "యునైటెడ్ నేషన్స్ డేని అక్టోబర్ 24న జరుపుకుంటారు, ఐక్యరాజ్యసమితి స్థాపన జ్ఞాపకార్థం మరియు శాంతి మరియు అభివృద్ధికి అంతర్జాతీయ సహకారాన్ని ప్రోత్సహిస్తుంది.",
    ),
    Question(
      questionText: "విజిలెన్స్ అవేర్‌నెస్ వీక్ 2023 ఏ వారంలో జరుపుకుంటారు మరియు దాని థీమ్ ఏమిటి?",
      options:["అక్టోబర్ 30 నుండి నవంబర్ 5 వరకు - థీమ్: 'అవినీతికి నో చెప్పండి; దేశానికి కట్టుబడి ఉండండి'", "నవంబర్ 1 నుండి నవంబర్ 7 వరకు - థీమ్: 'మెరుగైన రేపటి కోసం నైతిక పాలన'", "నవంబర్ 8 నుండి నవంబర్ 14 వరకు - థీమ్: 'పారదర్శకత మరియు జవాబుదారీతనం'", "నవంబర్ 15 నుండి నవంబర్ 21 వరకు - థీమ్: 'పరిపాలనలో పౌరుల పాత్ర'"],
      correctAnswerIndex:0,
      explanation: "విజిలెన్స్ అవేర్‌నెస్ వీక్ 2023ని అక్టోబర్ 30 నుండి నవంబర్ 5 వరకు 'అవినీతికి నో చెప్పండి; దేశానికి కట్టుబడి ఉండండి' అనే థీమ్‌తో నైతిక పాలన యొక్క ప్రాముఖ్యతను నొక్కి చెబుతారు.",
    ),
    Question(
      questionText: "ప్రపంచ నగరాల దినోత్సవం ఏ రోజున నిర్వహించబడుతుంది మరియు సంవత్సరానికి థీమ్ ఏమిటి?",
      options:["అక్టోబర్ 29 - థీమ్: 'సస్టైనబుల్ అర్బన్ ఫ్యూచర్స్ బిల్డింగ్'", "అక్టోబర్ 31 - థీమ్: 'అందరికీ ఆర్థిక స్థిరమైన పట్టణ భవిష్యత్తు'", "నవంబర్ 2 - థీమ్: 'మెరుగైన రేపటి కోసం స్మార్ట్ నగరాలు'", " నవంబర్ 5 - థీమ్: 'ఎంపవర్రింగ్ అర్బన్ కమ్యూనిటీస్'"],
      correctAnswerIndex:1,
      explanation: "ప్రపంచ నగరాల దినోత్సవం అక్టోబర్ 31న 'అందరికీ ఆర్థిక స్థిరమైన పట్టణ భవిష్యత్తు' అనే థీమ్‌తో నిర్వహించబడుతుంది, స్థిరమైన పట్టణ అభివృద్ధికి సంబంధించిన ఆర్థిక అంశాలపై దృష్టి సారిస్తుంది.",
    ),
    Question(
      questionText: "స్వావ్లంబన్ ఈవెంట్‌లో ఇండియన్ నేవీ ఏ ప్లాట్‌ఫారమ్‌లను ఆవిష్కరించనుంది?",
      options:["స్టెల్త్ గైడెడ్ మిస్సైల్ డిస్ట్రాయర్ మరియు అటాక్ సబ్‌మెరైన్", "అటానమస్ వెపనైజ్డ్ బోట్ స్వార్మ్స్ మరియు అటానమస్ వెసెల్ అండర్ వాటర్ (AUV)", "స్వదేశీ ఆస్ట్రా బియాండ్ విజువల్ రేంజ్ మిస్సైల్స్ మరియు అడ్వాన్స్‌డ్ ఎయిర్ డిఫెన్స్ సిస్టమ్స్", "తదుపరి తరం మరియు మానవరహిత విమాన వాహకనౌక వాహనాలు (UAVలు)"],
      correctAnswerIndex:1,
      explanation: "భారత నావికాదళం స్వావ్లంబన్ ఈవెంట్‌లో రెండు విశేషమైన ప్లాట్‌ఫారమ్‌లను ఆవిష్కరించడానికి సిద్ధంగా ఉంది: అటానమస్ వెపనైజ్డ్ బోట్ స్వార్మ్స్ మరియు అటానమస్ వెసెల్ అండర్ వాటర్ (AUV).",
    ),
    Question(
      questionText: "REC లిమిటెడ్ ప్రారంభించిన 'SUGAM REC' మొబైల్ అప్లికేషన్ యొక్క ప్రయోజనం ఏమిటి?",
      options:["పవర్ సెక్టార్ ఫైనాన్సింగ్", "54EC క్యాపిటల్ గెయిన్ ట్యాక్స్ మినహాయింపు బాండ్స్‌లో పెట్టుబడి", "NBFCల కోసం డిజిటల్ ఇన్నోవేషన్", "పునరుత్పాదక ఇంధన ప్రాజెక్టులను ప్రోత్సహించడం"],
      correctAnswerIndex:1,
      explanation: "REC లిమిటెడ్ తన తాజా డిజిటల్ ఆవిష్కరణ, 'SUGAM REC' మొబైల్ అప్లికేషన్‌ను ప్రారంభించినట్లు ప్రకటించింది, ఇది REC యొక్క 54EC క్యాపిటల్ గెయిన్ ట్యాక్స్ మినహాయింపు బాండ్‌లపై ఆసక్తి ఉన్న పెట్టుబడిదారుల అవసరాలను తీర్చడానికి రూపొందించబడింది.",
    ),
    Question(
      questionText: "విదేశీ వాణిజ్య విధానం (FTP) 2023 కింద సిస్టమ్-ఆధారిత ఆటోమేటిక్ 'స్టేటస్ హోల్డర్' సర్టిఫికేట్‌లను ఎవరు ఆవిష్కరించారు?",
      options:["పీయూష్ గోయల్", "అమిత్ షా", "నరేంద్ర మోడీ", "హేమంత్ సోరెన్"],
      correctAnswerIndex:0,
      explanation: "కేంద్ర వాణిజ్యం & పరిశ్రమలు, వినియోగదారుల వ్యవహారాలు, ఆహారం & ప్రజాపంపిణీ మరియు జౌళి శాఖ మంత్రి శ్రీ పీయూష్ గోయల్ ఫారిన్ ట్రేడ్ పాలసీ (FTP) కింద సిస్టమ్ ఆధారిత ఆటోమేటిక్ 'స్టేటస్ హోల్డర్' సర్టిఫికేట్‌లను ఆవిష్కరించారు.2023",
    ),
    Question(
      questionText: "2023లో ప్రధానమంత్రి నరేంద్ర మోడీ నేతృత్వంలో స్వచ్ఛతా హి సేవా (SHS) ప్రచారం యొక్క థీమ్ ఏమిటి?",
      options:["క్లీన్ ఇండియా, గ్రీన్ ఇండియా", "హెల్తీ ఇండియా, హ్యాపీ ఇండియా", "గార్బేజ్ ఫ్రీ ఇండియా", "స్వచ్ఛ భారత్ దివస్"],
      correctAnswerIndex:2,
      explanation: "SHS-2023 యొక్క థీమ్ 'గార్బేజ్ ఫ్రీ ఇండియా,' దృశ్య పరిశుభ్రత మరియు సఫాయిమిత్రల (పారిశుద్ధ్య కార్మికులు) సంక్షేమంపై ప్రత్యేక దృష్టి పెట్టింది.",
    ),
    Question(
      questionText: "సెంట్రల్ రిజర్వ్ పోలీస్ ఫోర్స్ (CRPF) ప్రారంభించిన 'యశస్విని' పేరుతో మొత్తం మహిళా బైకర్ల సాహసయాత్ర ర్యాలీ యొక్క థీమ్ ఏమిటి?",
      options:["ఎంపవర్‌మెంట్ రైడ్", "విమెన్ ఆన్ వీల్స్", "యశస్విని ర్యాలీ", "బైకర్స్ ఫర్ చేంజ్"],
      correctAnswerIndex:2,
      explanation: "సిఆర్‌పిఎఫ్ ప్రారంభించిన మొత్తం మహిళా బైకర్ల యాత్ర ర్యాలీకి 'యశస్విని' అని పేరు పెట్టారు, ఇది మహిళా సాధికారతకు ప్రతీక.",
    ),
    Question(
      questionText: "సామాజిక న్యాయం & సాధికారత మంత్రిత్వ శాఖ ప్రారంభించిన 'లక్ష్య ప్రాంతాలలోని ఉన్నత పాఠశాలల్లో విద్యార్థుల కోసం రెసిడెన్షియల్ ఎడ్యుకేషన్ పథకం' (SHRESHTA) యొక్క ప్రాథమిక లక్ష్యం ఏమిటి?",
      options:["పాఠశాలల్లో క్రీడలను ప్రోత్సహించడం", "విద్య ద్వారా SC వర్గాలకు సాధికారత కల్పించడం", "ఉన్నత విద్య కోసం స్కాలర్‌షిప్‌లు అందించడం", "గ్రామీణ ప్రాంతాల్లో కొత్త పాఠశాలలను నిర్మించడం"],
      correctAnswerIndex:1,
      explanation: "ప్రభుత్వ అభివృద్ధి కార్యక్రమాల ప్రభావాన్ని విస్తరించడం మరియు విద్యా రంగంలో SC కమ్యూనిటీలు ఎక్కువగా నివసించే ప్రాంతాల్లో సేవా అంతరాలను పరిష్కరించడం శ్రేష్ట యొక్క ప్రాథమిక లక్ష్యం.",
    ),
    Question(
      questionText: "డిపార్ట్‌మెంట్ ఆఫ్ అడ్మినిస్ట్రేటివ్ రిఫార్మ్స్ అండ్ పబ్లిక్ గ్రీవెన్స్ (DARPG)లో డాక్టర్ జితేంద్ర సింగ్ ప్రారంభించిన స్పెషల్ క్యాంపెయిన్ 3.0 యొక్క థీమ్ ఏమిటి?",
      options:["సర్వీస్ ఎక్సలెన్స్", "డిజిటల్ DARPG", "సమర్థవంతమైన ప్రభుత్వం", "టెక్నలాజికల్ గవర్నెన్స్"],
      correctAnswerIndex:1,
      explanation: "డిపార్ట్‌మెంట్ ఆఫ్ అడ్మినిస్ట్రేటివ్ రిఫార్మ్స్ అండ్ పబ్లిక్ గ్రీవెన్స్ (DARPG)లో స్పెషల్ క్యాంపెయిన్ 3.0 'డిజిటల్ DARPG' థీమ్‌తో రూపొందించబడింది, ఇది సర్వీస్ డెలివరీని మెరుగుపరచడం, అభివృద్ధి చెందుతున్న సాంకేతికతలను ఉపయోగించడం మరియు ప్రభుత్వ కార్యాలయాలలో సమర్థవంతమైన నిర్వహణను నిర్ధారించడం లక్ష్యంగా ఉంది.",
    ),
    Question(
      questionText: "ఇటీవల కేంద్ర రోడ్డు రవాణా & రహదారుల మంత్రి నితిన్ గడ్కరీ నుండి అరుణాచల్ ప్రదేశ్‌లో ఎన్ని వంతెన ప్రాజెక్టులు ఆమోదం పొందాయి?",
      options:["మూడు", "ఐదు", "ఏడు", "పది"],
      correctAnswerIndex:2,
      explanation: "అరుణాచల్ ప్రదేశ్‌లోని ఏడు వంతెన ప్రాజెక్టులు ఇటీవల కేంద్ర రోడ్డు రవాణా & రహదారుల మంత్రి నితిన్ గడ్కరీ నుండి ఆమోదం పొందాయి.",
    ),
    Question(
      questionText: "ఆరోగ్య మంత్రిత్వ శాఖ ప్రారంభించిన ఫ్లాగ్‌షిప్ ఇమ్యునైజేషన్ క్యాంపెయిన్ ఇండియాస్ ఇంటెన్సిఫైడ్ మిషన్ ఇంద్రధనుష్ (IMI) 5.0 యొక్క లక్ష్యం ఏమిటి?",
      options:["తల్లి ఆరోగ్యాన్ని ప్రోత్సహించడం", "విద్యను మెరుగుపరచడం", "పిల్లలు మరియు గర్భిణీ స్త్రీలకు టీకాలు వేయడం", "శుభ్రమైన నీటి సరఫరాను నిర్ధారించడం"],
      correctAnswerIndex:2,
      explanation: "IMI 5.0 యొక్క లక్ష్యం దేశవ్యాప్తంగా గర్భిణీ స్త్రీలతో పాటు టీకా డోస్ తప్పిపోయిన లేదా వారి టీకా షెడ్యూల్ వెనుక పడిపోయిన పిల్లలను చేరుకోవడం.",
    ),
    Question(
      questionText: "ఆర్థిక చేరికను ప్రోత్సహించడంలో సాధించిన విజయాన్ని ప్రతిబింబిస్తూ ప్రధాన మంత్రి జన్ ధన్ యోజన (PMJDY) ఎంత మంది లబ్ధిదారులను కలిగి ఉంది?",
      options:["25 కోట్లు", "40 కోట్లు", "50 కోట్లు", "60 కోట్లు"],
      correctAnswerIndex:2,
      explanation: "PMJDY విశేషమైన విజయాన్ని సాధించింది, 50 కోట్ల మంది లబ్ధిదారులు మరియు మొత్తం బ్యాలెన్స్‌లో గణనీయమైన పెరుగుదల, ముఖ్యంగా కోవిడ్-19 తర్వాత.",
    ),
    Question(
      questionText: "మార్కెటింగ్ సీజన్ 2024-25 కోసం రబీ పంటల కనీస మద్దతు ధరలను (MSP) ఆర్థిక వ్యవహారాలపై క్యాబినెట్ కమిటీ ఇటీవల ఆమోదించిన పెరుగుదలపై దృష్టి కేంద్రీకరించడం ఏమిటి?",
      options:["పంటల ఎగుమతిని ప్రోత్సహించడం", "రైతులకు సరసమైన ధరలను నిర్ధారించడం", "వ్యవసాయ ఉత్పత్తిని తగ్గించడం", "సేంద్రీయ వ్యవసాయాన్ని ప్రోత్సహించడం"],
      correctAnswerIndex:1,
      explanation: "MSPలో ఇటీవల ఆమోదించబడిన పెంపు రైతులకు సరసమైన ధరలను నిర్ధారించడం మరియు పంటల వైవిధ్యతను ప్రోత్సహించడం లక్ష్యంగా ఉంది.",
    ),
    Question(
      questionText: "ఇండియన్ ఫిన్‌టెక్ యునికార్న్ స్లైస్ మరియు నార్త్ ఈస్ట్ స్మాల్ ఫైనాన్స్ బ్యాంక్ (NESFB) మధ్య సహకారం యొక్క దృష్టి ఏమిటి?",
      options:["వ్యవసాయాన్ని విప్లవాత్మకంగా మార్చడం", "ఆర్థిక చేరికలను విస్తరించడం", "ఆరోగ్య సంరక్షణ సేవలను అభివృద్ధి చేయడం", "పునరుత్పాదక శక్తిని ప్రోత్సహించడం"],
      correctAnswerIndex:1,
      explanation: "స్లైస్ మరియు NESFB మధ్య సహకారం బ్యాంకింగ్ సేవలను విప్లవాత్మకంగా మార్చడం మరియు భారతదేశంలో ఆర్థిక చేరికలను విస్తరించడం లక్ష్యంగా పెట్టుకుంది.",
    ),
    Question(
      questionText: "ఆకుపచ్చ హైడ్రోజన్ సరఫరా గొలుసును భద్రపరచడం మరియు పవర్ గ్రిడ్ ఇంటర్‌కనెక్షన్‌పై సహకరించడంపై భారతదేశం మరియు సౌదీ అరేబియా ఏ కార్యక్రమంలో అవగాహన ఒప్పందం (MOU) సంతకం చేశాయి?",
      options:["ASEAN Summit", "MENA Climate Week 2023", "G7 Summit", "BRICS Summit"],
      correctAnswerIndex:1,
      explanation: "మెనా క్లైమేట్ వీక్ 2023లో భారతదేశం మరియు సౌదీ అరేబియా మధ్య అవగాహన ఒప్పందం రియాద్‌లో అధికారికంగా చేయబడింది.",
    ),
    Question(
      questionText: "టైర్ తయారీదారు Br మధ్య సహకారం యొక్క ముఖ్య లక్ష్యం ఏమిటిఇడ్జెస్టోన్ ఇండియా మరియు టాటా పవర్?",
      options:["వ్యవసాయాన్ని ప్రోత్సహించడం", "విద్యను మెరుగుపరచడం", "ఎలక్ట్రిక్ మొబిలిటీకి మద్దతు ఇవ్వడం", "ఆరోగ్య సంరక్షణ సేవలను అభివృద్ధి చేయడం"],
      correctAnswerIndex:2,
      explanation: "భారతదేశంలో పెరుగుతున్న EV పర్యావరణ వ్యవస్థకు మద్దతునిస్తూ, బ్రిడ్జ్‌స్టోన్ డీలర్‌షిప్‌ల వద్ద అధిక-సామర్థ్యం కలిగిన DC ఫాస్ట్ ఛార్జర్‌లను ఇన్‌స్టాల్ చేయడం ద్వారా ఎలక్ట్రిక్ మొబిలిటీని ప్రోత్సహించడం ఈ సహకారం లక్ష్యం.",
    ),
    Question(
        questionText: "భారతదేశంలో ఒలింపిక్ వాల్యూస్ ఎడ్యుకేషన్ ప్రోగ్రామ్ (OVEP) విజయాన్ని సాధించేందుకు ఏ రెండు సంస్థలు సమం చేశాయి?",
        options:["UNESCO మరియు WHO", "IOC మరియు FIFA", "రిలయన్స్ ఫౌండేషన్ మరియు ఒలింపిక్ మ్యూజియం", "NASA మరియు ESA"],
        correctAnswerIndex:2,
        explanation: "రిలయన్స్ ఫౌండేషన్ మరియు ఒలింపిక్ మ్యూజియం భారతదేశంలో ఒలింపిక్ విలువల విద్యా కార్యక్రమం (OVEP) యొక్క విజయాన్ని నిర్మించడానికి సమలేఖనం చేశాయి."
    ),
    Question(
      questionText: "రక్షణ మంత్రి రాజ్‌నాథ్ సింగ్ పర్యటన సందర్భంగా ఇటీవల భారతదేశం మరియు ఇటలీల మధ్య కుదిరిన ఒప్పందం ఏమిటి?",
      options:["హెల్త్‌కేర్ సహకారం", "సాంస్కృతిక మార్పిడి", "భద్రత మరియు రక్షణ సహకారం", "వాణిజ్య మరియు వాణిజ్య ఒప్పందం"],
      correctAnswerIndex:2,
      explanation: "భారత్ మరియు ఇటలీ మధ్య ఒప్పందం భద్రత మరియు రక్షణ సహకారం యొక్క వివిధ అంశాలను కలిగి ఉంటుంది.",
    ),
    Question(
      questionText: "ప్రధాన మంత్రి వీధి వ్యాపారుల ఆత్మనిర్భర్ నిధి (PM SVANIdhi) పథకం ఏ మైలురాయిని సాధించింది?",
      options:["10 లక్షల మంది వీధి వ్యాపారులకు సహాయం చేయడం", "50 లక్షలకు పైగా వీధి వ్యాపారులకు సహాయం అందించడం", "1 కోటి వీధి వ్యాపారులకు మద్దతు ఇవ్వడం", "25 లక్షల మంది వీధి వ్యాపారులకు చేరుకోవడం"],
      correctAnswerIndex:1,
      explanation: "ప్రధాన మంత్రి స్వనిధి పథకం దేశవ్యాప్తంగా 50 లక్షల మంది వీధి వ్యాపారులకు సహాయం అందించడం ద్వారా ఒక ముఖ్యమైన మైలురాయిని సాధించింది.",
    ),
    Question(
      questionText: "82-కిమీ పద్మ వంతెన రైలు లింక్‌ను ప్రారంభించడం ద్వారా ఇటీవల ఏ భారతదేశంలోని రాష్ట్రం మౌలిక సదుపాయాల అభివృద్ధిలో చారిత్రాత్మక ఘట్టాన్ని గుర్తించింది?",
      options:["పశ్చిమ బెంగాల్", "అస్సాం", "బెంగళూరు", "బంగ్లాదేశ్"],
      correctAnswerIndex:3,
      explanation: "చైనా బెల్ట్ అండ్ రోడ్ ఇనిషియేటివ్ కింద ముఖ్యమైన మౌలిక సదుపాయాల ప్రాజెక్ట్ అయిన 82-కిమీ పద్మ బ్రిడ్జ్ రైలు లింక్‌ను ప్రారంభించడం ద్వారా బంగ్లాదేశ్ ఒక చారిత్రాత్మక ఘట్టాన్ని గుర్తించింది.",
    ),



  ];
  int _elapsedTimeInSeconds = 0; // Elapsed exam time in seconds

  late Timer _examTimer;

  @override
  void initState() {
    super.initState();
    _loadLikedData();
    //_timerValueNotifier = ValueNotifier<int>(_timerSeconds);
    _startriversTimer();
  }
  void _startriversTimer() {
    _examTimer = Timer.periodic(Duration(seconds: 1), (timer) {
      setState(() {
        _elapsedTimeInSeconds++;
      });
    });
  }

  Future<void> _loadLikedData() async {
    // Load liked questions data here
    // ...
  }

  void _nextQuestion() {
    setState(() {
      if (_currentQuestionIndex < _questions.length - 1) {
        _currentQuestionIndex++;
        _selectedAnswerIndex = null;
      } else {
        // All questions have been answered, navigate to results screen
        _navigateToResults();
      }
    });
  }

  void _previousQuestion() {
    setState(() {
      if (_currentQuestionIndex > 0) {
        _currentQuestionIndex--;
        _selectedAnswerIndex = null;
      }
    });
  }

  void _navigateToResults() {
    // Navigate to results screen
    _examTimer.cancel(); // Cancel the exam timer before navigating
    Navigator.of(context).pushReplacement(
      MaterialPageRoute(
        builder: (context) => ResultsScreen(
          userAnswers: _userAnswers,
          questions: _questions,
          elapsedTimeInSeconds: _elapsedTimeInSeconds,
        ),
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Quiz'), // Set the title to 'Quiz' using Text widget
        backgroundColor: Colors.blueAccent,
      ),
      body: GestureDetector(
        onVerticalDragEnd: (details) {
          if (details.velocity.pixelsPerSecond.dy < 0) {
            // Swipe up detected, move to the next question
            _nextQuestion();
          } else if (details.velocity.pixelsPerSecond.dy > 0) {
            // Swipe down detected, move to the previous question
            _previousQuestion();
          }
        },
        onHorizontalDragEnd: (details) {
          if (details.primaryVelocity! > 0) {
            _previousQuestion();
          } else if (details.primaryVelocity! < 0) {
            _nextQuestion();
          }
        },
        child: ListView(
          padding: EdgeInsets.all(16.0),
          children: [
            MyBannerAdWidget(), // Add the banner ad here
            Text(
              "Question ${_currentQuestionIndex + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              _questions[_currentQuestionIndex].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),
            ..._questions[_currentQuestionIndex].options.asMap().entries.map((entry) {
              final optionIndex = entry.key;
              final optionText = entry.value;
              return InkWell( // Added this InkWell
                onTap: () {
                  setState(() {
                    _selectedAnswerIndex = optionIndex;
                    _userAnswers[_currentQuestionIndex] = optionIndex; // Store user's answer
                  });
                },
                child: ListTile(
                  title: Text(optionText),
                  leading: Radio<int>(
                    value: optionIndex,
                    groupValue: _selectedAnswerIndex,
                    onChanged: (int? value) {
                      setState(() {
                        _selectedAnswerIndex = value;
                        _userAnswers[_currentQuestionIndex] = value; // Store user's answer
                      });
                    },
                  ),
                ),
              );
            }).toList(),
            // Show correct answer if an option is selected
            if (_selectedAnswerIndex != null)
              Text(
                "Correct Answer: ${_questions[_currentQuestionIndex].options[_questions[_currentQuestionIndex].correctAnswerIndex]}",
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.green, // Set your desired color here
                ),
              ),

            MyBannerAdWidget(), // Add the banner ad here
          ],
        ),
      ),
      bottomNavigationBar: Container(
        color: Colors.red[400],
        child: Theme(
          data: Theme.of(context).copyWith(
            canvasColor: Colors.blueAccent[200],
          ),
          child: BottomNavigationBar(
            type: BottomNavigationBarType.fixed,
            items: const [
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_back, color: Colors.red, size: 40),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.arrow_forward_rounded, color: Colors.red, size: 40),
                label: '',
              ),
            ],
            onTap: (index) {
              if (index == 0) {
                _previousQuestion();
              } else if (index == 1) {
                _nextQuestion();
              }
            },
          ),
        ),
      ),
      // Overall exam timer display

      // Overall exam timer display
      // Overall exam timer display
      persistentFooterButtons: [
        Text(
          'Elapsed Time: ${_elapsedTimeInSeconds ~/ 60}:${(_elapsedTimeInSeconds % 60).toString().padLeft(2, '0')}',
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
      ],

    );
  }
  @override
  void dispose() {
    // Dispose of the exam timer when the widget is disposed
    _examTimer.cancel();
    super.dispose();
  }
}

class ResultsScreen extends StatelessWidget {
  final int elapsedTimeInSeconds;
  final List<int?> userAnswers;
  final List<Question> questions;

  ResultsScreen({required this.userAnswers, required this.questions, required this.elapsedTimeInSeconds});


  int calculateScore() {
    int score = 0;
    for (int i = 0; i < questions.length; i++) {
      if (userAnswers[i] != null && userAnswers[i] == questions[i].correctAnswerIndex) {
        score++;
      }
    }
    return score;
  }
  String formatElapsedTime(int seconds) {
    int minutes = seconds ~/ 60;
    int remainingSeconds = seconds % 60;
    return '$minutes:${remainingSeconds.toString().padLeft(2, '0')}';
  }
  @override
  Widget build(BuildContext context) {
    final int score = calculateScore();
    final String completedTime = formatElapsedTime(elapsedTimeInSeconds);
    return Scaffold(
      appBar: AppBar(
        title: Text("Results"),
        actions: [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text("Completed Time: $completedTime" ),
          ),
        ],
      ),
      body: ListView(
        padding: EdgeInsets.all(16.0),
        children: [
          MyBannerAdWidget(), // Add the banner ad here
          Text(
            "Your Score: $score/${questions.length}",
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16.0),
          for (int i = 0; i < questions.length; i++) ...[
            Text(
              "Question ${i + 1}:",
              style: TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.bold,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              questions[i].questionText,
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 8.0),
            Text(
              "Your Answer: ${userAnswers[i] != null ? questions[i].options[userAnswers[i]!] : 'Not answered'}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              "Correct Answer: ${questions[i].options[questions[i].correctAnswerIndex]}",
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 16.0),
            Text(
              "Explanation: ${questions[i].explanation}",
              style: TextStyle(fontSize: 16),
            ),
            SizedBox(height: 16.0),

          ],
        ],
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: october_te(),
  ));
}
